zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
<?xml version="1.0"?>
<!--
 Copyright (c) 2023 Microchip Technology Inc.

 SPDX-License-Identifier: Apache-2.0

 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
-->
<!--
CHPMKR VERSION: 2.11.0
-->
<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="4.5" public="true" xsi:noNamespaceSchemaLocation="https://schemas.microchip.com/com/microchip/atdf/4.5/atdf.xsd">
  <file timestamp="2026-06-04T09:25:28Z"/>
  <variants xmlns:mhc="http://www.atmel.com/schemas/avr-tools-device-file/mhc">
    <variant ordercode="PIC32CX2051BZ66048-I/3WW" mhc:ordercode="PIC32CX2051BZ66048-I/3WW" package="QFN48" speedmax="128000000" tempmin="-40" tempmax="85" vccmin="1.62" vccmax="3.63"/>
    <variant ordercode="PIC32CX2051BZ66048-E/3WW" mhc:ordercode="PIC32CX2051BZ66048-E/3WW" package="QFN48" speedmax="128000000" tempmin="-40" tempmax="125" vccmin="1.62" vccmax="3.63"/>
    <variant ordercode="PIC32CX2051BZ66048T-I/3WW" mhc:ordercode="PIC32CX2051BZ66048T-I/3WW" package="QFN48" speedmax="128000000" tempmin="-40" tempmax="85" vccmin="1.62" vccmax="3.63"/>
    <variant ordercode="PIC32CX2051BZ66048T-E/3WW" mhc:ordercode="PIC32CX2051BZ66048T-E/3WW" package="QFN48" speedmax="128000000" tempmin="-40" tempmax="125" vccmin="1.62" vccmax="3.63"/>
  </variants>
  <devices>
    <device name="PIC32CX2051BZ66048" architecture="CORTEX-M4" family="PIC32CX" series="PIC32CXBZ66">
      <address-spaces>
        <address-space id="base" name="base" start="0" size="0x100000000" endianness="little">
          <memory-segment name="ROM_SECURE_BOOT_ROM" start="0x0" size="0x10000" type="rom" rw="RW" exec="true"/>
          <memory-segment name="ROM_SECURE_BOOT_PATCH" start="0x18000" size="0x00000800" type="rom" rw="RW" exec="true"/>
          <memory-segment name="FCR_BFM" start="0x800000" size="0x10000" type="flash" pagesize="4096" rw="RW" exec="true"/>
          <memory-segment name="FCR_CFM" start="0x810000" size="0x1000" type="fuses" pagesize="4096" rw="RW"/>
          <memory-segment name="FCR_OTP_PAGE" start="0x811000" size="0x00001000" type="flash" pagesize="4096" rw="R" exec="true"/>
          <memory-segment name="FCR_PFM" start="0x1000000" size="0x00200000" type="flash" pagesize="4096" rw="RW" exec="true"/>
          <memory-segment name="CMCC_TCM" start="0x2000000" size="0x1000" type="other" rw="RW"/>
          <memory-segment name="QSPI" start="0x4000000" size="0x1000000" type="other" rw="RW" exec="true" external="true"/>
          <memory-segment name="RAM_SYSTEM_RAM" start="0x20000000" size="0x80000" type="ram" rw="RW" exec="true"/>
          <memory-segment name="PBA_BRIDGE" start="0x40000000" size="0x00004000" type="io" rw="RW"/>
          <memory-segment name="PBB_BRIDGE" start="0x41000000" size="0x00020000" type="io" rw="RW"/>
          <memory-segment name="PBC_BRIDGE" start="0x42000000" size="0x00012000" type="io" rw="RW"/>
          <memory-segment name="CRYPTO_SFR" start="0x43000000" size="0x20000" type="io" rw="RW"/>
          <memory-segment name="PBPIC_BRIDGE" start="0x44000000" size="0x00014000" type="io" rw="RW"/>
          <memory-segment name="MCROM_ROM" start="0x45000000" size="0x2000" type="rom" rw="R" exec="true"/>
          <memory-segment name="PBD_BRIDGE" start="0x46000000" size="0x00002800" type="io" rw="RW"/>
          <memory-segment name="SYSTEM_CM4F_SYSTEM_REGISTERS" start="0xE0000000" size="0x1fff4000" type="io" rw="RW"/>
        </address-space>
        <address-space id="fuses" name="fuses" start="0x0" size="0x200" endianness="little">
          <memory-segment name="EFUSE" start="0" size="0x200" type="fuses" rw="RW"/>
        </address-space>
      </address-spaces>
      <parameters>
        <param name="LITTLE_ENDIAN" value="1" caption="None"/>
        <!-- BBUCK_NPD-751 -->
        <param name="NUM_IRQ" value="58" caption="None"/>
        <param name="__ARCH_ARM" value="1" caption="None"/>
        <param name="__CM4_REV" value="0x0001" caption="None"/>
        <param name="__DEBUG_LVL" value="3" caption="None"/>
        <param name="__FPU_PRESENT" value="1" caption="None"/>
        <param name="__FRC_DEF_FREQ" value="8000000" caption="FRC Default Frequency"/>
        <param name="__MPU_PRESENT" value="1" caption="None"/>
        <param name="__NUM_DMA_CHANNELS" value="16" caption="Number of DMA Channels"/>
        <param name="__NVIC_PRIO_BITS" value="3" caption="None"/>
        <param name="__PB1_DEF_FREQ" value="128000000" caption="Peripheral Bus 1 Default Clock Frequency"/>
        <param name="__PB2_DEF_FREQ" value="128000000" caption="Peripheral Bus 2 Default Clock Frequency"/>
        <param name="__PB3_DEF_FREQ" value="128000000" caption="Peripheral Bus 3 Default Clock Frequency"/>
        <param name="__POSC_DEF_FREQ" value="16000000" caption="Primary Oscillator Input Default Frequency"/>
        <param name="__REFCLK1_DEF_FREQ" value="128000000" caption="Reference Clock 1 Default Frequency"/>
        <param name="__REFCLK2_DEF_FREQ" value="128000000" caption="Reference Clock 2 Default Frequency"/>
        <param name="__REFCLK3_DEF_FREQ" value="128000000" caption="Reference Clock 3 Default Frequency"/>
        <param name="__REFCLK4_DEF_FREQ" value="128000000" caption="Reference Clock 4 Default Frequency"/>
        <param name="__REFCLK5_DEF_FREQ" value="128000000" caption="Reference Clock 5 Default Frequency"/>
        <param name="__REFCLK6_DEF_FREQ" value="128000000" caption="Reference Clock 6 Default Frequency"/>
        <param name="__REFCLKI_DEF_FREQ" value="8000000" caption="REFCLKI Pin Input Default Frequency"/>
        <param name="__RFPLL_DEF_FREQ" value="128000000" caption="RFPLL Default Frequency"/>
        <param name="__EPLL_DEF_FREQ" value="50000000" caption="EPLL Default Frequency"/>
        <param name="__UPLL_DEF_FREQ" value="96000000" caption="UPLL Default Frequency"/>
        <param name="__SOSC_DEF_FREQ" value="32768" caption="Secondary Oscillator Input Default Frequency"/>
        <param name="__SYS_DEF_FREQ" value="128000000" caption="System Clock Default Frequency"/>
        <param name="__TRACE_LVL" value="2" caption="None"/>
        <param name="__VENDOR_SYSTICKCONFIG" value="0" caption="None"/>
        <param name="__VTOR_PRESENT" value="1" caption="None"/>
        <param name="POWER_DOMAIN" value="PD_CORE"/>
        <param name="__ARCH_ARM_CORTEX_M" value="1"/>
        <param name="__BOOT_ROM_HDR_SIZE" value="512" caption="Secure Boot Header"/>
      </parameters>
      <peripherals>
        <module name="AC" id="04704" name2="cmp_ac_u2501_v3" version="A">
          <instance name="AC">
            <register-group name="AC" name-in-module="AC" address-space="base" offset="0x42001C00"/>
            <signals>
              <signal group="AIN" index="0" function="COMPARATOR__ANALOG" pad="PB2"/>
              <signal group="AIN" index="1" function="COMPARATOR__ANALOG" pad="PB3"/>
              <signal group="AIN" index="2" function="COMPARATOR__ANALOG" pad="PB0"/>
              <signal group="AIN" index="3" function="COMPARATOR__ANALOG" pad="PB1"/>
              <signal group="CMPTEN" function="1" pad="PA00" ioset="1"/>
              <signal group="CMPTEN" function="2" pad="PA06" ioset="1"/>
              <signal group="CMPTEN" function="3" pad="PA11" ioset="1"/>
              <signal group="CMPTEN" function="4" pad="PB00" ioset="1"/>
              <signal group="CMPTEN" function="5" pad="PB06" ioset="1"/>
              <signal group="CMPTEN" function="6" pad="PB11" ioset="1"/>
              <signal group="CMPTEN" function="8" pad="PD06" ioset="1"/>
              <signal group="CMPTEN" function="10" pad="PE06" ioset="1"/>
              <signal group="CMPTEN" function="11" pad="PB01" ioset="1"/>
              <signal group="CMPTEN" function="13" pad="PD03" ioset="1"/>
              <signal group="CMPTEN" function="15" pad="PA03" ioset="1"/>
              <signal group="CMPTEN" function="16" pad="PA07" ioset="1"/>
              <signal group="CMPTEN" function="17" pad="PB04" ioset="1"/>
              <signal group="CMPTEN" function="18" pad="PB08" ioset="1"/>
              <signal group="CMPTEN" function="19" pad="PB12" ioset="1"/>
              <signal group="CMPTEN" function="20" pad="PA02" ioset="1"/>
              <signal group="CMPTEN" function="21" pad="PA10" ioset="1"/>
              <signal group="CMPTEN" function="22" pad="PA14" ioset="1"/>
              <signal group="CMPTEN" function="23" pad="PB03" ioset="1"/>
              <signal group="CMPTEN" function="24" pad="PB07" ioset="1"/>
              <signal group="CMPTEN" function="25" pad="PA09" ioset="1"/>
              <signal group="CMP" index="0" function="40" pad="PA00" ioset="3"/>
              <signal group="CMP" index="0" function="40" pad="PA01" ioset="3"/>
              <signal group="CMP" index="0" function="40" pad="PA02" ioset="3"/>
              <signal group="CMP" index="0" function="40" pad="PA04" ioset="3"/>
              <signal group="CMP" index="0" function="40" pad="PA05" ioset="3"/>
              <signal group="CMP" index="0" function="40" pad="PA08" ioset="3"/>
              <signal group="CMP" index="0" function="40" pad="PA09" ioset="3"/>
              <signal group="CMP" index="0" function="40" pad="PA13" ioset="3"/>
              <signal group="CMP" index="0" function="40" pad="PB01" ioset="3"/>
              <signal group="CMP" index="0" function="40" pad="PB02" ioset="3"/>
              <signal group="CMP" index="0" function="40" pad="PB03" ioset="3"/>
              <signal group="CMP" index="0" function="40" pad="PB05" ioset="3"/>
              <signal group="CMP" index="0" function="40" pad="PB06" ioset="3"/>
              <signal group="CMP" index="0" function="40" pad="PB08" ioset="3"/>
              <signal group="CMP" index="0" function="40" pad="PB09" ioset="3"/>
              <signal group="CMP" index="0" function="40" pad="PB10" ioset="3"/>
              <signal group="CMP" index="0" function="40" pad="PB13" ioset="3"/>
              <signal group="CMP" index="0" function="40" pad="PC08" ioset="3"/>
              <signal group="CMP" index="0" function="40" pad="PD06" ioset="3"/>
              <signal group="CMP" index="0" function="40" pad="PE02" ioset="3"/>
              <signal group="CMP" index="1" function="36" pad="PA00" ioset="4"/>
              <signal group="CMP" index="1" function="36" pad="PA01" ioset="4"/>
              <signal group="CMP" index="1" function="36" pad="PA02" ioset="4"/>
              <signal group="CMP" index="1" function="36" pad="PA03" ioset="4"/>
              <signal group="CMP" index="1" function="36" pad="PA05" ioset="4"/>
              <signal group="CMP" index="1" function="36" pad="PA06" ioset="4"/>
              <signal group="CMP" index="1" function="36" pad="PA08" ioset="4"/>
              <signal group="CMP" index="1" function="36" pad="PA09" ioset="4"/>
              <signal group="CMP" index="1" function="36" pad="PA10" ioset="4"/>
              <signal group="CMP" index="1" function="36" pad="PA13" ioset="4"/>
              <signal group="CMP" index="1" function="36" pad="PA14" ioset="4"/>
              <signal group="CMP" index="1" function="36" pad="PB02" ioset="4"/>
              <signal group="CMP" index="1" function="36" pad="PB03" ioset="4"/>
              <signal group="CMP" index="1" function="36" pad="PB04" ioset="4"/>
              <signal group="CMP" index="1" function="36" pad="PB06" ioset="4"/>
              <signal group="CMP" index="1" function="36" pad="PB07" ioset="4"/>
              <signal group="CMP" index="1" function="36" pad="PB10" ioset="4"/>
              <signal group="CMP" index="1" function="36" pad="PB11" ioset="4"/>
              <signal group="CMP" index="1" function="36" pad="PC09" ioset="4"/>
              <signal group="CMP" index="1" function="36" pad="PD07" ioset="4"/>
              <signal group="CMP" index="1" function="36" pad="PE03" ioset="4"/>
              <signal group="CMPTRDY" function="41" pad="PA00" ioset="3"/>
              <signal group="CMPTRDY" function="41" pad="PA01" ioset="3"/>
              <signal group="CMPTRDY" function="41" pad="PA02" ioset="3"/>
              <signal group="CMPTRDY" function="41" pad="PA04" ioset="3"/>
              <signal group="CMPTRDY" function="41" pad="PA05" ioset="3"/>
              <signal group="CMPTRDY" function="41" pad="PA08" ioset="3"/>
              <signal group="CMPTRDY" function="41" pad="PA09" ioset="3"/>
              <signal group="CMPTRDY" function="41" pad="PA13" ioset="3"/>
              <signal group="CMPTRDY" function="41" pad="PB01" ioset="3"/>
              <signal group="CMPTRDY" function="41" pad="PB02" ioset="3"/>
              <signal group="CMPTRDY" function="41" pad="PB03" ioset="3"/>
              <signal group="CMPTRDY" function="41" pad="PB05" ioset="3"/>
              <signal group="CMPTRDY" function="41" pad="PB06" ioset="3"/>
              <signal group="CMPTRDY" function="41" pad="PB08" ioset="3"/>
              <signal group="CMPTRDY" function="41" pad="PB09" ioset="3"/>
              <signal group="CMPTRDY" function="41" pad="PB10" ioset="3"/>
              <signal group="CMPTRDY" function="41" pad="PB13" ioset="3"/>
              <signal group="CMPTRDY" function="41" pad="PC08" ioset="3"/>
              <signal group="CMPTRDY" function="41" pad="PD06" ioset="3"/>
              <signal group="CMPTRDY" function="41" pad="PE02" ioset="3"/>
              <signal group="CMPTOUT" function="37" pad="PA00" ioset="4"/>
              <signal group="CMPTOUT" function="37" pad="PA01" ioset="4"/>
              <signal group="CMPTOUT" function="37" pad="PA02" ioset="4"/>
              <signal group="CMPTOUT" function="37" pad="PA03" ioset="4"/>
              <signal group="CMPTOUT" function="37" pad="PA05" ioset="4"/>
              <signal group="CMPTOUT" function="37" pad="PA06" ioset="4"/>
              <signal group="CMPTOUT" function="37" pad="PA08" ioset="4"/>
              <signal group="CMPTOUT" function="37" pad="PA09" ioset="4"/>
              <signal group="CMPTOUT" function="37" pad="PA10" ioset="4"/>
              <signal group="CMPTOUT" function="37" pad="PA13" ioset="4"/>
              <signal group="CMPTOUT" function="37" pad="PA14" ioset="4"/>
              <signal group="CMPTOUT" function="37" pad="PB02" ioset="4"/>
              <signal group="CMPTOUT" function="37" pad="PB03" ioset="4"/>
              <signal group="CMPTOUT" function="37" pad="PB04" ioset="4"/>
              <signal group="CMPTOUT" function="37" pad="PB06" ioset="4"/>
              <signal group="CMPTOUT" function="37" pad="PB07" ioset="4"/>
              <signal group="CMPTOUT" function="37" pad="PB10" ioset="4"/>
              <signal group="CMPTOUT" function="37" pad="PB11" ioset="4"/>
              <signal group="CMPTOUT" function="37" pad="PC09" ioset="4"/>
              <signal group="CMPTOUT" function="37" pad="PD07" ioset="4"/>
              <signal group="CMPTOUT" function="37" pad="PE03" ioset="4"/>
            </signals>
            <parameters>
              <param name="GCLK_ID" value="26"/>
              <param name="CHIP_AC_PADDR_MSB" value="9"/>
              <param name="CHIP_AC_IMPLEMENTS_VDBLR" value="0"/>
              <param name="CHIP_AC_PAIRS" value="1"/>
              <param name="CHIP_AC_NUM_CMP" value="2"/>
              <param name="CHIP_AC_FUSES_DATA_MSB" value="127"/>
              <param name="CHIP_AC_FUSES_RDY_MSB" value="3"/>
              <param name="CHIP_AC_FUSES_BIAS0_ROWID" value="4"/>
              <param name="CHIP_AC_FUSES_BIAS0_START" value="0"/>
              <param name="CHIP_AC_FUSES_BIAS0_SIZE" value="2"/>
              <param name="INSTANCE_ID" value="71" caption="Instance index for AC"/>
              <param name="PAC_ID" value="71" caption="Index for AC registers write protection"/>
              <param name="LOAD_CALIB" value="0"/>
            </parameters>
          </instance>
        </module>
        <module name="ADCHS" id="02508" name2="adc_sar_ctrl_upb_v1" version="A">
          <instance name="ADCHS">
            <register-group name="ADCHS" name-in-module="ADCHS" address-space="base" offset="0x44001500"/>
            <signals>
              <signal group="ADCSVCLKI" function="SILICON_VALIDATION__DFT_" pad="PA7"/>
              <signal group="ADCSVFRM" function="SILICON_VALIDATION__DFT_" pad="PA9"/>
              <signal group="ADCSVSARCLK" function="SILICON_VALIDATION__DFT_" pad="PA10"/>
              <signal group="ADCSVSOUT" function="SILICON_VALIDATION__DFT_" pad="PB9"/>
              <signal group="ADCSVTRG" function="SILICON_VALIDATION__DFT_" pad="PA8"/>
              <signal group="AIN" index="0" function="ADC" pad="PB10"/>
              <signal group="AIN" index="1" function="ADC" pad="PB5"/>
              <signal group="AIN" index="2" function="ADC" pad="PB6"/>
              <signal group="AIN" index="3" function="ADC" pad="PB7"/>
              <signal group="AIN" index="4" function="ADC" pad="PB0"/>
              <signal group="AIN" index="5" function="ADC" pad="PB1"/>
              <signal group="AIN" index="6" function="ADC" pad="PB2"/>
              <signal group="AIN" index="7" function="ADC" pad="PB3"/>
              <signal group="AIN" index="8" function="ADC" pad="PB4"/>
              <signal group="AIN" index="9" function="ADC" pad="PD3"/>
              <signal group="AIN" index="10" function="ADC" pad="PD4"/>
              <signal group="AIN" index="11" function="ADC" pad="PD5"/>
              <signal group="AIN" index="12" function="ADC" pad="PD6"/>
              <signal group="AIN" index="13" function="ADC" pad="PD7"/>
              <signal group="AIN" index="14" function="ADC" pad="PE6"/>
              <signal group="AIN" index="15" function="ADC" pad="PC7"/>
              <signal group="AIN" index="16" function="ADC" pad="PD2"/>
              <signal group="AIN" index="18" function="ADC" pad="PB14"/>
              <signal group="ANA" index="0" function="ADC__ALTERNATE_" pad="PB11"/>
              <signal group="ANB" index="0" function="ADC__ALTERNATE_" pad="PE5"/>
              <signal group="ANN" index="0" function="ADC__DIFFERENTIAL_" pad="PA14"/>
              <signal group="ANN" index="1" function="ADC__DIFFERENTIAL_" pad="PA3"/>
              <signal group="CVD" index="1" function="ADC" pad="PB5"/>
              <signal group="CVD" index="2" function="ADC" pad="PB6"/>
              <signal group="CVD" index="3" function="ADC" pad="PB7"/>
              <signal group="CVD" index="4" function="ADC" pad="PB0"/>
              <signal group="CVD" index="5" function="ADC" pad="PB1"/>
              <signal group="CVD" index="6" function="ADC" pad="PB2"/>
              <signal group="CVD" index="7" function="ADC" pad="PB3"/>
              <signal group="CVD" index="8" function="ADC" pad="PB4"/>
              <signal group="CVD" index="9" function="ADC" pad="PD3"/>
              <signal group="CVD" index="10" function="ADC" pad="PD4"/>
              <signal group="CVD" index="11" function="ADC" pad="PD5"/>
              <signal group="CVD" index="12" function="ADC" pad="PD6"/>
              <signal group="CVD" index="13" function="ADC" pad="PD7"/>
              <signal group="CVD" index="14" function="ADC" pad="PE6"/>
              <signal group="CVD" index="15" function="ADC" pad="PC7"/>
              <signal group="CVD" index="16" function="ADC" pad="PD2"/>
              <signal group="CVD" index="18" function="ADC" pad="PB14"/>
            </signals>
            <parameters>
              <param name="NUM_INTS" value="2"/>
              <param name="SET_CLR_INV_PRESENT" value="1" caption="Present"/>
              <param name="ADC_EXTERN_ANALOG_IP" value="0" caption="ADC SAR Core is Microchip"/>
              <param name="ADC_USE_SYNP_MUX" value="0" caption="ADC SAR Core is Microchip"/>
              <param name="ADC_VREF_STARTUP_TIME" value="50" caption="Time in ADC clock cycles to stabilize"/>
              <param name="ADC_CORE_CALIBRATE_TIME" value="81" caption="Time in ADC clock cycles to perform a calibrate"/>
              <param name="ADC_CORES_NMBR" value="2" caption="Total Number of SAR ADC Analog Cores"/>
              <param name="ADC_FCC_NMBR" value="1" caption="Number of First Class Analog Input Channels"/>
              <param name="ADC_ITRIG_NMBR" value="8" caption="Number of analog inputs"/>
              <param name="ADC_INPUTS_NMBR" value="13" caption="Number of analog inputs"/>
              <param name="ADC_UPB_FIFO_PRESENT" value="0" caption="UPB FIFO is not present"/>
              <param name="ADC_UPB_FIFO_DEPTH" value="0" caption="Number of words in UPB FIFO"/>
              <param name="ADC_BVCI_PORT_PRESENT" value="1" caption="BVCI port is implemented."/>
              <param name="ADC_BVCI_FIFO_DEPTH" value="16" caption="Number of words in DMA BVCI FIFO"/>
              <param name="ADC_BVCI_ADDR_WIDTH" value="15" caption="Width in bits for the BVCI address offset."/>
              <param name="ADC_DCMP_NMBR" value="2" caption="Number of digital comparators to be implemented."/>
              <param name="ADC_FLTR_NMBR" value="2" caption="Number of digital oversampling filters to implement."/>
              <param name="ADC_INTR_NMBR" value="114" caption="Number of Interrupt Source Signals"/>
              <param name="ADC_EARLY_INTR_PRESENT" value="0" caption="No early interrupts"/>
              <param name="ADC_32BIT_REG_ADDR" value="1" caption="Specifies 32-bit data register addressing."/>
              <param name="ADC_32BIT_OUTPUT_DATA" value="1" caption="If set to 1, the output data is 32-bit wide"/>
              <param name="ADC_CVD_PRESENT" value="1" caption="CVD is present"/>
              <param name="AIN_19" value="19" caption="BandGap Reference"/>
              <param name="AIN_20" value="20" caption="ADC Charge Pump"/>
              <param name="AIN_21" value="21" caption="VDD Core"/>
              <param name="AIN_22" value="22" caption="VDD"/>
            </parameters>
          </instance>
        </module>
