zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
        <module name="ARB" id="04269" name2="zbt_rad_arb_v1" version="A">
          <instance name="ARB">
            <register-group name="ARB" name-in-module="ARB" address-space="base" offset="0x41011000"/>
          </instance>
        </module>
        <module name="BLE" id="04999" name2="bt_bb_dm_v6" version="A">
          <instance name="BLE">
            <register-group name="BLE" name-in-module="BLE" address-space="base" offset="0x41012000"/>
          </instance>
        </module>
        <module name="BTZBSYS" id="04997" name2="bt_zb_subsys_v2" version="A">
          <instance name="BTZBSYS">
            <register-group name="BTZBSYS" name-in-module="BTZBSYS" address-space="base" offset="0x41014000"/>
            <signals>
              <signal group="TA4D_ALT" function="TEST_MODES" pad="PA6"/>
              <signal group="RTC_IN0_ALT" function="RTCC" pad="PA9"/>
              <signal group="MBISTCLK" function="TEST_MODES" pad="PA10"/>
              <signal group="RTC_OUT_ALT" function="RTCC" pad="PA10"/>
              <signal group="CLDO_IN" function="RF__ANALOG" pad="CLDO_IN2"/>
              <signal group="CLDO_IN" function="RF__ANALOG" pad="CLDO_IN_CLKGEN"/>
              <signal group="CLDO_OUT" function="RF__ANALOG" pad="CLDO_OUT_2"/>
              <signal group="CLDO_OUT" function="RF__ANALOG" pad="CLDO_OUT_1"/>
              <signal group="EXTRA_30K" function="RF__ANALOG" pad="EXTR_30K"/>
              <signal group="RF_IO" function="RF__ANALOG" pad="RFINOUT_2"/>
              <signal group="RF_IO" function="RF__ANALOG" pad="RFINOUT_1"/>
              <signal group="VDD_RF" function="RF__ANALOG" pad="RFLDO_IN"/>
              <signal group="RFLDO_OUT" function="POWER_SUPPLY" pad="RFLDO_OUT"/>
              <signal group="VDD_RF" function="RF__ANALOG" pad="VDD_PLL_LF"/>
              <signal group="VDD_RF" function="RF__ANALOG" pad="VDD_PLL_HF"/>
              <signal group="xo_n" function="RF__ANALOG" pad="XO_N"/>
              <signal group="xo_p" function="RF__ANALOG" pad="XO_P"/>
              <signal group="TP" index="2" function="RF__ANALOG" pad="PB8"/>
              <signal group="TP" index="3" function="RF__ANALOG" pad="PB9"/>
              <signal group="TP" index="4" function="RF__ANALOG" pad="PB4"/>
              <signal group="TP" index="5" function="RF__ANALOG" pad="PB5"/>
              <signal group="TP" index="6" function="RF__ANALOG" pad="PB8"/>
              <signal group="FEM_PD_EXT_PA" function="RF__ANALOG" pad="PB9"/>
              <signal group="FECTRL" index="0" function="40" pad="PA00" ioset="2"/>
              <signal group="FECTRL" index="0" function="40" pad="PA01" ioset="2"/>
              <signal group="FECTRL" index="0" function="40" pad="PA03" ioset="2"/>
              <signal group="FECTRL" index="0" function="40" pad="PA04" ioset="2"/>
              <signal group="FECTRL" index="0" function="40" pad="PA07" ioset="2"/>
              <signal group="FECTRL" index="0" function="40" pad="PA08" ioset="2"/>
              <signal group="FECTRL" index="0" function="40" pad="PA11" ioset="2"/>
              <signal group="FECTRL" index="0" function="40" pad="PA12" ioset="2"/>
              <signal group="FECTRL" index="0" function="40" pad="PB00" ioset="2"/>
              <signal group="FECTRL" index="0" function="40" pad="PB01" ioset="2"/>
              <signal group="FECTRL" index="0" function="40" pad="PB02" ioset="2"/>
              <signal group="FECTRL" index="0" function="40" pad="PB04" ioset="2"/>
              <signal group="FECTRL" index="0" function="40" pad="PB05" ioset="2"/>
              <signal group="FECTRL" index="0" function="40" pad="PB07" ioset="2"/>
              <signal group="FECTRL" index="0" function="40" pad="PB08" ioset="2"/>
              <signal group="FECTRL" index="0" function="40" pad="PB09" ioset="2"/>
              <signal group="FECTRL" index="0" function="40" pad="PB12" ioset="2"/>
              <signal group="FECTRL" index="0" function="40" pad="PB13" ioset="2"/>
              <signal group="FECTRL" index="0" function="40" pad="PC01" ioset="2"/>
              <signal group="FECTRL" index="0" function="40" pad="PD04" ioset="2"/>
              <signal group="FECTRL" index="0" function="40" pad="PE01" ioset="2"/>
              <signal group="FECTRL" index="1" function="35" pad="PA00" ioset="1"/>
              <signal group="FECTRL" index="1" function="35" pad="PA02" ioset="1"/>
              <signal group="FECTRL" index="1" function="35" pad="PA03" ioset="1"/>
              <signal group="FECTRL" index="1" function="35" pad="PA06" ioset="1"/>
              <signal group="FECTRL" index="1" function="35" pad="PA07" ioset="1"/>
              <signal group="FECTRL" index="1" function="35" pad="PA09" ioset="1"/>
              <signal group="FECTRL" index="1" function="35" pad="PA10" ioset="1"/>
              <signal group="FECTRL" index="1" function="35" pad="PA11" ioset="1"/>
              <signal group="FECTRL" index="1" function="35" pad="PA14" ioset="1"/>
              <signal group="FECTRL" index="1" function="35" pad="PB00" ioset="1"/>
              <signal group="FECTRL" index="1" function="35" pad="PB01" ioset="1"/>
              <signal group="FECTRL" index="1" function="35" pad="PB03" ioset="1"/>
              <signal group="FECTRL" index="1" function="35" pad="PB04" ioset="1"/>
              <signal group="FECTRL" index="1" function="35" pad="PB06" ioset="1"/>
              <signal group="FECTRL" index="1" function="35" pad="PB07" ioset="1"/>
              <signal group="FECTRL" index="1" function="35" pad="PB08" ioset="1"/>
              <signal group="FECTRL" index="1" function="35" pad="PB11" ioset="1"/>
              <signal group="FECTRL" index="1" function="35" pad="PB12" ioset="1"/>
              <signal group="FECTRL" index="1" function="35" pad="PC09" ioset="1"/>
              <signal group="FECTRL" index="1" function="35" pad="PD06" ioset="1"/>
              <signal group="FECTRL" index="1" function="35" pad="PE04" ioset="1"/>
              <signal group="FECTRL" index="2" function="36" pad="PA00" ioset="1"/>
              <signal group="FECTRL" index="2" function="36" pad="PA02" ioset="1"/>
              <signal group="FECTRL" index="2" function="36" pad="PA03" ioset="1"/>
              <signal group="FECTRL" index="2" function="36" pad="PA06" ioset="1"/>
              <signal group="FECTRL" index="2" function="36" pad="PA07" ioset="1"/>
              <signal group="FECTRL" index="2" function="36" pad="PA09" ioset="1"/>
              <signal group="FECTRL" index="2" function="36" pad="PA10" ioset="1"/>
              <signal group="FECTRL" index="2" function="36" pad="PA11" ioset="1"/>
              <signal group="FECTRL" index="2" function="36" pad="PA14" ioset="1"/>
              <signal group="FECTRL" index="2" function="36" pad="PB00" ioset="1"/>
              <signal group="FECTRL" index="2" function="36" pad="PB01" ioset="1"/>
              <signal group="FECTRL" index="2" function="36" pad="PB03" ioset="1"/>
              <signal group="FECTRL" index="2" function="36" pad="PB04" ioset="1"/>
              <signal group="FECTRL" index="2" function="36" pad="PB06" ioset="1"/>
              <signal group="FECTRL" index="2" function="36" pad="PB07" ioset="1"/>
              <signal group="FECTRL" index="2" function="36" pad="PB08" ioset="1"/>
              <signal group="FECTRL" index="2" function="36" pad="PB11" ioset="1"/>
              <signal group="FECTRL" index="2" function="36" pad="PB12" ioset="1"/>
              <signal group="FECTRL" index="2" function="36" pad="PC09" ioset="1"/>
              <signal group="FECTRL" index="2" function="36" pad="PD06" ioset="1"/>
              <signal group="FECTRL" index="2" function="36" pad="PE04" ioset="1"/>
              <signal group="FECTRL" index="3" function="39" pad="PA00" ioset="4"/>
              <signal group="FECTRL" index="3" function="39" pad="PA01" ioset="4"/>
              <signal group="FECTRL" index="3" function="39" pad="PA02" ioset="4"/>
              <signal group="FECTRL" index="3" function="39" pad="PA03" ioset="4"/>
              <signal group="FECTRL" index="3" function="39" pad="PA05" ioset="4"/>
              <signal group="FECTRL" index="3" function="39" pad="PA06" ioset="4"/>
              <signal group="FECTRL" index="3" function="39" pad="PA08" ioset="4"/>
              <signal group="FECTRL" index="3" function="39" pad="PA09" ioset="4"/>
              <signal group="FECTRL" index="3" function="39" pad="PA10" ioset="4"/>
              <signal group="FECTRL" index="3" function="39" pad="PA13" ioset="4"/>
              <signal group="FECTRL" index="3" function="39" pad="PA14" ioset="4"/>
              <signal group="FECTRL" index="3" function="39" pad="PB02" ioset="4"/>
              <signal group="FECTRL" index="3" function="39" pad="PB03" ioset="4"/>
              <signal group="FECTRL" index="3" function="39" pad="PB04" ioset="4"/>
              <signal group="FECTRL" index="3" function="39" pad="PB06" ioset="4"/>
              <signal group="FECTRL" index="3" function="39" pad="PB07" ioset="4"/>
              <signal group="FECTRL" index="3" function="39" pad="PB10" ioset="4"/>
              <signal group="FECTRL" index="3" function="39" pad="PB11" ioset="4"/>
              <signal group="FECTRL" index="3" function="39" pad="PC09" ioset="4"/>
              <signal group="FECTRL" index="3" function="39" pad="PD07" ioset="4"/>
              <signal group="FECTRL" index="3" function="39" pad="PE03" ioset="4"/>
              <signal group="FECTRL" index="4" function="42" pad="PA00" ioset="3"/>
              <signal group="FECTRL" index="4" function="42" pad="PA01" ioset="3"/>
              <signal group="FECTRL" index="4" function="42" pad="PA02" ioset="3"/>
              <signal group="FECTRL" index="4" function="42" pad="PA04" ioset="3"/>
              <signal group="FECTRL" index="4" function="42" pad="PA05" ioset="3"/>
              <signal group="FECTRL" index="4" function="42" pad="PA08" ioset="3"/>
              <signal group="FECTRL" index="4" function="42" pad="PA09" ioset="3"/>
              <signal group="FECTRL" index="4" function="42" pad="PA12" ioset="3"/>
              <signal group="FECTRL" index="4" function="42" pad="PA13" ioset="3"/>
              <signal group="FECTRL" index="4" function="42" pad="PB01" ioset="3"/>
              <signal group="FECTRL" index="4" function="42" pad="PB02" ioset="3"/>
              <signal group="FECTRL" index="4" function="42" pad="PB03" ioset="3"/>
              <signal group="FECTRL" index="4" function="42" pad="PB05" ioset="3"/>
              <signal group="FECTRL" index="4" function="42" pad="PB06" ioset="3"/>
              <signal group="FECTRL" index="4" function="42" pad="PB08" ioset="3"/>
              <signal group="FECTRL" index="4" function="42" pad="PB09" ioset="3"/>
              <signal group="FECTRL" index="4" function="42" pad="PB10" ioset="3"/>
              <signal group="FECTRL" index="4" function="42" pad="PB13" ioset="3"/>
              <signal group="FECTRL" index="4" function="42" pad="PC08" ioset="3"/>
              <signal group="FECTRL" index="4" function="42" pad="PD06" ioset="3"/>
              <signal group="FECTRL" index="4" function="42" pad="PE02" ioset="3"/>
              <signal group="FECTRL" index="5" function="40" pad="PA00" ioset="4"/>
              <signal group="FECTRL" index="5" function="40" pad="PA01" ioset="4"/>
              <signal group="FECTRL" index="5" function="40" pad="PA02" ioset="4"/>
              <signal group="FECTRL" index="5" function="40" pad="PA03" ioset="4"/>
              <signal group="FECTRL" index="5" function="40" pad="PA05" ioset="4"/>
              <signal group="FECTRL" index="5" function="40" pad="PA06" ioset="4"/>
              <signal group="FECTRL" index="5" function="40" pad="PA08" ioset="4"/>
              <signal group="FECTRL" index="5" function="40" pad="PA09" ioset="4"/>
              <signal group="FECTRL" index="5" function="40" pad="PA10" ioset="4"/>
              <signal group="FECTRL" index="5" function="40" pad="PA13" ioset="4"/>
              <signal group="FECTRL" index="5" function="40" pad="PA14" ioset="4"/>
              <signal group="FECTRL" index="5" function="40" pad="PB02" ioset="4"/>
              <signal group="FECTRL" index="5" function="40" pad="PB03" ioset="4"/>
              <signal group="FECTRL" index="5" function="40" pad="PB04" ioset="4"/>
              <signal group="FECTRL" index="5" function="40" pad="PB06" ioset="4"/>
              <signal group="FECTRL" index="5" function="40" pad="PB07" ioset="4"/>
              <signal group="FECTRL" index="5" function="40" pad="PB10" ioset="4"/>
              <signal group="FECTRL" index="5" function="40" pad="PB11" ioset="4"/>
              <signal group="FECTRL" index="5" function="40" pad="PC09" ioset="4"/>
              <signal group="FECTRL" index="5" function="40" pad="PD07" ioset="4"/>
              <signal group="FECTRL" index="5" function="40" pad="PE03" ioset="4"/>
              <signal group="COEX_RF_ACT" function="41" pad="PA00" ioset="2"/>
              <signal group="COEX_RF_ACT" function="41" pad="PA01" ioset="2"/>
              <signal group="COEX_RF_ACT" function="41" pad="PA03" ioset="2"/>
              <signal group="COEX_RF_ACT" function="41" pad="PA04" ioset="2"/>
              <signal group="COEX_RF_ACT" function="41" pad="PA07" ioset="2"/>
              <signal group="COEX_RF_ACT" function="41" pad="PA08" ioset="2"/>
              <signal group="COEX_RF_ACT" function="41" pad="PA11" ioset="2"/>
              <signal group="COEX_RF_ACT" function="41" pad="PA12" ioset="2"/>
              <signal group="COEX_RF_ACT" function="41" pad="PB00" ioset="2"/>
              <signal group="COEX_RF_ACT" function="41" pad="PB01" ioset="2"/>
              <signal group="COEX_RF_ACT" function="41" pad="PB02" ioset="2"/>
              <signal group="COEX_RF_ACT" function="41" pad="PB04" ioset="2"/>
              <signal group="COEX_RF_ACT" function="41" pad="PB05" ioset="2"/>
              <signal group="COEX_RF_ACT" function="41" pad="PB07" ioset="2"/>
              <signal group="COEX_RF_ACT" function="41" pad="PB08" ioset="2"/>
              <signal group="COEX_RF_ACT" function="41" pad="PB09" ioset="2"/>
              <signal group="COEX_RF_ACT" function="41" pad="PB12" ioset="2"/>
              <signal group="COEX_RF_ACT" function="41" pad="PB13" ioset="2"/>
              <signal group="COEX_RF_ACT" function="41" pad="PC01" ioset="2"/>
              <signal group="COEX_RF_ACT" function="41" pad="PD04" ioset="2"/>
              <signal group="COEX_RF_ACT" function="41" pad="PE01" ioset="2"/>
              <signal group="COEX_BT_STATE" function="37" pad="PA00" ioset="1"/>
              <signal group="COEX_BT_STATE" function="37" pad="PA02" ioset="1"/>
              <signal group="COEX_BT_STATE" function="37" pad="PA03" ioset="1"/>
              <signal group="COEX_BT_STATE" function="37" pad="PA06" ioset="1"/>
              <signal group="COEX_BT_STATE" function="37" pad="PA07" ioset="1"/>
              <signal group="COEX_BT_STATE" function="37" pad="PA09" ioset="1"/>
              <signal group="COEX_BT_STATE" function="37" pad="PA10" ioset="1"/>
              <signal group="COEX_BT_STATE" function="37" pad="PA11" ioset="1"/>
              <signal group="COEX_BT_STATE" function="37" pad="PA14" ioset="1"/>
              <signal group="COEX_BT_STATE" function="37" pad="PB00" ioset="1"/>
              <signal group="COEX_BT_STATE" function="37" pad="PB01" ioset="1"/>
              <signal group="COEX_BT_STATE" function="37" pad="PB03" ioset="1"/>
              <signal group="COEX_BT_STATE" function="37" pad="PB04" ioset="1"/>
              <signal group="COEX_BT_STATE" function="37" pad="PB06" ioset="1"/>
              <signal group="COEX_BT_STATE" function="37" pad="PB07" ioset="1"/>
              <signal group="COEX_BT_STATE" function="37" pad="PB08" ioset="1"/>
              <signal group="COEX_BT_STATE" function="37" pad="PB11" ioset="1"/>
              <signal group="COEX_BT_STATE" function="37" pad="PB12" ioset="1"/>
              <signal group="COEX_BT_STATE" function="37" pad="PC09" ioset="1"/>
              <signal group="COEX_BT_STATE" function="37" pad="PD06" ioset="1"/>
              <signal group="COEX_BT_STATE" function="37" pad="PE04" ioset="1"/>
              <signal group="COEX_WLAN_ACT" function="1" pad="PA03" ioset="4"/>
              <signal group="COEX_WLAN_ACT" function="2" pad="PA09" ioset="4"/>
              <signal group="COEX_WLAN_ACT" function="3" pad="PA14" ioset="4"/>
              <signal group="COEX_WLAN_ACT" function="4" pad="PB03" ioset="4"/>
              <signal group="COEX_WLAN_ACT" function="6" pad="PD03" ioset="4"/>
              <signal group="COEX_WLAN_ACT" function="8" pad="PA00" ioset="4"/>
              <signal group="COEX_WLAN_ACT" function="9" pad="PB04" ioset="4"/>
              <signal group="COEX_WLAN_ACT" function="11" pad="PD07" ioset="4"/>
              <signal group="COEX_WLAN_ACT" function="13" pad="PA06" ioset="4"/>
              <signal group="COEX_WLAN_ACT" function="14" pad="PA10" ioset="4"/>
              <signal group="COEX_WLAN_ACT" function="15" pad="PB07" ioset="4"/>
              <signal group="COEX_WLAN_ACT" function="16" pad="PB11" ioset="4"/>
              <signal group="COEX_WLAN_ACT" function="17" pad="PA01" ioset="4"/>
              <signal group="COEX_WLAN_ACT" function="18" pad="PA05" ioset="4"/>
              <signal group="COEX_WLAN_ACT" function="19" pad="PA13" ioset="4"/>
              <signal group="COEX_WLAN_ACT" function="20" pad="PB02" ioset="4"/>
              <signal group="COEX_WLAN_ACT" function="21" pad="PB06" ioset="4"/>
              <signal group="COEX_WLAN_ACT" function="22" pad="PB10" ioset="4"/>
              <signal group="COEX_WLAN_ACT" function="23" pad="PA08" ioset="4"/>
              <signal group="COEX_WLAN_ACT" function="24" pad="PA02" ioset="4"/>
            </signals>
          </instance>
        </module>
