zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
        <module name="CFG" id="chip_cfg_pb" name2="chip_cfg_pb" version="A">
          <instance name="CFG">
            <register-group name="CFG" name-in-module="CFG" address-space="base" offset="0x44000000"/>
          </instance>
        </module>
        <module name="CMCC" id="04727" name2="ram_cmcc_u2015_v7" version="A">
          <instance name="CMCC">
            <register-group name="CMCC" name-in-module="CMCC" address-space="base" offset="0x41002000"/>
          </instance>
        </module>
        <module name="CRU" id="03100" name2="clk_cru_upb_v3" version="A">
          <instance name="CRU">
            <register-group name="CRU" name-in-module="CRU" address-space="base" offset="0x44000A00"/>
            <signals>
              <signal group="REFI" function="1" pad="PA05" ioset="6"/>
              <signal group="REFI" function="2" pad="PB05" ioset="6"/>
              <signal group="REFI" function="3" pad="PB09" ioset="6"/>
              <signal group="REFI" function="5" pad="PE05" ioset="6"/>
              <signal group="REFI" function="6" pad="PA03" ioset="6"/>
              <signal group="REFI" function="7" pad="PA06" ioset="6"/>
              <signal group="REFI" function="8" pad="PA07" ioset="6"/>
              <signal group="REFI" function="9" pad="PB06" ioset="6"/>
              <signal group="REFI" function="10" pad="PB08" ioset="6"/>
              <signal group="REFO" index="1" function="8" pad="PA03" ioset="6"/>
              <signal group="REFO" index="1" function="8" pad="PA05" ioset="6"/>
              <signal group="REFO" index="1" function="8" pad="PA06" ioset="6"/>
              <signal group="REFO" index="1" function="8" pad="PA07" ioset="6"/>
              <signal group="REFO" index="1" function="8" pad="PB05" ioset="6"/>
              <signal group="REFO" index="1" function="8" pad="PB06" ioset="6"/>
              <signal group="REFO" index="1" function="8" pad="PB08" ioset="6"/>
              <signal group="REFO" index="1" function="8" pad="PB09" ioset="6"/>
              <signal group="REFO" index="1" function="8" pad="PE05" ioset="6"/>
              <signal group="REFO" index="2" function="9" pad="PA03" ioset="6"/>
              <signal group="REFO" index="2" function="9" pad="PA05" ioset="6"/>
              <signal group="REFO" index="2" function="9" pad="PA06" ioset="6"/>
              <signal group="REFO" index="2" function="9" pad="PA07" ioset="6"/>
              <signal group="REFO" index="2" function="9" pad="PB05" ioset="6"/>
              <signal group="REFO" index="2" function="9" pad="PB06" ioset="6"/>
              <signal group="REFO" index="2" function="9" pad="PB08" ioset="6"/>
              <signal group="REFO" index="2" function="9" pad="PB09" ioset="6"/>
              <signal group="REFO" index="2" function="9" pad="PE05" ioset="6"/>
              <signal group="REFO" index="3" function="10" pad="PA03" ioset="6"/>
              <signal group="REFO" index="3" function="10" pad="PA05" ioset="6"/>
              <signal group="REFO" index="3" function="10" pad="PA06" ioset="6"/>
              <signal group="REFO" index="3" function="10" pad="PA07" ioset="6"/>
              <signal group="REFO" index="3" function="10" pad="PB05" ioset="6"/>
              <signal group="REFO" index="3" function="10" pad="PB06" ioset="6"/>
              <signal group="REFO" index="3" function="10" pad="PB08" ioset="6"/>
              <signal group="REFO" index="3" function="10" pad="PB09" ioset="6"/>
              <signal group="REFO" index="3" function="10" pad="PE05" ioset="6"/>
              <signal group="REFO" index="4" function="11" pad="PA03" ioset="6"/>
              <signal group="REFO" index="4" function="11" pad="PA05" ioset="6"/>
              <signal group="REFO" index="4" function="11" pad="PA06" ioset="6"/>
              <signal group="REFO" index="4" function="11" pad="PA07" ioset="6"/>
              <signal group="REFO" index="4" function="11" pad="PB05" ioset="6"/>
              <signal group="REFO" index="4" function="11" pad="PB06" ioset="6"/>
              <signal group="REFO" index="4" function="11" pad="PB08" ioset="6"/>
              <signal group="REFO" index="4" function="11" pad="PB09" ioset="6"/>
              <signal group="REFO" index="4" function="11" pad="PE05" ioset="6"/>
            </signals>
          </instance>
        </module>
        <module name="CVD" id="05033" name2="adc_cvd_ctrl_upb_v2" version="Rev A.1">
          <instance name="CVD">
            <register-group name="CVD" name-in-module="CVD" address-space="base" offset="0x44002400"/>
            <signals>
              <signal group="CVDR" index="1" function="ADC" pad="PB5"/>
              <signal group="CVDR" index="2" function="ADC" pad="PB6"/>
              <signal group="CVDR" index="3" function="ADC" pad="PB7"/>
              <signal group="CVDR" index="4" function="ADC" pad="PB0"/>
              <signal group="CVDR" index="5" function="ADC" pad="PB1"/>
              <signal group="CVDR" index="6" function="ADC" pad="PB2"/>
              <signal group="CVDR" index="7" function="ADC" pad="PB3"/>
              <signal group="CVDR" index="8" function="ADC" pad="PB4"/>
              <signal group="CVDR" index="9" function="ADC" pad="PD3"/>
              <signal group="CVDR" index="10" function="ADC" pad="PD4"/>
              <signal group="CVDR" index="11" function="ADC" pad="PD5"/>
              <signal group="CVDR" index="12" function="ADC" pad="PD6"/>
              <signal group="CVDR" index="13" function="ADC" pad="PD7"/>
              <signal group="CVDR" index="14" function="ADC" pad="PE6"/>
              <signal group="CVDR" index="15" function="ADC" pad="PC7"/>
              <signal group="CVDR" index="16" function="ADC" pad="PD2"/>
              <signal group="CVDR" index="18" function="ADC" pad="PB14"/>
              <signal group="CVDT" index="0" function="ADC" pad="PD2"/>
              <signal group="CVDT" index="1" function="ADC" pad="PB5"/>
              <signal group="CVDT" index="2" function="ADC" pad="PB6"/>
              <signal group="CVDT" index="3" function="ADC" pad="PB7"/>
              <signal group="CVDT" index="4" function="ADC" pad="PB0"/>
              <signal group="CVDT" index="5" function="ADC" pad="PB1"/>
              <signal group="CVDT" index="6" function="ADC" pad="PB2"/>
              <signal group="CVDT" index="7" function="ADC" pad="PB3"/>
              <signal group="CVDT" index="8" function="ADC" pad="PB4"/>
              <signal group="CVDT" index="9" function="ADC" pad="PD3"/>
              <signal group="CVDT" index="10" function="ADC" pad="PD4"/>
              <signal group="CVDT" index="11" function="ADC" pad="PD5"/>
              <signal group="CVDT" index="12" function="ADC" pad="PD6"/>
              <signal group="CVDT" index="13" function="ADC" pad="PD7"/>
              <signal group="CVDT" index="14" function="ADC" pad="PE6"/>
              <signal group="CVDT" index="15" function="ADC" pad="PC7"/>
              <signal group="CVDT" index="17" function="ADC" pad="PB14"/>
            </signals>
            <parameters>
              <param name="CVD_AN_MAX" value="8" caption="Max number of AN input index"/>
              <param name="CVD_AN_MIN" value="0" caption="Min number of AN input index"/>
              <param name="CVD_TX_NUM" value="18" caption="Number of TX outputs on the device. Max of 64"/>
              <param name="CVD_FIFO_DEPTH" value="32" caption="Number of words in the UPB FIFO. Max is 1KThe depth of the UPB FIFO is limited to &quot;powers of 2&quot;.Allowable values are: 8, 16, 32, 64, 128, 256, 512, 1K"/>
              <param name="ADCBITS" value="12" caption="Number of bits in the ADC data. Max is 16-bit."/>
              <param name="NUM_RX" value="20" caption="Number of RX Indexes."/>
              <param name="NUM_TX" value="20" caption="Number of TX Indexes."/>
              <param name="UPB_ADDRL" value="0x2400" caption="Start address of UPB registers"/>
              <param name="NUM_ADC" value="1"/>
              <param name="GCLK_ID" value="31"/>
            </parameters>
          </instance>
        </module>
        <module name="CoreDebug" id="SYSTEM_IP" version="1.0.0">
          <instance name="CoreDebug">
            <register-group name="CoreDebug" name-in-module="CoreDebug" address-space="base" offset="0xE000EDF0"/>
