zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
        <module name="EFUSE" id="EIP_00504" version="1.0.0">
          <instance name="EFUSE">
            <register-group name="EFUSE" name-in-module="EFUSE" address-space="fuses" offset="0x0"/>
          </instance>
        </module>
        <module name="ETH" id="03792" name2="eth_gem_apb_v1" version="A">
          <instance name="ETH">
            <register-group name="ETH" name-in-module="ETH" address-space="base" offset="0x4100A000"/>
            <parameters>
              <param name="GCLK_ID" value="30"/>
              <param name="PAC_ID" value="37" caption="Index for ETH registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="ETM" id="SYSTEM_IP" version="1.0.0">
          <instance name="ETM">
            <register-group name="ETM" name-in-module="ETM" address-space="base" offset="0xE0041000"/>
          </instance>
        </module>
        <module name="EVSYS" id="04712" name2="ptg_evsys_u2504_v3" version="A">
          <instance name="EVSYS">
            <register-group name="EVSYS" name-in-module="EVSYS" address-space="base" offset="0x41006000"/>
            <parameters>
              <param name="INSTANCE_ID" value="35" caption="Instance index for EVSYS"/>
              <param name="GCLK_ID_0" value="12"/>
              <param name="GCLK_ID_1" value="13"/>
              <param name="GCLK_ID_2" value="14"/>
              <param name="GCLK_ID_3" value="15"/>
              <param name="GCLK_ID_4" value="16"/>
              <param name="GCLK_ID_5" value="17"/>
              <param name="GCLK_ID_6" value="18"/>
              <param name="GCLK_ID_7" value="19"/>
              <param name="GCLK_ID_8" value="20"/>
              <param name="GCLK_ID_9" value="21"/>
              <param name="GCLK_ID_10" value="22"/>
              <param name="GCLK_ID_11" value="23"/>
              <param name="CHIP_EVSYS_PADDR_MSB" value="12"/>
              <param name="CHIP_EVSYS_EXTEVT_NUM" value="0"/>
              <param name="CHIP_EVSYS_ASYNCHRONOUS_CHANNELS" value="32"/>
              <param name="CHIP_EVSYS_CHANNELS" value="32"/>
              <param name="CHIP_EVSYS_GENERATORS" value="89"/>
              <param name="CHIP_EVSYS_SYNCH_NUM" value="12"/>
              <param name="CHIP_EVSYS_USERS" value="59"/>
              <param name="CHIP_EVSYS_CHANNELS_BITS" value="5"/>
              <param name="CHIP_EVSYS_GENERATORS_BITS" value="7"/>
              <param name="CHIP_EVSYS_SYNCH_NUM_BITS" value="4"/>
              <param name="CHIP_EVSYS_USERS_BITS" value="6"/>
              <param name="PAC_ID" value="35" caption="Index for EVSYS registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="FPU" id="SYSTEM_IP" version="1.0.0">
          <instance name="FPU">
            <register-group name="FPU" name-in-module="FPU" address-space="base" offset="0xE000EF30"/>
          </instance>
        </module>
        <module name="FREQM" id="04703" name2="clk_freqm_u2257_v4" version="A">
          <instance name="FREQM">
            <register-group name="FREQM" name-in-module="FREQM" address-space="base" offset="0x40000400"/>
            <parameters>
              <param name="INSTANCE_ID" value="1" caption="Instance index for FREQM"/>
              <param name="GCLK_ID_MSR" value="1"/>
              <param name="GCLK_ID_REF" value="2"/>
              <param name="PAC_ID" value="1" caption="Index for FREQM registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="FUSES" id="fuses" name2="fuses" version="A">
          <instance name="FUSES">
            <register-group name="FUSES_DEVICECFG" name-in-module="FUSES_DEVICECFG" address-space="base" offset="0x00810E80"/>
          </instance>
        </module>
        <module name="GPIO" id="02467" name2="gpio_ports_upb_v1" version="A">
          <instance name="GPIOE">
            <register-group name="GPIOE" name-in-module="GPIO" address-space="base" offset="0x44002D00"/>
            <signals>
              <signal group="IOCE" index="0" function="CHANGE_NOTIFICATION" pad="PE0"/>
              <signal group="IOCE" index="1" function="CHANGE_NOTIFICATION" pad="PE1"/>
              <signal group="IOCE" index="2" function="CHANGE_NOTIFICATION" pad="PE2"/>
              <signal group="IOCE" index="3" function="CHANGE_NOTIFICATION" pad="PE3"/>
              <signal group="IOCE" index="4" function="CHANGE_NOTIFICATION" pad="PE4"/>
              <signal group="IOCE" index="5" function="CHANGE_NOTIFICATION" pad="PE5"/>
              <signal group="IOCE" index="6" function="CHANGE_NOTIFICATION" pad="PE6"/>
              <signal group="RE" index="0" function="PORT_I_O" pad="PE0"/>
              <signal group="RE" index="1" function="PORT_I_O" pad="PE1"/>
              <signal group="RE" index="2" function="PORT_I_O" pad="PE2"/>
              <signal group="RE" index="3" function="PORT_I_O" pad="PE3"/>
              <signal group="RE" index="4" function="PORT_I_O" pad="PE4"/>
              <signal group="RE" index="5" function="PORT_I_O" pad="PE5"/>
              <signal group="RE" index="6" function="PORT_I_O" pad="PE6"/>
            </signals>
          </instance>
          <instance name="GPIOD">
            <register-group name="GPIOD" name-in-module="GPIO" address-space="base" offset="0x44002C00"/>
            <signals>
              <signal group="IOCD" index="2" function="CHANGE_NOTIFICATION" pad="PD2"/>
              <signal group="IOCD" index="3" function="CHANGE_NOTIFICATION" pad="PD3"/>
              <signal group="IOCD" index="4" function="CHANGE_NOTIFICATION" pad="PD4"/>
              <signal group="IOCD" index="5" function="CHANGE_NOTIFICATION" pad="PD5"/>
              <signal group="IOCD" index="6" function="CHANGE_NOTIFICATION" pad="PD6"/>
              <signal group="IOCD" index="7" function="CHANGE_NOTIFICATION" pad="PD7"/>
              <signal group="RD" index="0" function="PORT_I_O" pad="PD0"/>
              <signal group="RD" index="1" function="PORT_I_O" pad="PD1"/>
              <signal group="RD" index="2" function="PORT_I_O" pad="PD2"/>
              <signal group="RD" index="3" function="PORT_I_O" pad="PD3"/>
              <signal group="RD" index="4" function="PORT_I_O" pad="PD4"/>
              <signal group="RD" index="5" function="PORT_I_O" pad="PD5"/>
              <signal group="RD" index="6" function="PORT_I_O" pad="PD6"/>
              <signal group="RD" index="7" function="PORT_I_O" pad="PD7"/>
            </signals>
          </instance>
          <instance name="GPIOC">
            <register-group name="GPIOC" name-in-module="GPIO" address-space="base" offset="0x44002B00"/>
            <signals>
              <signal group="IOCC" index="0" function="CHANGE_NOTIFICATION" pad="PC0"/>
              <signal group="IOCC" index="1" function="CHANGE_NOTIFICATION" pad="PC1"/>
              <signal group="IOCC" index="7" function="CHANGE_NOTIFICATION" pad="PC7"/>
              <signal group="IOCC" index="8" function="CHANGE_NOTIFICATION" pad="PC8"/>
              <signal group="IOCC" index="9" function="CHANGE_NOTIFICATION" pad="PC9"/>
              <signal group="RC" index="0" function="PORT_I_O" pad="PC0"/>
              <signal group="RC" index="1" function="PORT_I_O" pad="PC1"/>
              <signal group="RC" index="7" function="PORT_I_O" pad="PC7"/>
              <signal group="RC" index="8" function="PORT_I_O" pad="PC8"/>
              <signal group="RC" index="9" function="PORT_I_O" pad="PC9"/>
              <signal group="RC" index="11" function="PORT_I_O" pad="PC11"/>
            </signals>
          </instance>
