zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
              <signal group="DATA_IN" index="2" function="9" pad="PE01" ioset="2"/>
              <signal group="DATA_IN" index="2" function="10" pad="PA03" ioset="2"/>
              <signal group="DATA_IN" index="2" function="11" pad="PB02" ioset="2"/>
              <signal group="DATA_IN" index="2" function="13" pad="PD04" ioset="2"/>
              <signal group="DATA_IN" index="2" function="15" pad="PA04" ioset="2"/>
              <signal group="DATA_IN" index="2" function="16" pad="PA08" ioset="2"/>
              <signal group="DATA_IN" index="2" function="17" pad="PB12" ioset="2"/>
              <signal group="DATA_IN" index="2" function="18" pad="PB05" ioset="2"/>
              <signal group="DATA_IN" index="2" function="19" pad="PB09" ioset="2"/>
              <signal group="DATA_IN" index="2" function="20" pad="PB13" ioset="2"/>
              <signal group="DATA_IN" index="2" function="21" pad="PB00" ioset="2"/>
              <signal group="DATA_IN" index="2" function="22" pad="PB04" ioset="2"/>
              <signal group="DATA_IN" index="2" function="23" pad="PB08" ioset="2"/>
              <signal group="DATA_IN" index="2" function="24" pad="PA00" ioset="2"/>
              <signal group="DATA_IN" index="2" function="25" pad="PA11" ioset="2"/>
              <signal group="DATA_OUT" index="2" function="37" pad="PA00" ioset="2"/>
              <signal group="DATA_OUT" index="2" function="37" pad="PA01" ioset="2"/>
              <signal group="DATA_OUT" index="2" function="37" pad="PA03" ioset="2"/>
              <signal group="DATA_OUT" index="2" function="37" pad="PA04" ioset="2"/>
              <signal group="DATA_OUT" index="2" function="37" pad="PA07" ioset="2"/>
              <signal group="DATA_OUT" index="2" function="37" pad="PA08" ioset="2"/>
              <signal group="DATA_OUT" index="2" function="37" pad="PA11" ioset="2"/>
              <signal group="DATA_OUT" index="2" function="37" pad="PA12" ioset="2"/>
              <signal group="DATA_OUT" index="2" function="37" pad="PB00" ioset="2"/>
              <signal group="DATA_OUT" index="2" function="37" pad="PB01" ioset="2"/>
              <signal group="DATA_OUT" index="2" function="37" pad="PB02" ioset="2"/>
              <signal group="DATA_OUT" index="2" function="37" pad="PB04" ioset="2"/>
              <signal group="DATA_OUT" index="2" function="37" pad="PB05" ioset="2"/>
              <signal group="DATA_OUT" index="2" function="37" pad="PB07" ioset="2"/>
              <signal group="DATA_OUT" index="2" function="37" pad="PB08" ioset="2"/>
              <signal group="DATA_OUT" index="2" function="37" pad="PB09" ioset="2"/>
              <signal group="DATA_OUT" index="2" function="37" pad="PB12" ioset="2"/>
              <signal group="DATA_OUT" index="2" function="37" pad="PB13" ioset="2"/>
              <signal group="DATA_OUT" index="2" function="37" pad="PC01" ioset="2"/>
              <signal group="DATA_OUT" index="2" function="37" pad="PD04" ioset="2"/>
              <signal group="DATA_OUT" index="2" function="37" pad="PE01" ioset="2"/>
              <signal group="DATA_OUT" index="2" function="31" pad="PA00" ioset="4"/>
              <signal group="DATA_OUT" index="2" function="31" pad="PA01" ioset="4"/>
              <signal group="DATA_OUT" index="2" function="31" pad="PA02" ioset="4"/>
              <signal group="DATA_OUT" index="2" function="31" pad="PA03" ioset="4"/>
              <signal group="DATA_OUT" index="2" function="31" pad="PA05" ioset="4"/>
              <signal group="DATA_OUT" index="2" function="31" pad="PA06" ioset="4"/>
              <signal group="DATA_OUT" index="2" function="31" pad="PA08" ioset="4"/>
              <signal group="DATA_OUT" index="2" function="31" pad="PA09" ioset="4"/>
              <signal group="DATA_OUT" index="2" function="31" pad="PA10" ioset="4"/>
              <signal group="DATA_OUT" index="2" function="31" pad="PA13" ioset="4"/>
              <signal group="DATA_OUT" index="2" function="31" pad="PA14" ioset="4"/>
              <signal group="DATA_OUT" index="2" function="31" pad="PB02" ioset="4"/>
              <signal group="DATA_OUT" index="2" function="31" pad="PB03" ioset="4"/>
              <signal group="DATA_OUT" index="2" function="31" pad="PB04" ioset="4"/>
              <signal group="DATA_OUT" index="2" function="31" pad="PB06" ioset="4"/>
              <signal group="DATA_OUT" index="2" function="31" pad="PB07" ioset="4"/>
              <signal group="DATA_OUT" index="2" function="31" pad="PB10" ioset="4"/>
              <signal group="DATA_OUT" index="2" function="31" pad="PB11" ioset="4"/>
              <signal group="DATA_OUT" index="2" function="31" pad="PC09" ioset="4"/>
              <signal group="DATA_OUT" index="2" function="31" pad="PD07" ioset="4"/>
              <signal group="DATA_OUT" index="2" function="31" pad="PE03" ioset="4"/>
              <signal group="DATA_OUT" index="3" function="28" pad="PA00" ioset="1"/>
              <signal group="DATA_OUT" index="3" function="28" pad="PA02" ioset="1"/>
              <signal group="DATA_OUT" index="3" function="28" pad="PA03" ioset="1"/>
              <signal group="DATA_OUT" index="3" function="28" pad="PA06" ioset="1"/>
              <signal group="DATA_OUT" index="3" function="28" pad="PA07" ioset="1"/>
              <signal group="DATA_OUT" index="3" function="28" pad="PA09" ioset="1"/>
              <signal group="DATA_OUT" index="3" function="28" pad="PA10" ioset="1"/>
              <signal group="DATA_OUT" index="3" function="28" pad="PA11" ioset="1"/>
              <signal group="DATA_OUT" index="3" function="28" pad="PA14" ioset="1"/>
              <signal group="DATA_OUT" index="3" function="28" pad="PB00" ioset="1"/>
              <signal group="DATA_OUT" index="3" function="28" pad="PB01" ioset="1"/>
              <signal group="DATA_OUT" index="3" function="28" pad="PB03" ioset="1"/>
              <signal group="DATA_OUT" index="3" function="28" pad="PB04" ioset="1"/>
              <signal group="DATA_OUT" index="3" function="28" pad="PB06" ioset="1"/>
              <signal group="DATA_OUT" index="3" function="28" pad="PB07" ioset="1"/>
              <signal group="DATA_OUT" index="3" function="28" pad="PB08" ioset="1"/>
              <signal group="DATA_OUT" index="3" function="28" pad="PB11" ioset="1"/>
              <signal group="DATA_OUT" index="3" function="28" pad="PB12" ioset="1"/>
              <signal group="DATA_OUT" index="3" function="28" pad="PC09" ioset="1"/>
              <signal group="DATA_OUT" index="3" function="28" pad="PD06" ioset="1"/>
              <signal group="DATA_OUT" index="3" function="28" pad="PE04" ioset="1"/>
              <signal group="DATA_OUT" index="3" function="36" pad="PA00" ioset="2"/>
              <signal group="DATA_OUT" index="3" function="36" pad="PA01" ioset="2"/>
              <signal group="DATA_OUT" index="3" function="36" pad="PA03" ioset="2"/>
              <signal group="DATA_OUT" index="3" function="36" pad="PA04" ioset="2"/>
              <signal group="DATA_OUT" index="3" function="36" pad="PA07" ioset="2"/>
              <signal group="DATA_OUT" index="3" function="36" pad="PA08" ioset="2"/>
              <signal group="DATA_OUT" index="3" function="36" pad="PA11" ioset="2"/>
              <signal group="DATA_OUT" index="3" function="36" pad="PA12" ioset="2"/>
              <signal group="DATA_OUT" index="3" function="36" pad="PB00" ioset="2"/>
              <signal group="DATA_OUT" index="3" function="36" pad="PB01" ioset="2"/>
              <signal group="DATA_OUT" index="3" function="36" pad="PB02" ioset="2"/>
              <signal group="DATA_OUT" index="3" function="36" pad="PB04" ioset="2"/>
              <signal group="DATA_OUT" index="3" function="36" pad="PB05" ioset="2"/>
              <signal group="DATA_OUT" index="3" function="36" pad="PB07" ioset="2"/>
              <signal group="DATA_OUT" index="3" function="36" pad="PB08" ioset="2"/>
              <signal group="DATA_OUT" index="3" function="36" pad="PB09" ioset="2"/>
              <signal group="DATA_OUT" index="3" function="36" pad="PB12" ioset="2"/>
              <signal group="DATA_OUT" index="3" function="36" pad="PB13" ioset="2"/>
              <signal group="DATA_OUT" index="3" function="36" pad="PC01" ioset="2"/>
              <signal group="DATA_OUT" index="3" function="36" pad="PD04" ioset="2"/>
              <signal group="DATA_OUT" index="3" function="36" pad="PE01" ioset="2"/>
              <signal group="DATA_IN" index="3" function="1" pad="PA02" ioset="3"/>
              <signal group="DATA_IN" index="3" function="2" pad="PA08" ioset="3"/>
              <signal group="DATA_IN" index="3" function="3" pad="PA13" ioset="3"/>
              <signal group="DATA_IN" index="3" function="4" pad="PB02" ioset="3"/>
              <signal group="DATA_IN" index="3" function="5" pad="PB08" ioset="3"/>
              <signal group="DATA_IN" index="3" function="6" pad="PB13" ioset="3"/>
              <signal group="DATA_IN" index="3" function="8" pad="PD02" ioset="3"/>
              <signal group="DATA_IN" index="3" function="10" pad="PA04" ioset="3"/>
              <signal group="DATA_IN" index="3" function="11" pad="PB03" ioset="3"/>
              <signal group="DATA_IN" index="3" function="13" pad="PD06" ioset="3"/>
              <signal group="DATA_IN" index="3" function="15" pad="PA05" ioset="3"/>
              <signal group="DATA_IN" index="3" function="16" pad="PA09" ioset="3"/>
              <signal group="DATA_IN" index="3" function="17" pad="PB06" ioset="3"/>
              <signal group="DATA_IN" index="3" function="18" pad="PB10" ioset="3"/>
              <signal group="DATA_IN" index="3" function="19" pad="PA00" ioset="3"/>
              <signal group="DATA_IN" index="3" function="20" pad="PB01" ioset="3"/>
              <signal group="DATA_IN" index="3" function="21" pad="PB05" ioset="3"/>
              <signal group="DATA_IN" index="3" function="22" pad="PB09" ioset="3"/>
              <signal group="DATA_IN" index="3" function="23" pad="PA01" ioset="3"/>
              <signal group="DATA_IN" index="3" function="24" pad="PA12" ioset="3"/>
              <signal group="DATA_OUT" index="3" function="37" pad="PA00" ioset="3"/>
              <signal group="DATA_OUT" index="3" function="37" pad="PA01" ioset="3"/>
              <signal group="DATA_OUT" index="3" function="37" pad="PA02" ioset="3"/>
              <signal group="DATA_OUT" index="3" function="37" pad="PA04" ioset="3"/>
              <signal group="DATA_OUT" index="3" function="37" pad="PA05" ioset="3"/>
              <signal group="DATA_OUT" index="3" function="37" pad="PA08" ioset="3"/>
              <signal group="DATA_OUT" index="3" function="37" pad="PA09" ioset="3"/>
              <signal group="DATA_OUT" index="3" function="37" pad="PA12" ioset="3"/>
              <signal group="DATA_OUT" index="3" function="37" pad="PA13" ioset="3"/>
              <signal group="DATA_OUT" index="3" function="37" pad="PB01" ioset="3"/>
              <signal group="DATA_OUT" index="3" function="37" pad="PB02" ioset="3"/>
              <signal group="DATA_OUT" index="3" function="37" pad="PB03" ioset="3"/>
              <signal group="DATA_OUT" index="3" function="37" pad="PB05" ioset="3"/>
              <signal group="DATA_OUT" index="3" function="37" pad="PB06" ioset="3"/>
              <signal group="DATA_OUT" index="3" function="37" pad="PB08" ioset="3"/>
              <signal group="DATA_OUT" index="3" function="37" pad="PB09" ioset="3"/>
              <signal group="DATA_OUT" index="3" function="37" pad="PB10" ioset="3"/>
              <signal group="DATA_OUT" index="3" function="37" pad="PB13" ioset="3"/>
              <signal group="DATA_OUT" index="3" function="37" pad="PC08" ioset="3"/>
              <signal group="DATA_OUT" index="3" function="37" pad="PD06" ioset="3"/>
              <signal group="DATA_OUT" index="3" function="37" pad="PE02" ioset="3"/>
              <signal group="SCK" function="7" pad="PA03" ioset="6"/>
              <signal group="SCK" function="7" pad="PA05" ioset="6"/>
              <signal group="SCK" function="7" pad="PA06" ioset="6"/>
              <signal group="SCK" function="7" pad="PA07" ioset="6"/>
              <signal group="SCK" function="7" pad="PB05" ioset="6"/>
              <signal group="SCK" function="7" pad="PB06" ioset="6"/>
              <signal group="SCK" function="7" pad="PB08" ioset="6"/>
              <signal group="SCK" function="7" pad="PB09" ioset="6"/>
              <signal group="SCK" function="7" pad="PE05" ioset="6"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="65"/>
              <param name="DMAC_ID_TX" value="66"/>
              <param name="INSTANCE_ID" value="64" caption="Instance index for QSPI"/>
              <param name="PAC_ID" value="64" caption="Index for QSPI registers write protection"/>
            </parameters>
          </instance>
        </module>
