zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
        <module name="RAMECC" id="04713" name2="ram_ramecc_u2268_v2" version="A">
          <instance name="RAMECC">
            <register-group name="RAMECC" name-in-module="RAMECC" address-space="base" offset="0x41008000"/>
            <parameters>
              <param name="INSTANCE_ID" value="36" caption="Instance index for RAMECC"/>
              <param name="PAC_ID" value="36" caption="Index for RAMECC registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="RCON" id="03100" name2="clk_cru_upb_v3" version="A">
          <instance name="RCON">
            <register-group name="RCON" name-in-module="RCON" address-space="base" offset="0x44000A00"/>
          </instance>
        </module>
        <module name="ROT" id="05544" name2="sec_root_of_trust_v2" version="A">
          <instance name="ROT">
            <register-group name="ROT" name-in-module="ROT" address-space="base" offset="0x44003000"/>
            <parameters>
              <param name="ROM_SIZE" value="64" caption="In Kbytes"/>
              <param name="NUM_FUSE_BLKS" value="3" caption="CAL bits and die info a part of the NVR region"/>
              <param name="CAL_NUM" value="0" caption="Number of CAL bits"/>
              <param name="RST_CAL_BITS" value="0" caption="Reset value of CAL bits"/>
              <param name="SYMMETRIC_SECURE_BOOT" value="0" caption="Secure boot using ECCDSA authentication"/>
              <param name="MACRO_AUX_IN_WIDTH" value="4"/>
              <param name="PB_WAIT_ROM" value="0"/>
              <param name="START_OSC_PERIOD" value="125"/>
              <param name="PB_ADDRL" value="0x300" caption="PB start address"/>
              <param name="PB_ADDRH" value="0x3FF" caption="PB end address"/>
              <param name="EXT_VDDQ_SW" value="1"/>
              <param name="TPWRUP_VDDQ_NS" value="4000"/>
            </parameters>
          </instance>
        </module>
        <module name="RTC" id="04715" name2="tmr_rtc_u2250_v4" version="A">
          <instance name="RTC">
            <register-group name="RTC" name-in-module="RTC" address-space="base" offset="0x42010000"/>
            <signals>
              <signal group="EVENT" function="RTCC" pad="PB13"/>
              <signal group="IN" index="0" function="RTCC" pad="PA3"/>
              <signal group="IN" index="1" function="RTCC" pad="PA2"/>
              <signal group="IN" index="2" function="RTCC" pad="PA1"/>
              <signal group="IN" index="3" function="RTCC" pad="PA0"/>
              <signal group="OUT" function="RTCC" pad="PA4"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TIMESTAMP" value="1"/>
              <param name="CHIP_RTC_PADDR_MSB" value="9"/>
              <param name="CHIP_RTC_NUM_OF_ALARMS" value="2"/>
              <param name="CHIP_RTC_NUM_OF_BKREGS" value="1"/>
              <param name="CHIP_RTC_NUM_OF_COMP16" value="4"/>
              <param name="CHIP_RTC_NUM_OF_TAMPERS" value="4"/>
            </parameters>
          </instance>
        </module>
        <module name="SERCOM" id="04707" name2="com_sercom_u2201_v7" version="A">
          <instance name="SERCOM0">
            <register-group name="SERCOM0" name-in-module="SERCOM" address-space="base" offset="0x40000C00"/>
            <signals>
              <signal group="PAD" index="0" function="MSSP_SPI_I2C" pad="PA5"/>
              <signal group="PAD" index="1" function="MSSP_SPI_I2C" pad="PA6"/>
              <signal group="PAD" index="2" function="MSSP_SPI_I2C" pad="PB9"/>
              <signal group="PAD" index="3" function="MSSP_SPI_I2C" pad="PA4"/>
              <signal group="PAD_IN" index="3" function="1" pad="PA00" ioset="1"/>
              <signal group="PAD_IN" index="3" function="2" pad="PA06" ioset="1"/>
              <signal group="PAD_IN" index="3" function="3" pad="PA11" ioset="1"/>
              <signal group="PAD_IN" index="3" function="4" pad="PB00" ioset="1"/>
              <signal group="PAD_IN" index="3" function="5" pad="PB06" ioset="1"/>
              <signal group="PAD_IN" index="3" function="6" pad="PB11" ioset="1"/>
              <signal group="PAD_IN" index="3" function="8" pad="PD06" ioset="1"/>
              <signal group="PAD_IN" index="3" function="10" pad="PE06" ioset="1"/>
              <signal group="PAD_IN" index="3" function="11" pad="PB01" ioset="1"/>
              <signal group="PAD_IN" index="3" function="13" pad="PD03" ioset="1"/>
              <signal group="PAD_IN" index="3" function="15" pad="PA03" ioset="1"/>
              <signal group="PAD_IN" index="3" function="16" pad="PA07" ioset="1"/>
              <signal group="PAD_IN" index="3" function="17" pad="PB04" ioset="1"/>
              <signal group="PAD_IN" index="3" function="18" pad="PB08" ioset="1"/>
              <signal group="PAD_IN" index="3" function="19" pad="PB12" ioset="1"/>
              <signal group="PAD_IN" index="3" function="20" pad="PA02" ioset="1"/>
              <signal group="PAD_IN" index="3" function="21" pad="PA10" ioset="1"/>
              <signal group="PAD_IN" index="3" function="22" pad="PA14" ioset="1"/>
              <signal group="PAD_IN" index="3" function="23" pad="PB03" ioset="1"/>
              <signal group="PAD_IN" index="3" function="24" pad="PB07" ioset="1"/>
              <signal group="PAD_IN" index="3" function="25" pad="PA09" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="1" pad="PA00" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="1" pad="PA02" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="1" pad="PA03" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="1" pad="PA06" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="1" pad="PA07" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="1" pad="PA09" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="1" pad="PA10" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="1" pad="PA11" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="1" pad="PA14" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="1" pad="PB00" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="1" pad="PB01" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="1" pad="PB03" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="1" pad="PB04" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="1" pad="PB06" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="1" pad="PB07" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="1" pad="PB08" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="1" pad="PB11" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="1" pad="PB12" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="1" pad="PC09" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="1" pad="PD06" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="1" pad="PE04" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PA02" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PA03" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PA06" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PA07" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PA09" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PA10" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PA11" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PA12" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PA14" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PB00" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PB01" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PB03" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PB04" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PB06" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PB07" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PB08" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PB11" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PB12" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PC09" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PD06" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PE04" ioset="1"/>
              <signal group="PAD_IN" index="0" function="2" pad="PA01" ioset="2"/>
              <signal group="PAD_IN" index="0" function="2" pad="PA07" ioset="2"/>
              <signal group="PAD_IN" index="0" function="2" pad="PA12" ioset="2"/>
              <signal group="PAD_IN" index="0" function="2" pad="PB01" ioset="2"/>
              <signal group="PAD_IN" index="0" function="2" pad="PB07" ioset="2"/>
              <signal group="PAD_IN" index="0" function="2" pad="PC07" ioset="2"/>
              <signal group="PAD_IN" index="0" function="2" pad="PE01" ioset="2"/>
              <signal group="PAD_IN" index="0" function="10" pad="PA03" ioset="2"/>
              <signal group="PAD_IN" index="0" function="11" pad="PB02" ioset="2"/>
              <signal group="PAD_IN" index="0" function="13" pad="PD04" ioset="2"/>
              <signal group="PAD_IN" index="0" function="15" pad="PA04" ioset="2"/>
              <signal group="PAD_IN" index="0" function="16" pad="PA08" ioset="2"/>
              <signal group="PAD_IN" index="0" function="17" pad="PB12" ioset="2"/>
              <signal group="PAD_IN" index="0" function="18" pad="PB05" ioset="2"/>
              <signal group="PAD_IN" index="0" function="19" pad="PB09" ioset="2"/>
              <signal group="PAD_IN" index="0" function="20" pad="PB13" ioset="2"/>
              <signal group="PAD_IN" index="0" function="21" pad="PB00" ioset="2"/>
              <signal group="PAD_IN" index="0" function="22" pad="PB04" ioset="2"/>
              <signal group="PAD_IN" index="0" function="23" pad="PB08" ioset="2"/>
              <signal group="PAD_IN" index="0" function="24" pad="PA00" ioset="2"/>
              <signal group="PAD_IN" index="0" function="25" pad="PA11" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PA00" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PA01" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PA03" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PA04" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PA07" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PA08" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PA11" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PA12" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PB00" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PB01" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PB02" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PB04" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PB05" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PB07" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PB08" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PB09" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PB12" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PB13" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PC01" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PD04" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PE01" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PA00" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PA01" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PA03" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PA04" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PA07" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PA08" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PA11" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PA12" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PB00" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PB01" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PB02" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PB04" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PB05" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PB07" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PB08" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PB09" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PB12" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PB13" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PC01" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PD04" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PE01" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="4" pad="PA00" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="4" pad="PA01" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="4" pad="PA03" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="4" pad="PA04" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="4" pad="PA07" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="4" pad="PA08" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="4" pad="PA11" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="4" pad="PA12" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="4" pad="PB00" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="4" pad="PB01" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="4" pad="PB02" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="4" pad="PB04" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="4" pad="PB05" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="4" pad="PB07" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="4" pad="PB08" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="4" pad="PB09" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="4" pad="PB12" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="4" pad="PB13" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="4" pad="PC01" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="4" pad="PD04" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="4" pad="PE01" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PA00" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PA01" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PA02" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PA04" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PA05" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PA08" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PA09" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PA12" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PA13" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PB01" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PB02" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PB03" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PB05" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PB06" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PB08" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PB09" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PB10" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PB13" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PC08" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PD06" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="2" pad="PE02" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PA00" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PA01" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PA02" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PA04" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PA05" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PA08" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PA09" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PA12" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PA13" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PB01" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PB02" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PB03" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PB05" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PB06" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PB08" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PB09" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PB10" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PB13" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PC08" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PD06" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="3" pad="PE02" ioset="3"/>
              <signal group="PAD_IN" index="2" function="1" pad="PA03" ioset="4"/>
              <signal group="PAD_IN" index="2" function="2" pad="PA09" ioset="4"/>
              <signal group="PAD_IN" index="2" function="3" pad="PA14" ioset="4"/>
              <signal group="PAD_IN" index="2" function="4" pad="PB03" ioset="4"/>
              <signal group="PAD_IN" index="2" function="6" pad="PD03" ioset="4"/>
              <signal group="PAD_IN" index="2" function="8" pad="PA00" ioset="4"/>
              <signal group="PAD_IN" index="2" function="9" pad="PB04" ioset="4"/>
              <signal group="PAD_IN" index="2" function="11" pad="PD07" ioset="4"/>
              <signal group="PAD_IN" index="2" function="13" pad="PA06" ioset="4"/>
              <signal group="PAD_IN" index="2" function="14" pad="PA10" ioset="4"/>
              <signal group="PAD_IN" index="2" function="15" pad="PB07" ioset="4"/>
              <signal group="PAD_IN" index="2" function="16" pad="PB11" ioset="4"/>
              <signal group="PAD_IN" index="2" function="17" pad="PA01" ioset="4"/>
              <signal group="PAD_IN" index="2" function="18" pad="PA05" ioset="4"/>
              <signal group="PAD_IN" index="2" function="19" pad="PA13" ioset="4"/>
              <signal group="PAD_IN" index="2" function="20" pad="PB02" ioset="4"/>
              <signal group="PAD_IN" index="2" function="21" pad="PB06" ioset="4"/>
              <signal group="PAD_IN" index="2" function="22" pad="PB10" ioset="4"/>
              <signal group="PAD_IN" index="2" function="23" pad="PA08" ioset="4"/>
              <signal group="PAD_IN" index="2" function="24" pad="PA02" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PA00" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PA01" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PA02" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PA03" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PA05" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PA06" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PA08" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PA09" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PA10" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PA13" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PA14" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PB02" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PB03" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PB04" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PB06" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PB07" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PB10" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PB11" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PC09" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PD07" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="2" pad="PE03" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="3" pad="PA00" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="3" pad="PA01" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="3" pad="PA02" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="3" pad="PA03" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="3" pad="PA05" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="3" pad="PA06" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="3" pad="PA08" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="3" pad="PA09" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="3" pad="PA10" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="3" pad="PA13" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="3" pad="PA14" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="3" pad="PB02" ioset="4"/>
