zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
          <instance name="SERCOM2">
            <register-group name="SERCOM2" name-in-module="SERCOM" address-space="base" offset="0x46000000"/>
            <signals>
              <signal group="PAD" index="0" function="MSSP_SPI_I2C" pad="PE0"/>
              <signal group="PAD" index="1" function="MSSP_SPI_I2C" pad="PE1"/>
              <signal group="PAD" index="2" function="MSSP_SPI_I2C" pad="PC0"/>
              <signal group="PAD" index="3" function="MSSP_SPI_I2C" pad="PC1"/>
              <signal group="PAD_IN" index="3" function="1" pad="PA00" ioset="1"/>
              <signal group="PAD_IN" index="3" function="2" pad="PA06" ioset="1"/>
              <signal group="PAD_IN" index="3" function="3" pad="PA11" ioset="1"/>
              <signal group="PAD_IN" index="3" function="4" pad="PB00" ioset="1"/>
              <signal group="PAD_IN" index="3" function="5" pad="PB06" ioset="1"/>
              <signal group="PAD_IN" index="3" function="6" pad="PB11" ioset="1"/>
              <signal group="PAD_IN" index="3" function="8" pad="PD06" ioset="1"/>
              <signal group="PAD_IN" index="3" function="10" pad="PE06" ioset="1"/>
              <signal group="PAD_IN" index="3" function="11" pad="PB01" ioset="1"/>
              <signal group="PAD_IN" index="3" function="13" pad="PD03" ioset="1"/>
              <signal group="PAD_IN" index="3" function="15" pad="PA03" ioset="1"/>
              <signal group="PAD_IN" index="3" function="16" pad="PA07" ioset="1"/>
              <signal group="PAD_IN" index="3" function="17" pad="PB04" ioset="1"/>
              <signal group="PAD_IN" index="3" function="18" pad="PB08" ioset="1"/>
              <signal group="PAD_IN" index="3" function="19" pad="PB12" ioset="1"/>
              <signal group="PAD_IN" index="3" function="20" pad="PA02" ioset="1"/>
              <signal group="PAD_IN" index="3" function="21" pad="PA10" ioset="1"/>
              <signal group="PAD_IN" index="3" function="22" pad="PA14" ioset="1"/>
              <signal group="PAD_IN" index="3" function="23" pad="PB03" ioset="1"/>
              <signal group="PAD_IN" index="3" function="24" pad="PB07" ioset="1"/>
              <signal group="PAD_IN" index="3" function="25" pad="PA09" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="5" pad="PA00" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="5" pad="PA02" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="5" pad="PA03" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="5" pad="PA06" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="5" pad="PA07" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="5" pad="PA09" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="5" pad="PA10" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="5" pad="PA11" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="5" pad="PA14" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="5" pad="PB00" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="5" pad="PB01" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="5" pad="PB03" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="5" pad="PB04" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="5" pad="PB06" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="5" pad="PB07" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="5" pad="PB08" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="5" pad="PB11" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="5" pad="PB12" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="5" pad="PC09" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="5" pad="PD06" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="5" pad="PE04" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PA00" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PA02" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PA03" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PA06" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PA07" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PA09" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PA10" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PA11" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PA14" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PB00" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PB01" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PB03" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PB04" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PB06" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PB07" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PB08" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PB11" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PB12" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PC09" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PD06" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PE04" ioset="1"/>
              <signal group="PAD_IN" index="0" function="1" pad="PA01" ioset="2"/>
              <signal group="PAD_IN" index="0" function="2" pad="PA07" ioset="2"/>
              <signal group="PAD_IN" index="0" function="3" pad="PA12" ioset="2"/>
              <signal group="PAD_IN" index="0" function="4" pad="PB01" ioset="2"/>
              <signal group="PAD_IN" index="0" function="5" pad="PB07" ioset="2"/>
              <signal group="PAD_IN" index="0" function="7" pad="PC07" ioset="2"/>
              <signal group="PAD_IN" index="0" function="9" pad="PE01" ioset="2"/>
              <signal group="PAD_IN" index="0" function="10" pad="PA03" ioset="2"/>
              <signal group="PAD_IN" index="0" function="11" pad="PB02" ioset="2"/>
              <signal group="PAD_IN" index="0" function="13" pad="PD04" ioset="2"/>
              <signal group="PAD_IN" index="0" function="15" pad="PA04" ioset="2"/>
              <signal group="PAD_IN" index="0" function="16" pad="PA08" ioset="2"/>
              <signal group="PAD_IN" index="0" function="17" pad="PB12" ioset="2"/>
              <signal group="PAD_IN" index="0" function="18" pad="PB05" ioset="2"/>
              <signal group="PAD_IN" index="0" function="19" pad="PB09" ioset="2"/>
              <signal group="PAD_IN" index="0" function="20" pad="PB13" ioset="2"/>
              <signal group="PAD_IN" index="0" function="21" pad="PB00" ioset="2"/>
              <signal group="PAD_IN" index="0" function="22" pad="PB04" ioset="2"/>
              <signal group="PAD_IN" index="0" function="23" pad="PB08" ioset="2"/>
              <signal group="PAD_IN" index="0" function="24" pad="PA00" ioset="2"/>
              <signal group="PAD_IN" index="0" function="25" pad="PA11" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA00" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA01" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA03" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA04" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA07" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA08" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA11" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA12" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PB00" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PB01" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PB02" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PB04" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PB05" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PB07" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PB08" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PB09" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PB12" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PB13" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PC01" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PD04" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PE01" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PA00" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PA01" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PA03" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PA04" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PA07" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PA08" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PA11" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PA12" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PB00" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PB01" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PB02" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PB04" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PB05" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PB07" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PB08" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PB09" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PB12" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PB13" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PC01" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PD04" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PE01" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PA00" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PA01" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PA03" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PA04" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PA07" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PA08" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PA11" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PA12" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PB00" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PB01" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PB02" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PB04" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PB05" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PB07" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PB08" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PB09" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PB12" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PB13" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PC01" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PD04" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PE01" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA00" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA01" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA02" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA04" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA05" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA08" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA09" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA12" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA13" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PB01" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PB02" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PB03" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PB05" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PB06" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PB08" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PB09" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PB10" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PB13" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PC08" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PD06" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PE02" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PA00" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PA01" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PA02" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PA04" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PA05" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PA08" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PA09" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PA12" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PA13" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PB01" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PB02" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PB03" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PB05" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PB06" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PB08" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PB09" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PB10" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PB13" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PC08" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PD06" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PE02" ioset="3"/>
              <signal group="PAD_IN" index="2" function="1" pad="PA03" ioset="4"/>
              <signal group="PAD_IN" index="2" function="2" pad="PA09" ioset="4"/>
              <signal group="PAD_IN" index="2" function="3" pad="PA14" ioset="4"/>
              <signal group="PAD_IN" index="2" function="4" pad="PB03" ioset="4"/>
              <signal group="PAD_IN" index="2" function="6" pad="PD03" ioset="4"/>
              <signal group="PAD_IN" index="2" function="8" pad="PA00" ioset="4"/>
              <signal group="PAD_IN" index="2" function="9" pad="PB04" ioset="4"/>
              <signal group="PAD_IN" index="2" function="11" pad="PD07" ioset="4"/>
              <signal group="PAD_IN" index="2" function="13" pad="PA06" ioset="4"/>
              <signal group="PAD_IN" index="2" function="14" pad="PA10" ioset="4"/>
              <signal group="PAD_IN" index="2" function="15" pad="PB07" ioset="4"/>
              <signal group="PAD_IN" index="2" function="16" pad="PB11" ioset="4"/>
              <signal group="PAD_IN" index="2" function="17" pad="PA01" ioset="4"/>
              <signal group="PAD_IN" index="2" function="18" pad="PA05" ioset="4"/>
              <signal group="PAD_IN" index="2" function="19" pad="PA13" ioset="4"/>
              <signal group="PAD_IN" index="2" function="20" pad="PB02" ioset="4"/>
              <signal group="PAD_IN" index="2" function="21" pad="PB06" ioset="4"/>
              <signal group="PAD_IN" index="2" function="22" pad="PB10" ioset="4"/>
              <signal group="PAD_IN" index="2" function="23" pad="PA08" ioset="4"/>
              <signal group="PAD_IN" index="2" function="24" pad="PA02" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PA00" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PA01" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PA02" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PA03" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PA05" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PA06" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PA08" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PA09" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PA10" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PA13" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PA14" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PB02" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PB03" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PB04" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PB06" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PB07" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PB10" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PB11" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PC09" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PD07" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="6" pad="PE03" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA00" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA01" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA02" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA03" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA05" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA06" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA08" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA09" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA10" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA13" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA14" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PB02" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PB03" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PB04" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PB06" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PB07" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PB10" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PB11" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PC09" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PD07" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PE03" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="3" pad="PA01" ioset="5"/>
              <signal group="PAD_OUT" index="0" function="3" pad="PA04" ioset="5"/>
              <signal group="PAD_OUT" index="0" function="3" pad="PA10" ioset="5"/>
              <signal group="PAD_OUT" index="0" function="3" pad="PB00" ioset="5"/>
              <signal group="PAD_OUT" index="0" function="3" pad="PB04" ioset="5"/>
              <signal group="PAD_OUT" index="0" function="3" pad="PB10" ioset="5"/>
              <signal group="PAD_OUT" index="0" function="3" pad="PB15" ioset="5"/>
              <signal group="PAD_OUT" index="0" function="3" pad="PC10" ioset="5"/>
              <signal group="PAD_OUT" index="0" function="3" pad="PD00" ioset="5"/>
              <signal group="PAD_OUT" index="0" function="3" pad="PD02" ioset="5"/>
              <signal group="PAD_OUT" index="0" function="3" pad="PE02" ioset="5"/>
              <signal group="PAD_IN" index="1" function="1" pad="PA05" ioset="6"/>
              <signal group="PAD_IN" index="1" function="2" pad="PB05" ioset="6"/>
              <signal group="PAD_IN" index="1" function="3" pad="PB09" ioset="6"/>
              <signal group="PAD_IN" index="1" function="5" pad="PE05" ioset="6"/>
              <signal group="PAD_IN" index="1" function="6" pad="PA03" ioset="6"/>
              <signal group="PAD_IN" index="1" function="7" pad="PA06" ioset="6"/>
              <signal group="PAD_IN" index="1" function="8" pad="PA07" ioset="6"/>
              <signal group="PAD_IN" index="1" function="9" pad="PB06" ioset="6"/>
              <signal group="PAD_IN" index="1" function="10" pad="PB08" ioset="6"/>
              <signal group="PAD_OUT" index="1" function="3" pad="PA03" ioset="6"/>
              <signal group="PAD_OUT" index="1" function="3" pad="PA05" ioset="6"/>
              <signal group="PAD_OUT" index="1" function="3" pad="PA06" ioset="6"/>
              <signal group="PAD_OUT" index="1" function="3" pad="PA07" ioset="6"/>
              <signal group="PAD_OUT" index="1" function="3" pad="PB05" ioset="6"/>
              <signal group="PAD_OUT" index="1" function="3" pad="PB06" ioset="6"/>
              <signal group="PAD_OUT" index="1" function="3" pad="PB08" ioset="6"/>
              <signal group="PAD_OUT" index="1" function="3" pad="PB09" ioset="6"/>
              <signal group="PAD_OUT" index="1" function="3" pad="PE05" ioset="6"/>
