zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
            </signals>
            <parameters>
              <param name="GCLK_ID_SLOW" value="4"/>
              <param name="GCLK_ID_CORE" value="4"/>
              <param name="DMAC_ID_RX" value="8"/>
              <param name="DMAC_ID_TX" value="9"/>
              <param name="CHIP_SERCOM_PADDR_MSB" value="9"/>
              <param name="CHIP_SERCOM_CLK_REDUCTION" value="1"/>
              <param name="CHIP_SERCOM_DMA" value="1"/>
              <param name="CHIP_SERCOM_FIFO_DEPTH_POWER" value="1"/>
              <param name="CHIP_SERCOM_RETENTION_SUPPORT" value="0"/>
              <param name="CHIP_SERCOM_SPI" value="1"/>
              <param name="CHIP_SERCOM_SPI_HW_SS_CTRL" value="1"/>
              <param name="CHIP_SERCOM_SPI_ICSPACE_EXT" value="1"/>
              <param name="CHIP_SERCOM_SPI_OZMO" value="0"/>
              <param name="CHIP_SERCOM_SPI_WAKE_ON_SSL" value="1"/>
              <param name="CHIP_SERCOM_TTBIT_EXTENSION" value="1"/>
              <param name="CHIP_SERCOM_TWIM" value="1"/>
              <param name="CHIP_SERCOM_TWIS" value="1"/>
              <param name="CHIP_SERCOM_TWIS_AUTO_ACK" value="1"/>
              <param name="CHIP_SERCOM_TWIS_GROUP_CMD" value="1"/>
              <param name="CHIP_SERCOM_TWIS_SDASETUP_CNT_SIZE" value="8"/>
              <param name="CHIP_SERCOM_TWIS_SDASETUP_SIZE" value="4"/>
              <param name="CHIP_SERCOM_TWIS_SUDAT" value="1"/>
              <param name="CHIP_SERCOM_TWI_FASTMP" value="1"/>
              <param name="CHIP_SERCOM_TWI_HSMODE" value="1"/>
              <param name="CHIP_SERCOM_TWI_SCLSM_MODE" value="1"/>
              <param name="CHIP_SERCOM_TWI_SMB_TIMEOUTS" value="1"/>
              <param name="CHIP_SERCOM_TWI_TENBIT_ADR" value="1"/>
              <param name="CHIP_SERCOM_USART" value="1"/>
              <param name="CHIP_SERCOM_USART_AUTOBAUD" value="1"/>
              <param name="CHIP_SERCOM_USART_COLDET" value="1"/>
              <param name="CHIP_SERCOM_USART_FLOW_CTRL" value="1"/>
              <param name="CHIP_SERCOM_USART_FRAC_BAUD" value="1"/>
              <param name="CHIP_SERCOM_USART_IRDA" value="1"/>
              <param name="CHIP_SERCOM_USART_ISO7816" value="1"/>
              <param name="CHIP_SERCOM_USART_LIN_MASTER" value="1"/>
              <param name="CHIP_SERCOM_USART_RS485" value="1"/>
              <param name="CHIP_SERCOM_USART_SAMPA_EXT" value="1"/>
              <param name="CHIP_SERCOM_USART_SAMPR_EXT" value="1"/>
              <param name="CHIP_SERCOM_DLY_COMPENSATION" value="1"/>
              <param name="CHIP_SERCOM_SE_CNT" value="1"/>
              <param name="INSTANCE_ID" value="96" caption="Instance index for SERCOM2"/>
              <param name="PAC_ID" value="96" caption="Index for SERCOM2 registers write protection"/>
            </parameters>
          </instance>
          <instance name="SERCOM3">
            <register-group name="SERCOM3" name-in-module="SERCOM" address-space="base" offset="0x46000400"/>
            <signals>
              <signal group="PAD_IN" index="0" function="1" pad="PA02" ioset="3"/>
              <signal group="PAD_IN" index="0" function="2" pad="PA08" ioset="3"/>
              <signal group="PAD_IN" index="0" function="3" pad="PA13" ioset="3"/>
              <signal group="PAD_IN" index="0" function="4" pad="PB02" ioset="3"/>
              <signal group="PAD_IN" index="0" function="5" pad="PB08" ioset="3"/>
              <signal group="PAD_IN" index="0" function="6" pad="PB13" ioset="3"/>
              <signal group="PAD_IN" index="0" function="8" pad="PD02" ioset="3"/>
              <signal group="PAD_IN" index="0" function="10" pad="PA04" ioset="3"/>
              <signal group="PAD_IN" index="0" function="11" pad="PB03" ioset="3"/>
              <signal group="PAD_IN" index="0" function="13" pad="PD06" ioset="3"/>
              <signal group="PAD_IN" index="0" function="15" pad="PA05" ioset="3"/>
              <signal group="PAD_IN" index="0" function="16" pad="PA09" ioset="3"/>
              <signal group="PAD_IN" index="0" function="17" pad="PB06" ioset="3"/>
              <signal group="PAD_IN" index="0" function="18" pad="PB10" ioset="3"/>
              <signal group="PAD_IN" index="0" function="19" pad="PA00" ioset="3"/>
              <signal group="PAD_IN" index="0" function="20" pad="PB01" ioset="3"/>
              <signal group="PAD_IN" index="0" function="21" pad="PB05" ioset="3"/>
              <signal group="PAD_IN" index="0" function="22" pad="PB09" ioset="3"/>
              <signal group="PAD_IN" index="0" function="23" pad="PA01" ioset="3"/>
              <signal group="PAD_IN" index="0" function="24" pad="PA12" ioset="3"/>
              <signal group="PAD_IN" index="1" function="0" pad="PA05" ioset="6"/>
              <signal group="PAD_IN" index="1" function="1" pad="PB05" ioset="6"/>
              <signal group="PAD_IN" index="1" function="2" pad="PB09" ioset="6"/>
              <signal group="PAD_IN" index="1" function="4" pad="PE05" ioset="6"/>
              <signal group="PAD_IN" index="1" function="5" pad="PA03" ioset="6"/>
              <signal group="PAD_IN" index="1" function="6" pad="PA06" ioset="6"/>
              <signal group="PAD_IN" index="1" function="7" pad="PA07" ioset="6"/>
              <signal group="PAD_IN" index="1" function="8" pad="PB06" ioset="6"/>
              <signal group="PAD_IN" index="1" function="9" pad="PB08" ioset="6"/>
              <signal group="PAD_IN" index="2" function="1" pad="PA00" ioset="1"/>
              <signal group="PAD_IN" index="2" function="2" pad="PA06" ioset="1"/>
              <signal group="PAD_IN" index="2" function="3" pad="PA11" ioset="1"/>
              <signal group="PAD_IN" index="2" function="4" pad="PB00" ioset="1"/>
              <signal group="PAD_IN" index="2" function="5" pad="PB06" ioset="1"/>
              <signal group="PAD_IN" index="2" function="6" pad="PB11" ioset="1"/>
              <signal group="PAD_IN" index="2" function="8" pad="PD06" ioset="1"/>
              <signal group="PAD_IN" index="2" function="10" pad="PE06" ioset="1"/>
              <signal group="PAD_IN" index="2" function="11" pad="PB01" ioset="1"/>
              <signal group="PAD_IN" index="2" function="13" pad="PD03" ioset="1"/>
              <signal group="PAD_IN" index="2" function="15" pad="PA03" ioset="1"/>
              <signal group="PAD_IN" index="2" function="16" pad="PA07" ioset="1"/>
              <signal group="PAD_IN" index="2" function="17" pad="PB04" ioset="1"/>
              <signal group="PAD_IN" index="2" function="18" pad="PB08" ioset="1"/>
              <signal group="PAD_IN" index="2" function="19" pad="PB12" ioset="1"/>
              <signal group="PAD_IN" index="2" function="20" pad="PA02" ioset="1"/>
              <signal group="PAD_IN" index="2" function="21" pad="PA10" ioset="1"/>
              <signal group="PAD_IN" index="2" function="22" pad="PA14" ioset="1"/>
              <signal group="PAD_IN" index="2" function="23" pad="PB03" ioset="1"/>
              <signal group="PAD_IN" index="2" function="24" pad="PB07" ioset="1"/>
              <signal group="PAD_IN" index="2" function="25" pad="PA09" ioset="1"/>
              <signal group="PAD_IN" index="3" function="1" pad="PA01" ioset="2"/>
              <signal group="PAD_IN" index="3" function="2" pad="PA07" ioset="2"/>
              <signal group="PAD_IN" index="3" function="3" pad="PA12" ioset="2"/>
              <signal group="PAD_IN" index="3" function="4" pad="PB01" ioset="2"/>
              <signal group="PAD_IN" index="3" function="5" pad="PB07" ioset="2"/>
              <signal group="PAD_IN" index="3" function="7" pad="PC07" ioset="2"/>
              <signal group="PAD_IN" index="3" function="9" pad="PE01" ioset="2"/>
              <signal group="PAD_IN" index="3" function="10" pad="PA03" ioset="2"/>
              <signal group="PAD_IN" index="3" function="11" pad="PB02" ioset="2"/>
              <signal group="PAD_IN" index="3" function="13" pad="PD04" ioset="2"/>
              <signal group="PAD_IN" index="3" function="15" pad="PA04" ioset="2"/>
              <signal group="PAD_IN" index="3" function="16" pad="PA08" ioset="2"/>
              <signal group="PAD_IN" index="3" function="17" pad="PB12" ioset="2"/>
              <signal group="PAD_IN" index="3" function="18" pad="PB05" ioset="2"/>
              <signal group="PAD_IN" index="3" function="19" pad="PB09" ioset="2"/>
              <signal group="PAD_IN" index="3" function="20" pad="PB13" ioset="2"/>
              <signal group="PAD_IN" index="3" function="21" pad="PB00" ioset="2"/>
              <signal group="PAD_IN" index="3" function="22" pad="PB04" ioset="2"/>
              <signal group="PAD_IN" index="3" function="23" pad="PB08" ioset="2"/>
              <signal group="PAD_IN" index="3" function="24" pad="PA00" ioset="2"/>
              <signal group="PAD_IN" index="3" function="25" pad="PA11" ioset="2"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA00" ioset="1"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA02" ioset="1"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA03" ioset="1"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA06" ioset="1"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA07" ioset="1"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA09" ioset="1"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA10" ioset="1"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA11" ioset="1"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PA14" ioset="1"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PB00" ioset="1"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PB01" ioset="1"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PB03" ioset="1"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PB04" ioset="1"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PB06" ioset="1"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PB07" ioset="1"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PB08" ioset="1"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PB11" ioset="1"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PB12" ioset="1"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PC09" ioset="1"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PD06" ioset="1"/>
              <signal group="PAD_OUT" index="0" function="7" pad="PE04" ioset="1"/>
              <signal group="PAD_OUT" index="0" function="10" pad="PA00" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="10" pad="PA01" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="10" pad="PA02" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="10" pad="PA04" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="10" pad="PA05" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="10" pad="PA08" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="10" pad="PA09" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="10" pad="PA12" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="10" pad="PA13" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="10" pad="PB01" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="10" pad="PB02" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="10" pad="PB03" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="10" pad="PB05" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="10" pad="PB06" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="10" pad="PB08" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="10" pad="PB09" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="10" pad="PB10" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="10" pad="PB13" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="10" pad="PC08" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="10" pad="PD06" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="10" pad="PE02" ioset="3"/>
              <signal group="PAD_OUT" index="0" function="9" pad="PA00" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="9" pad="PA01" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="9" pad="PA02" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="9" pad="PA03" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="9" pad="PA05" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="9" pad="PA06" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="9" pad="PA08" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="9" pad="PA09" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="9" pad="PA10" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="9" pad="PA13" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="9" pad="PA14" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="9" pad="PB02" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="9" pad="PB03" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="9" pad="PB04" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="9" pad="PB06" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="9" pad="PB07" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="9" pad="PB10" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="9" pad="PB11" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="9" pad="PC09" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="9" pad="PD07" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="9" pad="PE03" ioset="4"/>
              <signal group="PAD_OUT" index="1" function="4" pad="PA03" ioset="6"/>
              <signal group="PAD_OUT" index="1" function="4" pad="PA05" ioset="6"/>
              <signal group="PAD_OUT" index="1" function="4" pad="PA06" ioset="6"/>
              <signal group="PAD_OUT" index="1" function="4" pad="PA07" ioset="6"/>
              <signal group="PAD_OUT" index="1" function="4" pad="PB05" ioset="6"/>
              <signal group="PAD_OUT" index="1" function="4" pad="PB06" ioset="6"/>
              <signal group="PAD_OUT" index="1" function="4" pad="PB08" ioset="6"/>
              <signal group="PAD_OUT" index="1" function="4" pad="PB09" ioset="6"/>
              <signal group="PAD_OUT" index="1" function="4" pad="PE05" ioset="6"/>
              <signal group="PAD_OUT" index="2" function="8" pad="PA00" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="8" pad="PA02" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="8" pad="PA03" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="8" pad="PA06" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="8" pad="PA07" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="8" pad="PA09" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="8" pad="PA10" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="8" pad="PA11" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="8" pad="PA14" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="8" pad="PB00" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="8" pad="PB01" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="8" pad="PB03" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="8" pad="PB04" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="8" pad="PB06" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="8" pad="PB07" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="8" pad="PB08" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="8" pad="PB11" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="8" pad="PB12" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="8" pad="PC09" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="8" pad="PD06" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="8" pad="PE04" ioset="1"/>
              <signal group="PAD_OUT" index="2" function="11" pad="PA00" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="11" pad="PA01" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="11" pad="PA03" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="11" pad="PA04" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="11" pad="PA07" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="11" pad="PA08" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="11" pad="PA11" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="11" pad="PA12" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="11" pad="PB00" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="11" pad="PB01" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="11" pad="PB02" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="11" pad="PB04" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="11" pad="PB05" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="11" pad="PB07" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="11" pad="PB08" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="11" pad="PB09" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="11" pad="PB12" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="11" pad="PB13" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="11" pad="PC01" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="11" pad="PD04" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="11" pad="PE01" ioset="2"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PA00" ioset="3"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PA01" ioset="3"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PA02" ioset="3"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PA04" ioset="3"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PA05" ioset="3"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PA08" ioset="3"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PA09" ioset="3"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PA12" ioset="3"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PA13" ioset="3"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PB01" ioset="3"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PB02" ioset="3"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PB03" ioset="3"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PB05" ioset="3"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PB06" ioset="3"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PB08" ioset="3"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PB09" ioset="3"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PB10" ioset="3"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PB13" ioset="3"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PC08" ioset="3"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PD06" ioset="3"/>
              <signal group="PAD_OUT" index="2" function="9" pad="PE02" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="10" pad="PA00" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="10" pad="PA01" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="10" pad="PA03" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="10" pad="PA04" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="10" pad="PA07" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="10" pad="PA08" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="10" pad="PA11" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="10" pad="PA12" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="10" pad="PB00" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="10" pad="PB01" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="10" pad="PB02" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="10" pad="PB04" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="10" pad="PB05" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="10" pad="PB07" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="10" pad="PB08" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="10" pad="PB09" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="10" pad="PB12" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="10" pad="PB13" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="10" pad="PC01" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="10" pad="PD04" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="10" pad="PE01" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="11" pad="PA00" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="11" pad="PA01" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="11" pad="PA02" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="11" pad="PA04" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="11" pad="PA05" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="11" pad="PA08" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="11" pad="PA09" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="11" pad="PA12" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="11" pad="PA13" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="11" pad="PB01" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="11" pad="PB02" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="11" pad="PB03" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="11" pad="PB05" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="11" pad="PB06" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="11" pad="PB08" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="11" pad="PB09" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="11" pad="PB10" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="11" pad="PB13" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="11" pad="PC08" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="11" pad="PD06" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="11" pad="PE02" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PA00" ioset="4"/>
