zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
              <signal group="PAD_OUT" index="3" function="8" pad="PA01" ioset="4"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PA02" ioset="4"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PA03" ioset="4"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PA05" ioset="4"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PA06" ioset="4"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PA08" ioset="4"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PA09" ioset="4"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PA10" ioset="4"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PA13" ioset="4"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PA14" ioset="4"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PB02" ioset="4"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PB03" ioset="4"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PB04" ioset="4"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PB06" ioset="4"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PB07" ioset="4"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PB10" ioset="4"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PB11" ioset="4"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PC09" ioset="4"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PD07" ioset="4"/>
              <signal group="PAD_OUT" index="3" function="8" pad="PE03" ioset="4"/>
            </signals>
            <parameters>
              <param name="GCLK_ID_SLOW" value="5"/>
              <param name="GCLK_ID_CORE" value="5"/>
              <param name="DMAC_ID_RX" value="10"/>
              <param name="DMAC_ID_TX" value="11"/>
              <param name="CHIP_SERCOM_PADDR_MSB" value="9"/>
              <param name="CHIP_SERCOM_CLK_REDUCTION" value="1"/>
              <param name="CHIP_SERCOM_DMA" value="1"/>
              <param name="CHIP_SERCOM_FIFO_DEPTH_POWER" value="1"/>
              <param name="CHIP_SERCOM_RETENTION_SUPPORT" value="0"/>
              <param name="CHIP_SERCOM_SPI" value="1"/>
              <param name="CHIP_SERCOM_SPI_HW_SS_CTRL" value="1"/>
              <param name="CHIP_SERCOM_SPI_ICSPACE_EXT" value="1"/>
              <param name="CHIP_SERCOM_SPI_OZMO" value="0"/>
              <param name="CHIP_SERCOM_SPI_WAKE_ON_SSL" value="1"/>
              <param name="CHIP_SERCOM_TTBIT_EXTENSION" value="1"/>
              <param name="CHIP_SERCOM_TWIM" value="0"/>
              <param name="CHIP_SERCOM_TWIS" value="0"/>
              <param name="CHIP_SERCOM_USART" value="1"/>
              <param name="CHIP_SERCOM_USART_AUTOBAUD" value="1"/>
              <param name="CHIP_SERCOM_USART_COLDET" value="1"/>
              <param name="CHIP_SERCOM_USART_FLOW_CTRL" value="1"/>
              <param name="CHIP_SERCOM_USART_FRAC_BAUD" value="1"/>
              <param name="CHIP_SERCOM_USART_IRDA" value="1"/>
              <param name="CHIP_SERCOM_USART_ISO7816" value="1"/>
              <param name="CHIP_SERCOM_USART_LIN_MASTER" value="1"/>
              <param name="CHIP_SERCOM_USART_RS485" value="1"/>
              <param name="CHIP_SERCOM_USART_SAMPA_EXT" value="1"/>
              <param name="CHIP_SERCOM_USART_SAMPR_EXT" value="1"/>
              <param name="CHIP_SERCOM_DLY_COMPENSATION" value="1"/>
              <param name="CHIP_SERCOM_SE_CNT" value="1"/>
              <param name="INSTANCE_ID" value="97" caption="Instance index for SERCOM3"/>
              <param name="PAC_ID" value="97" caption="Index for SERCOM3 registers write protection"/>
            </parameters>
          </instance>
          <instance name="SERCOM4">
            <register-group name="SERCOM4" name-in-module="SERCOM" address-space="base" offset="0x46000800"/>
            <parameters>
              <param name="GCLK_ID_SLOW" value="5"/>
              <param name="GCLK_ID_CORE" value="5"/>
              <param name="INSTANCE_ID" value="98" caption="Instance index for SERCOM4"/>
              <param name="PAC_ID" value="98" caption="Index for SERCOM4 registers write protection"/>
            </parameters>
          </instance>
          <instance name="SERCOM5">
            <register-group name="SERCOM5" name-in-module="SERCOM" address-space="base" offset="0x46000C00"/>
            <parameters>
              <param name="GCLK_ID_SLOW" value="5"/>
              <param name="GCLK_ID_CORE" value="5"/>
              <param name="INSTANCE_ID" value="99" caption="Instance index for SERCOM5"/>
              <param name="PAC_ID" value="99" caption="Index for SERCOM5 registers write protection"/>
            </parameters>
          </instance>
          <instance name="SERCOM6">
            <register-group name="SERCOM6" name-in-module="SERCOM" address-space="base" offset="0x42000400"/>
            <signals>
              <signal group="I2C_SERCOM_PAD" index="0" function="I2C" pad="PA13"/>
              <signal group="I2C_SERCOM_PAD" index="1" function="I2C" pad="PA14"/>
            </signals>
            <parameters>
              <param name="GCLK_ID_SLOW" value="3"/>
              <param name="GCLK_ID_CORE" value="3"/>
              <param name="DMAC_ID_RX" value="16"/>
              <param name="DMAC_ID_TX" value="17"/>
              <param name="CHIP_SERCOM_PADDR_MSB" value="9"/>
              <param name="CHIP_SERCOM_CLK_REDUCTION" value="1"/>
              <param name="CHIP_SERCOM_DMA" value="1"/>
              <param name="CHIP_SERCOM_FIFO_DEPTH_POWER" value="1"/>
              <param name="CHIP_SERCOM_RETENTION_SUPPORT" value="0"/>
              <param name="CHIP_SERCOM_SPI" value="0"/>
              <param name="CHIP_SERCOM_SPI_HW_SS_CTRL" value="0"/>
              <param name="CHIP_SERCOM_SPI_ICSPACE_EXT" value="0"/>
              <param name="CHIP_SERCOM_SPI_OZMO" value="0"/>
              <param name="CHIP_SERCOM_SPI_WAKE_ON_SSL" value="0"/>
              <param name="CHIP_SERCOM_TTBIT_EXTENSION" value="1"/>
              <param name="CHIP_SERCOM_TWIM" value="1"/>
              <param name="CHIP_SERCOM_TWIS" value="1"/>
              <param name="CHIP_SERCOM_TWIS_AUTO_ACK" value="1"/>
              <param name="CHIP_SERCOM_TWIS_GROUP_CMD" value="1"/>
              <param name="CHIP_SERCOM_TWIS_SDASETUP_CNT_SIZE" value="8"/>
              <param name="CHIP_SERCOM_TWIS_SDASETUP_SIZE" value="4"/>
              <param name="CHIP_SERCOM_TWIS_SUDAT" value="1"/>
              <param name="CHIP_SERCOM_TWI_FASTMP" value="1"/>
              <param name="CHIP_SERCOM_TWI_HSMODE" value="1"/>
              <param name="CHIP_SERCOM_TWI_SCLSM_MODE" value="1"/>
              <param name="CHIP_SERCOM_TWI_SMB_TIMEOUTS" value="1"/>
              <param name="CHIP_SERCOM_TWI_TENBIT_ADR" value="1"/>
              <param name="CHIP_SERCOM_USART" value="0"/>
              <param name="CHIP_SERCOM_USART_AUTOBAUD" value="0"/>
              <param name="CHIP_SERCOM_USART_COLDET" value="0"/>
              <param name="CHIP_SERCOM_USART_FLOW_CTRL" value="0"/>
              <param name="CHIP_SERCOM_USART_FRAC_BAUD" value="0"/>
              <param name="CHIP_SERCOM_USART_IRDA" value="0"/>
              <param name="CHIP_SERCOM_USART_ISO7816" value="0"/>
              <param name="CHIP_SERCOM_USART_LIN_MASTER" value="0"/>
              <param name="CHIP_SERCOM_USART_RS485" value="0"/>
              <param name="CHIP_SERCOM_USART_SAMPA_EXT" value="0"/>
              <param name="CHIP_SERCOM_USART_SAMPR_EXT" value="0"/>
              <param name="CHIP_SERCOM_DLY_COMPENSATION" value="1"/>
              <param name="CHIP_SERCOM_SE_CNT" value="1"/>
              <param name="INSTANCE_ID" value="65" caption="Instance index for SERCOM6"/>
              <param name="PAC_ID" value="65" caption="Index for SERCOM6 registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="CRYPTO" id="barco_crypto_ba457" name2="barco_crypto_ba457" version="1.0.0">
          <instance name="CRYPTO">
            <register-group name="CRYPTO" name-in-module="CRYPTO" address-space="base" offset="0x43000000"/>
