zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
            <signals>
              <signal group="WO_OUT" index="0" function="33" pad="PA00" ioset="2"/>
              <signal group="WO_OUT" index="0" function="33" pad="PA01" ioset="2"/>
              <signal group="WO_OUT" index="0" function="33" pad="PA03" ioset="2"/>
              <signal group="WO_OUT" index="0" function="33" pad="PA04" ioset="2"/>
              <signal group="WO_OUT" index="0" function="33" pad="PA07" ioset="2"/>
              <signal group="WO_OUT" index="0" function="33" pad="PA08" ioset="2"/>
              <signal group="WO_OUT" index="0" function="33" pad="PA11" ioset="2"/>
              <signal group="WO_OUT" index="0" function="33" pad="PA12" ioset="2"/>
              <signal group="WO_OUT" index="0" function="33" pad="PB00" ioset="2"/>
              <signal group="WO_OUT" index="0" function="33" pad="PB01" ioset="2"/>
              <signal group="WO_OUT" index="0" function="33" pad="PB02" ioset="2"/>
              <signal group="WO_OUT" index="0" function="33" pad="PB04" ioset="2"/>
              <signal group="WO_OUT" index="0" function="33" pad="PB05" ioset="2"/>
              <signal group="WO_OUT" index="0" function="33" pad="PB07" ioset="2"/>
              <signal group="WO_OUT" index="0" function="33" pad="PB08" ioset="2"/>
              <signal group="WO_OUT" index="0" function="33" pad="PB09" ioset="2"/>
              <signal group="WO_OUT" index="0" function="33" pad="PB12" ioset="2"/>
              <signal group="WO_OUT" index="0" function="33" pad="PB13" ioset="2"/>
              <signal group="WO_OUT" index="0" function="33" pad="PC01" ioset="2"/>
              <signal group="WO_OUT" index="0" function="33" pad="PD04" ioset="2"/>
              <signal group="WO_OUT" index="0" function="33" pad="PE01" ioset="2"/>
              <signal group="WO_OUT" index="0" function="29" pad="PA00" ioset="4"/>
              <signal group="WO_OUT" index="0" function="29" pad="PA01" ioset="4"/>
              <signal group="WO_OUT" index="0" function="29" pad="PA02" ioset="4"/>
              <signal group="WO_OUT" index="0" function="29" pad="PA03" ioset="4"/>
              <signal group="WO_OUT" index="0" function="29" pad="PA05" ioset="4"/>
              <signal group="WO_OUT" index="0" function="29" pad="PA06" ioset="4"/>
              <signal group="WO_OUT" index="0" function="29" pad="PA08" ioset="4"/>
              <signal group="WO_OUT" index="0" function="29" pad="PA09" ioset="4"/>
              <signal group="WO_OUT" index="0" function="29" pad="PA10" ioset="4"/>
              <signal group="WO_OUT" index="0" function="29" pad="PA13" ioset="4"/>
              <signal group="WO_OUT" index="0" function="29" pad="PA14" ioset="4"/>
              <signal group="WO_OUT" index="0" function="29" pad="PB02" ioset="4"/>
              <signal group="WO_OUT" index="0" function="29" pad="PB03" ioset="4"/>
              <signal group="WO_OUT" index="0" function="29" pad="PB04" ioset="4"/>
              <signal group="WO_OUT" index="0" function="29" pad="PB06" ioset="4"/>
              <signal group="WO_OUT" index="0" function="29" pad="PB07" ioset="4"/>
              <signal group="WO_OUT" index="0" function="29" pad="PB10" ioset="4"/>
              <signal group="WO_OUT" index="0" function="29" pad="PB11" ioset="4"/>
              <signal group="WO_OUT" index="0" function="29" pad="PC09" ioset="4"/>
              <signal group="WO_OUT" index="0" function="29" pad="PD07" ioset="4"/>
              <signal group="WO_OUT" index="0" function="29" pad="PE03" ioset="4"/>
              <signal group="WO_OUT" index="1" function="33" pad="PA00" ioset="3"/>
              <signal group="WO_OUT" index="1" function="33" pad="PA01" ioset="3"/>
              <signal group="WO_OUT" index="1" function="33" pad="PA02" ioset="3"/>
              <signal group="WO_OUT" index="1" function="33" pad="PA04" ioset="3"/>
              <signal group="WO_OUT" index="1" function="33" pad="PA05" ioset="3"/>
              <signal group="WO_OUT" index="1" function="33" pad="PA08" ioset="3"/>
              <signal group="WO_OUT" index="1" function="33" pad="PA09" ioset="3"/>
              <signal group="WO_OUT" index="1" function="33" pad="PA12" ioset="3"/>
              <signal group="WO_OUT" index="1" function="33" pad="PA13" ioset="3"/>
              <signal group="WO_OUT" index="1" function="33" pad="PB01" ioset="3"/>
              <signal group="WO_OUT" index="1" function="33" pad="PB02" ioset="3"/>
              <signal group="WO_OUT" index="1" function="33" pad="PB03" ioset="3"/>
              <signal group="WO_OUT" index="1" function="33" pad="PB05" ioset="3"/>
              <signal group="WO_OUT" index="1" function="33" pad="PB06" ioset="3"/>
              <signal group="WO_OUT" index="1" function="33" pad="PB08" ioset="3"/>
              <signal group="WO_OUT" index="1" function="33" pad="PB09" ioset="3"/>
              <signal group="WO_OUT" index="1" function="33" pad="PB10" ioset="3"/>
              <signal group="WO_OUT" index="1" function="33" pad="PB13" ioset="3"/>
              <signal group="WO_OUT" index="1" function="33" pad="PC08" ioset="3"/>
              <signal group="WO_OUT" index="1" function="33" pad="PD06" ioset="3"/>
              <signal group="WO_OUT" index="1" function="33" pad="PE02" ioset="3"/>
              <signal group="WO_OUT" index="1" function="11" pad="PA01" ioset="5"/>
              <signal group="WO_OUT" index="1" function="11" pad="PA04" ioset="5"/>
              <signal group="WO_OUT" index="1" function="11" pad="PA10" ioset="5"/>
              <signal group="WO_OUT" index="1" function="11" pad="PB00" ioset="5"/>
              <signal group="WO_OUT" index="1" function="11" pad="PB04" ioset="5"/>
              <signal group="WO_OUT" index="1" function="11" pad="PB10" ioset="5"/>
              <signal group="WO_OUT" index="1" function="11" pad="PB15" ioset="5"/>
              <signal group="WO_OUT" index="1" function="11" pad="PC10" ioset="5"/>
              <signal group="WO_OUT" index="1" function="11" pad="PD00" ioset="5"/>
              <signal group="WO_OUT" index="1" function="11" pad="PD02" ioset="5"/>
              <signal group="WO_OUT" index="1" function="11" pad="PE02" ioset="5"/>
              <signal group="WO_IN" index="0" function="1" pad="PA01" ioset="2"/>
              <signal group="WO_IN" index="0" function="2" pad="PA07" ioset="2"/>
              <signal group="WO_IN" index="0" function="3" pad="PA12" ioset="2"/>
              <signal group="WO_IN" index="0" function="4" pad="PB01" ioset="2"/>
              <signal group="WO_IN" index="0" function="5" pad="PB07" ioset="2"/>
              <signal group="WO_IN" index="0" function="7" pad="PC07" ioset="2"/>
              <signal group="WO_IN" index="0" function="9" pad="PE01" ioset="2"/>
              <signal group="WO_IN" index="0" function="10" pad="PA03" ioset="2"/>
              <signal group="WO_IN" index="0" function="11" pad="PB02" ioset="2"/>
              <signal group="WO_IN" index="0" function="13" pad="PD04" ioset="2"/>
              <signal group="WO_IN" index="0" function="15" pad="PA04" ioset="2"/>
              <signal group="WO_IN" index="0" function="16" pad="PA08" ioset="2"/>
              <signal group="WO_IN" index="0" function="17" pad="PB12" ioset="2"/>
              <signal group="WO_IN" index="0" function="18" pad="PB05" ioset="2"/>
              <signal group="WO_IN" index="0" function="19" pad="PB09" ioset="2"/>
              <signal group="WO_IN" index="0" function="20" pad="PB13" ioset="2"/>
              <signal group="WO_IN" index="0" function="21" pad="PB00" ioset="2"/>
              <signal group="WO_IN" index="0" function="22" pad="PB04" ioset="2"/>
              <signal group="WO_IN" index="0" function="23" pad="PB08" ioset="2"/>
              <signal group="WO_IN" index="0" function="24" pad="PA00" ioset="2"/>
              <signal group="WO_IN" index="0" function="25" pad="PA11" ioset="2"/>
              <signal group="WO_IN" index="0" function="1" pad="PA03" ioset="4"/>
              <signal group="WO_IN" index="0" function="2" pad="PA09" ioset="4"/>
              <signal group="WO_IN" index="0" function="3" pad="PA14" ioset="4"/>
              <signal group="WO_IN" index="0" function="4" pad="PB03" ioset="4"/>
              <signal group="WO_IN" index="0" function="6" pad="PD03" ioset="4"/>
              <signal group="WO_IN" index="0" function="8" pad="PA00" ioset="4"/>
              <signal group="WO_IN" index="0" function="9" pad="PB04" ioset="4"/>
              <signal group="WO_IN" index="0" function="11" pad="PD07" ioset="4"/>
              <signal group="WO_IN" index="0" function="13" pad="PA06" ioset="4"/>
              <signal group="WO_IN" index="0" function="14" pad="PA10" ioset="4"/>
              <signal group="WO_IN" index="0" function="15" pad="PB07" ioset="4"/>
              <signal group="WO_IN" index="0" function="16" pad="PB11" ioset="4"/>
              <signal group="WO_IN" index="0" function="17" pad="PA01" ioset="4"/>
              <signal group="WO_IN" index="0" function="18" pad="PA05" ioset="4"/>
              <signal group="WO_IN" index="0" function="19" pad="PA13" ioset="4"/>
              <signal group="WO_IN" index="0" function="20" pad="PB02" ioset="4"/>
              <signal group="WO_IN" index="0" function="21" pad="PB06" ioset="4"/>
              <signal group="WO_IN" index="0" function="22" pad="PB10" ioset="4"/>
              <signal group="WO_IN" index="0" function="23" pad="PA08" ioset="4"/>
              <signal group="WO_IN" index="0" function="24" pad="PA02" ioset="4"/>
              <signal group="WO_IN" index="1" function="1" pad="PA02" ioset="3"/>
              <signal group="WO_IN" index="1" function="2" pad="PA08" ioset="3"/>
              <signal group="WO_IN" index="1" function="3" pad="PA13" ioset="3"/>
              <signal group="WO_IN" index="1" function="4" pad="PB02" ioset="3"/>
              <signal group="WO_IN" index="1" function="5" pad="PB08" ioset="3"/>
              <signal group="WO_IN" index="1" function="6" pad="PB13" ioset="3"/>
              <signal group="WO_IN" index="1" function="8" pad="PD02" ioset="3"/>
              <signal group="WO_IN" index="1" function="10" pad="PA04" ioset="3"/>
              <signal group="WO_IN" index="1" function="11" pad="PB03" ioset="3"/>
              <signal group="WO_IN" index="1" function="13" pad="PD06" ioset="3"/>
              <signal group="WO_IN" index="1" function="15" pad="PA05" ioset="3"/>
              <signal group="WO_IN" index="1" function="16" pad="PA09" ioset="3"/>
              <signal group="WO_IN" index="1" function="17" pad="PB06" ioset="3"/>
              <signal group="WO_IN" index="1" function="18" pad="PB10" ioset="3"/>
              <signal group="WO_IN" index="1" function="19" pad="PA00" ioset="3"/>
              <signal group="WO_IN" index="1" function="20" pad="PB01" ioset="3"/>
              <signal group="WO_IN" index="1" function="21" pad="PB05" ioset="3"/>
              <signal group="WO_IN" index="1" function="22" pad="PB09" ioset="3"/>
              <signal group="WO_IN" index="1" function="23" pad="PA01" ioset="3"/>
              <signal group="WO_IN" index="1" function="24" pad="PA12" ioset="3"/>
              <signal group="WO_IN" index="1" function="1" pad="PA04" ioset="5"/>
              <signal group="WO_IN" index="1" function="2" pad="PA10" ioset="5"/>
              <signal group="WO_IN" index="1" function="3" pad="PB04" ioset="5"/>
              <signal group="WO_IN" index="1" function="4" pad="PB10" ioset="5"/>
              <signal group="WO_IN" index="1" function="6" pad="PE04" ioset="5"/>
              <signal group="WO_IN" index="1" function="7" pad="PA01" ioset="5"/>
              <signal group="WO_IN" index="1" function="8" pad="PB00" ioset="5"/>
              <signal group="WO_IN" index="1" function="10" pad="PD02" ioset="5"/>
              <signal group="WO_IN" index="1" function="12" pad="PC10" ioset="5"/>
              <signal group="WO_IN" index="1" function="14" pad="PA15" ioset="5"/>
              <signal group="WO_IN" index="1" function="16" pad="PB15" ioset="5"/>
              <signal group="WO_IN" index="1" function="18" pad="PD01" ioset="5"/>
            </signals>
            <parameters>
              <param name="GCLK_ID" value="11"/>
              <param name="DMAC_ID_OVF" value="62"/>
              <param name="DMAC_ID_MC0" value="63"/>
              <param name="DMAC_ID_MC1" value="64"/>
              <param name="INSTANCE_ID" value="101" caption="Instance index for TC9"/>
              <param name="PAC_ID" value="101" caption="Index for TC9 registers write protection"/>
              <param name="MASTER_SLAVE_MODE" value="2"/>
            </parameters>
          </instance>
        </module>
        <module name="TCC" id="04706" name2="tmr_tcc_u2213_v5" version="A">
          <instance name="TCC0">
            <register-group name="TCC0" name-in-module="TCC" address-space="base" offset="0x40003400"/>
