zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
            <parameters>
              <param name="GCLK_ID" value="25"/>
              <param name="DMAC_ID_OVF" value="25"/>
              <param name="DMAC_ID_MC0" value="26"/>
              <param name="DMAC_ID_MC1" value="27"/>
              <param name="DMAC_ID_MC2" value="28"/>
              <param name="DMAC_ID_MC3" value="29"/>
              <param name="DMAC_ID_MC4" value="30"/>
              <param name="DMAC_ID_MC5" value="31"/>
              <param name="SIZE" value="24"/>
              <param name="MASTER_SLAVE_MODE" value="2"/>
              <param name="CC_NUM" value="6"/>
              <param name="OW_NUM" value="6"/>
              <param name="DITHERING" value="1"/>
              <param name="OTMX" value="1"/>
              <param name="DTI" value="2"/>
              <param name="SWAP" value="4"/>
              <param name="PG" value="8"/>
              <param name="INSTANCE_ID" value="14" caption="Instance index for TCC1"/>
              <param name="PAC_ID" value="14" caption="Index for TCC1 registers write protection"/>
            </parameters>
            <signals>
              <signal group="WO" index="0" function="15" pad="PA00" ioset="1"/>
              <signal group="WO" index="0" function="15" pad="PA02" ioset="1"/>
              <signal group="WO" index="0" function="15" pad="PA03" ioset="1"/>
              <signal group="WO" index="0" function="15" pad="PA06" ioset="1"/>
              <signal group="WO" index="0" function="15" pad="PA07" ioset="1"/>
              <signal group="WO" index="0" function="15" pad="PA09" ioset="1"/>
              <signal group="WO" index="0" function="15" pad="PA10" ioset="1"/>
              <signal group="WO" index="0" function="15" pad="PA11" ioset="1"/>
              <signal group="WO" index="0" function="15" pad="PA14" ioset="1"/>
              <signal group="WO" index="0" function="15" pad="PB00" ioset="1"/>
              <signal group="WO" index="0" function="15" pad="PB01" ioset="1"/>
              <signal group="WO" index="0" function="15" pad="PB03" ioset="1"/>
              <signal group="WO" index="0" function="15" pad="PB04" ioset="1"/>
              <signal group="WO" index="0" function="15" pad="PB06" ioset="1"/>
              <signal group="WO" index="0" function="15" pad="PB07" ioset="1"/>
              <signal group="WO" index="0" function="15" pad="PB08" ioset="1"/>
              <signal group="WO" index="0" function="15" pad="PB11" ioset="1"/>
              <signal group="WO" index="0" function="15" pad="PB12" ioset="1"/>
              <signal group="WO" index="0" function="15" pad="PC09" ioset="1"/>
              <signal group="WO" index="0" function="15" pad="PD06" ioset="1"/>
              <signal group="WO" index="0" function="15" pad="PE04" ioset="1"/>
              <signal group="WO" index="4" function="16" pad="PA00" ioset="1"/>
              <signal group="WO" index="4" function="16" pad="PA02" ioset="1"/>
              <signal group="WO" index="4" function="16" pad="PA03" ioset="1"/>
              <signal group="WO" index="4" function="16" pad="PA06" ioset="1"/>
              <signal group="WO" index="4" function="16" pad="PA07" ioset="1"/>
              <signal group="WO" index="4" function="16" pad="PA09" ioset="1"/>
              <signal group="WO" index="4" function="16" pad="PA10" ioset="1"/>
              <signal group="WO" index="4" function="16" pad="PA11" ioset="1"/>
              <signal group="WO" index="4" function="16" pad="PA14" ioset="1"/>
              <signal group="WO" index="4" function="16" pad="PB00" ioset="1"/>
              <signal group="WO" index="4" function="16" pad="PB01" ioset="1"/>
              <signal group="WO" index="4" function="16" pad="PB03" ioset="1"/>
              <signal group="WO" index="4" function="16" pad="PB04" ioset="1"/>
              <signal group="WO" index="4" function="16" pad="PB06" ioset="1"/>
              <signal group="WO" index="4" function="16" pad="PB07" ioset="1"/>
              <signal group="WO" index="4" function="16" pad="PB08" ioset="1"/>
              <signal group="WO" index="4" function="16" pad="PB11" ioset="1"/>
              <signal group="WO" index="4" function="16" pad="PB12" ioset="1"/>
              <signal group="WO" index="4" function="16" pad="PC09" ioset="1"/>
              <signal group="WO" index="4" function="16" pad="PD06" ioset="1"/>
              <signal group="WO" index="4" function="16" pad="PE04" ioset="1"/>
              <signal group="WO" index="1" function="20" pad="PA00" ioset="2"/>
              <signal group="WO" index="1" function="20" pad="PA01" ioset="2"/>
              <signal group="WO" index="1" function="20" pad="PA03" ioset="2"/>
              <signal group="WO" index="1" function="20" pad="PA04" ioset="2"/>
              <signal group="WO" index="1" function="20" pad="PA07" ioset="2"/>
              <signal group="WO" index="1" function="20" pad="PA08" ioset="2"/>
              <signal group="WO" index="1" function="20" pad="PA11" ioset="2"/>
              <signal group="WO" index="1" function="20" pad="PA12" ioset="2"/>
              <signal group="WO" index="1" function="20" pad="PB00" ioset="2"/>
              <signal group="WO" index="1" function="20" pad="PB01" ioset="2"/>
              <signal group="WO" index="1" function="20" pad="PB02" ioset="2"/>
              <signal group="WO" index="1" function="20" pad="PB04" ioset="2"/>
              <signal group="WO" index="1" function="20" pad="PB05" ioset="2"/>
              <signal group="WO" index="1" function="20" pad="PB07" ioset="2"/>
              <signal group="WO" index="1" function="20" pad="PB08" ioset="2"/>
              <signal group="WO" index="1" function="20" pad="PB09" ioset="2"/>
              <signal group="WO" index="1" function="20" pad="PB12" ioset="2"/>
              <signal group="WO" index="1" function="20" pad="PB13" ioset="2"/>
              <signal group="WO" index="1" function="20" pad="PC01" ioset="2"/>
              <signal group="WO" index="1" function="20" pad="PD04" ioset="2"/>
              <signal group="WO" index="1" function="20" pad="PE01" ioset="2"/>
              <signal group="WO" index="3" function="22" pad="PA00" ioset="2"/>
              <signal group="WO" index="3" function="22" pad="PA01" ioset="2"/>
              <signal group="WO" index="3" function="22" pad="PA03" ioset="2"/>
              <signal group="WO" index="3" function="22" pad="PA04" ioset="2"/>
              <signal group="WO" index="3" function="22" pad="PA07" ioset="2"/>
              <signal group="WO" index="3" function="22" pad="PA08" ioset="2"/>
              <signal group="WO" index="3" function="22" pad="PA11" ioset="2"/>
              <signal group="WO" index="3" function="22" pad="PA12" ioset="2"/>
              <signal group="WO" index="3" function="22" pad="PB00" ioset="2"/>
              <signal group="WO" index="3" function="22" pad="PB01" ioset="2"/>
              <signal group="WO" index="3" function="22" pad="PB02" ioset="2"/>
              <signal group="WO" index="3" function="22" pad="PB04" ioset="2"/>
              <signal group="WO" index="3" function="22" pad="PB05" ioset="2"/>
              <signal group="WO" index="3" function="22" pad="PB07" ioset="2"/>
              <signal group="WO" index="3" function="22" pad="PB08" ioset="2"/>
              <signal group="WO" index="3" function="22" pad="PB09" ioset="2"/>
              <signal group="WO" index="3" function="22" pad="PB12" ioset="2"/>
              <signal group="WO" index="3" function="22" pad="PB13" ioset="2"/>
              <signal group="WO" index="3" function="22" pad="PC01" ioset="2"/>
              <signal group="WO" index="3" function="22" pad="PD04" ioset="2"/>
              <signal group="WO" index="3" function="22" pad="PE01" ioset="2"/>
              <signal group="WO" index="5" function="21" pad="PA00" ioset="2"/>
              <signal group="WO" index="5" function="21" pad="PA01" ioset="2"/>
              <signal group="WO" index="5" function="21" pad="PA03" ioset="2"/>
              <signal group="WO" index="5" function="21" pad="PA04" ioset="2"/>
              <signal group="WO" index="5" function="21" pad="PA07" ioset="2"/>
              <signal group="WO" index="5" function="21" pad="PA08" ioset="2"/>
              <signal group="WO" index="5" function="21" pad="PA11" ioset="2"/>
              <signal group="WO" index="5" function="21" pad="PA12" ioset="2"/>
              <signal group="WO" index="5" function="21" pad="PB00" ioset="2"/>
              <signal group="WO" index="5" function="21" pad="PB01" ioset="2"/>
              <signal group="WO" index="5" function="21" pad="PB02" ioset="2"/>
              <signal group="WO" index="5" function="21" pad="PB04" ioset="2"/>
              <signal group="WO" index="5" function="21" pad="PB05" ioset="2"/>
              <signal group="WO" index="5" function="21" pad="PB07" ioset="2"/>
              <signal group="WO" index="5" function="21" pad="PB08" ioset="2"/>
              <signal group="WO" index="5" function="21" pad="PB09" ioset="2"/>
              <signal group="WO" index="5" function="21" pad="PB12" ioset="2"/>
              <signal group="WO" index="5" function="21" pad="PB13" ioset="2"/>
              <signal group="WO" index="5" function="21" pad="PC01" ioset="2"/>
              <signal group="WO" index="5" function="21" pad="PD04" ioset="2"/>
              <signal group="WO" index="5" function="21" pad="PE01" ioset="2"/>
              <signal group="WO" index="0" function="21" pad="PA00" ioset="3"/>
              <signal group="WO" index="0" function="21" pad="PA01" ioset="3"/>
              <signal group="WO" index="0" function="21" pad="PA02" ioset="3"/>
              <signal group="WO" index="0" function="21" pad="PA04" ioset="3"/>
              <signal group="WO" index="0" function="21" pad="PA05" ioset="3"/>
              <signal group="WO" index="0" function="21" pad="PA08" ioset="3"/>
              <signal group="WO" index="0" function="21" pad="PA09" ioset="3"/>
              <signal group="WO" index="0" function="21" pad="PA12" ioset="3"/>
              <signal group="WO" index="0" function="21" pad="PA13" ioset="3"/>
              <signal group="WO" index="0" function="21" pad="PB01" ioset="3"/>
              <signal group="WO" index="0" function="21" pad="PB02" ioset="3"/>
              <signal group="WO" index="0" function="21" pad="PB03" ioset="3"/>
              <signal group="WO" index="0" function="21" pad="PB05" ioset="3"/>
              <signal group="WO" index="0" function="21" pad="PB06" ioset="3"/>
              <signal group="WO" index="0" function="21" pad="PB08" ioset="3"/>
              <signal group="WO" index="0" function="21" pad="PB09" ioset="3"/>
              <signal group="WO" index="0" function="21" pad="PB10" ioset="3"/>
              <signal group="WO" index="0" function="21" pad="PB13" ioset="3"/>
              <signal group="WO" index="0" function="21" pad="PC08" ioset="3"/>
              <signal group="WO" index="0" function="21" pad="PD06" ioset="3"/>
              <signal group="WO" index="0" function="21" pad="PE02" ioset="3"/>
              <signal group="WO" index="2" function="20" pad="PA00" ioset="3"/>
              <signal group="WO" index="2" function="20" pad="PA01" ioset="3"/>
              <signal group="WO" index="2" function="20" pad="PA02" ioset="3"/>
              <signal group="WO" index="2" function="20" pad="PA04" ioset="3"/>
              <signal group="WO" index="2" function="20" pad="PA05" ioset="3"/>
              <signal group="WO" index="2" function="20" pad="PA08" ioset="3"/>
              <signal group="WO" index="2" function="20" pad="PA09" ioset="3"/>
              <signal group="WO" index="2" function="20" pad="PA12" ioset="3"/>
              <signal group="WO" index="2" function="20" pad="PA13" ioset="3"/>
              <signal group="WO" index="2" function="20" pad="PB01" ioset="3"/>
              <signal group="WO" index="2" function="20" pad="PB02" ioset="3"/>
              <signal group="WO" index="2" function="20" pad="PB03" ioset="3"/>
              <signal group="WO" index="2" function="20" pad="PB05" ioset="3"/>
              <signal group="WO" index="2" function="20" pad="PB06" ioset="3"/>
              <signal group="WO" index="2" function="20" pad="PB08" ioset="3"/>
              <signal group="WO" index="2" function="20" pad="PB09" ioset="3"/>
              <signal group="WO" index="2" function="20" pad="PB10" ioset="3"/>
              <signal group="WO" index="2" function="20" pad="PB13" ioset="3"/>
              <signal group="WO" index="2" function="20" pad="PC08" ioset="3"/>
              <signal group="WO" index="2" function="20" pad="PD06" ioset="3"/>
              <signal group="WO" index="2" function="20" pad="PE02" ioset="3"/>
              <signal group="WO" index="4" function="22" pad="PA00" ioset="3"/>
              <signal group="WO" index="4" function="22" pad="PA01" ioset="3"/>
              <signal group="WO" index="4" function="22" pad="PA02" ioset="3"/>
              <signal group="WO" index="4" function="22" pad="PA04" ioset="3"/>
              <signal group="WO" index="4" function="22" pad="PA05" ioset="3"/>
              <signal group="WO" index="4" function="22" pad="PA08" ioset="3"/>
              <signal group="WO" index="4" function="22" pad="PA09" ioset="3"/>
              <signal group="WO" index="4" function="22" pad="PA12" ioset="3"/>
              <signal group="WO" index="4" function="22" pad="PA13" ioset="3"/>
              <signal group="WO" index="4" function="22" pad="PB01" ioset="3"/>
              <signal group="WO" index="4" function="22" pad="PB02" ioset="3"/>
              <signal group="WO" index="4" function="22" pad="PB03" ioset="3"/>
              <signal group="WO" index="4" function="22" pad="PB05" ioset="3"/>
              <signal group="WO" index="4" function="22" pad="PB06" ioset="3"/>
              <signal group="WO" index="4" function="22" pad="PB08" ioset="3"/>
              <signal group="WO" index="4" function="22" pad="PB09" ioset="3"/>
              <signal group="WO" index="4" function="22" pad="PB10" ioset="3"/>
              <signal group="WO" index="4" function="22" pad="PB13" ioset="3"/>
              <signal group="WO" index="4" function="22" pad="PC08" ioset="3"/>
              <signal group="WO" index="4" function="22" pad="PD06" ioset="3"/>
              <signal group="WO" index="4" function="22" pad="PE02" ioset="3"/>
              <signal group="WO" index="1" function="18" pad="PA00" ioset="4"/>
              <signal group="WO" index="1" function="18" pad="PA01" ioset="4"/>
              <signal group="WO" index="1" function="18" pad="PA02" ioset="4"/>
              <signal group="WO" index="1" function="18" pad="PA03" ioset="4"/>
              <signal group="WO" index="1" function="18" pad="PA05" ioset="4"/>
              <signal group="WO" index="1" function="18" pad="PA06" ioset="4"/>
              <signal group="WO" index="1" function="18" pad="PA08" ioset="4"/>
              <signal group="WO" index="1" function="18" pad="PA09" ioset="4"/>
              <signal group="WO" index="1" function="18" pad="PA10" ioset="4"/>
              <signal group="WO" index="1" function="18" pad="PA13" ioset="4"/>
              <signal group="WO" index="1" function="18" pad="PA14" ioset="4"/>
              <signal group="WO" index="1" function="18" pad="PB02" ioset="4"/>
              <signal group="WO" index="1" function="18" pad="PB03" ioset="4"/>
              <signal group="WO" index="1" function="18" pad="PB04" ioset="4"/>
              <signal group="WO" index="1" function="18" pad="PB06" ioset="4"/>
              <signal group="WO" index="1" function="18" pad="PB07" ioset="4"/>
              <signal group="WO" index="1" function="18" pad="PB10" ioset="4"/>
              <signal group="WO" index="1" function="18" pad="PB11" ioset="4"/>
              <signal group="WO" index="1" function="18" pad="PC09" ioset="4"/>
              <signal group="WO" index="1" function="18" pad="PD07" ioset="4"/>
              <signal group="WO" index="1" function="18" pad="PE03" ioset="4"/>
              <signal group="WO" index="3" function="17" pad="PA00" ioset="4"/>
              <signal group="WO" index="3" function="17" pad="PA01" ioset="4"/>
              <signal group="WO" index="3" function="17" pad="PA02" ioset="4"/>
              <signal group="WO" index="3" function="17" pad="PA03" ioset="4"/>
              <signal group="WO" index="3" function="17" pad="PA05" ioset="4"/>
              <signal group="WO" index="3" function="17" pad="PA06" ioset="4"/>
              <signal group="WO" index="3" function="17" pad="PA08" ioset="4"/>
              <signal group="WO" index="3" function="17" pad="PA09" ioset="4"/>
              <signal group="WO" index="3" function="17" pad="PA10" ioset="4"/>
              <signal group="WO" index="3" function="17" pad="PA13" ioset="4"/>
              <signal group="WO" index="3" function="17" pad="PA14" ioset="4"/>
              <signal group="WO" index="3" function="17" pad="PB02" ioset="4"/>
              <signal group="WO" index="3" function="17" pad="PB03" ioset="4"/>
              <signal group="WO" index="3" function="17" pad="PB04" ioset="4"/>
              <signal group="WO" index="3" function="17" pad="PB06" ioset="4"/>
              <signal group="WO" index="3" function="17" pad="PB07" ioset="4"/>
              <signal group="WO" index="3" function="17" pad="PB10" ioset="4"/>
              <signal group="WO" index="3" function="17" pad="PB11" ioset="4"/>
              <signal group="WO" index="3" function="17" pad="PC09" ioset="4"/>
              <signal group="WO" index="3" function="17" pad="PD07" ioset="4"/>
              <signal group="WO" index="3" function="17" pad="PE03" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PA00" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PA01" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PA02" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PA03" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PA05" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PA06" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PA08" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PA09" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PA10" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PA13" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PA14" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PB02" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PB03" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PB04" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PB06" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PB07" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PB10" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PB11" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PC09" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PD07" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PE03" ioset="4"/>
              <signal group="WO" index="1" function="9" pad="PA01" ioset="5"/>
              <signal group="WO" index="1" function="9" pad="PA04" ioset="5"/>
              <signal group="WO" index="1" function="9" pad="PA10" ioset="5"/>
              <signal group="WO" index="1" function="9" pad="PB00" ioset="5"/>
              <signal group="WO" index="1" function="9" pad="PB04" ioset="5"/>
              <signal group="WO" index="1" function="9" pad="PB10" ioset="5"/>
              <signal group="WO" index="1" function="9" pad="PB15" ioset="5"/>
              <signal group="WO" index="1" function="9" pad="PC10" ioset="5"/>
              <signal group="WO" index="1" function="9" pad="PD00" ioset="5"/>
              <signal group="WO" index="1" function="9" pad="PD02" ioset="5"/>
              <signal group="WO" index="1" function="9" pad="PE02" ioset="5"/>
              <signal group="WO" index="2" function="8" pad="PA01" ioset="5"/>
              <signal group="WO" index="2" function="8" pad="PA04" ioset="5"/>
              <signal group="WO" index="2" function="8" pad="PA10" ioset="5"/>
              <signal group="WO" index="2" function="8" pad="PB00" ioset="5"/>
              <signal group="WO" index="2" function="8" pad="PB04" ioset="5"/>
              <signal group="WO" index="2" function="8" pad="PB10" ioset="5"/>
              <signal group="WO" index="2" function="8" pad="PB15" ioset="5"/>
              <signal group="WO" index="2" function="8" pad="PC10" ioset="5"/>
              <signal group="WO" index="2" function="8" pad="PD00" ioset="5"/>
              <signal group="WO" index="2" function="8" pad="PD02" ioset="5"/>
              <signal group="WO" index="2" function="8" pad="PE02" ioset="5"/>
              <signal group="WO" index="4" function="7" pad="PA01" ioset="5"/>
              <signal group="WO" index="4" function="7" pad="PA04" ioset="5"/>
              <signal group="WO" index="4" function="7" pad="PA10" ioset="5"/>
              <signal group="WO" index="4" function="7" pad="PB00" ioset="5"/>
              <signal group="WO" index="4" function="7" pad="PB04" ioset="5"/>
              <signal group="WO" index="4" function="7" pad="PB10" ioset="5"/>
              <signal group="WO" index="4" function="7" pad="PB15" ioset="5"/>
              <signal group="WO" index="4" function="7" pad="PC10" ioset="5"/>
              <signal group="WO" index="4" function="7" pad="PD00" ioset="5"/>
              <signal group="WO" index="4" function="7" pad="PD02" ioset="5"/>
              <signal group="WO" index="4" function="7" pad="PE02" ioset="5"/>
            </signals>
          </instance>
