zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
        <module name="TPI" id="SYSTEM_IP" version="1.0.0">
          <instance name="TPI">
            <register-group name="TPI" name-in-module="TPI" address-space="base" offset="0xE0040000"/>
          </instance>
        </module>
        <module name="USB" id="02813" name2="usb_otgcore_pb_v3" version="A">
          <instance name="USB">
            <register-group name="USB" name-in-module="USB" address-space="base" offset="0x44010000"/>
          </instance>
        </module>
        <module name="WDT" id="02674" name2="wdt_upb_v1" version="A">
          <instance name="WDT">
            <register-group name="WDT" name-in-module="WDT" address-space="base" offset="0x44000500"/>
            <parameters>
              <param name="UPB_ADDRL" value="0x500" caption="See Table 3-21"/>
              <param name="MAX_RUN_PS" value="20"/>
              <param name="MAX_SLEEP_PS" value="20"/>
              <param name="WINDOW_WDT" value="1" caption="enabled"/>
            </parameters>
          </instance>
        </module>
        <module name="ZIGBEE" id="04998" name2="zb_mac_v3" version="A">
          <instance name="ZIGBEE">
            <register-group name="ZIGBEE" name-in-module="ZIGBEE" address-space="base" offset="0x41010000"/>
          </instance>
        </module>
      </peripherals>
      <interrupts>
        <interrupt name="Reset" index="-15" caption="Reset Vector, invoked on Power up and warm reset"/>
        <interrupt name="NonMaskableInt" index="-14" caption="Non maskable Interrupt, cannot be stopped or preempted"/>
        <interrupt name="HardFault" index="-13" caption="Hard Fault, all classes of Fault"/>
        <interrupt name="MemoryManagement" index="-12" caption="Memory Management, MPU mismatch, including Access Violation and No Match"/>
        <interrupt name="BusFault" index="-11" caption="Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault"/>
        <interrupt name="UsageFault" index="-10" caption="Usage Fault, i.e. Undef Instruction, Illegal State Transition"/>
        <interrupt name="SVCall" index="-5" caption="System Service Call via SVC instruction"/>
        <interrupt name="DebugMonitor" index="-4" caption="Debug Monitor"/>
        <interrupt name="PendSV" index="-2" caption="Pendable request for system service"/>
        <interrupt name="SysTick" index="-1" caption="System Tick Timer"/>
        <interrupt name="RTC" index="0" module-instance="RTC" caption="Real Time Counter"/>
        <interrupt name="EIC" index="1" module-instance="EIC" caption="External Interrupt Controller"/>
        <interrupt name="FREQM" index="2" module-instance="FREQM" caption="Frequency Meter"/>
        <interrupt name="NVM" index="3" module-instance="NVM" caption="Non-Volatile Memory"/>
        <interrupt name="CHANGE_NOTICE_A" index="4" module-instance="GPIOA" caption="PORT_A_INPUT_CHANGE_INTERRUPT"/>
        <interrupt name="CHANGE_NOTICE_B" index="5" module-instance="GPIOB" caption="PORT_B_INPUT_CHANGE_INTERRUPT"/>
        <interrupt name="CHANGE_NOTICE_C" index="6" module-instance="GPIOC" caption="PORT_C_INPUT_CHANGE_INTERRUPT"/>
        <interrupt name="CHANGE_NOTICE_D" index="7" module-instance="GPIOD" caption="PORT_D_INPUT_CHANGE_INTERRUPT"/>
        <interrupt name="CHANGE_NOTICE_E" index="8" module-instance="GPIOE" caption="PORT_E_INPUT_CHANGE_INTERRUPT"/>
        <interrupt name="DMAC_0_3" index="9" module-instance="DMAC" caption="DMA Channel 0..3"/>
        <interrupt name="DMAC_4_15" index="10" module-instance="DMAC" caption="DMA Channel 4..15"/>
        <interrupt name="EVSYS_0_3" index="11" module-instance="EVSYS" caption="Event System Channel 0..3"/>
        <interrupt name="EVSYS_4_11" index="12" module-instance="EVSYS" caption="Event System Channel 4..11"/>
        <interrupt name="PAC" index="13" module-instance="PAC" caption="Peripheral Access Controller"/>
        <interrupt name="RAMECC" index="14" module-instance="RAMECC" caption="RAM Error Correction Code"/>
        <interrupt name="SERCOM0" index="15" module-instance="SERCOM0" caption="Serial Communication Interface 0"/>
        <interrupt name="SERCOM1" index="16" module-instance="SERCOM1" caption="Serial Communication Interface 1"/>
        <interrupt name="SERCOM2" index="17" module-instance="SERCOM2" caption="Serial Communication Interface 2"/>
        <interrupt name="SERCOM3" index="18" module-instance="SERCOM3" caption="Serial Communication Interface 3"/>
        <interrupt name="SERCOM4" index="19" module-instance="SERCOM4" caption="Serial Communication Interface 4"/>
        <interrupt name="SERCOM5" index="20" module-instance="SERCOM5" caption="Serial Communication Interface 5"/>
        <interrupt name="SERCOM6" index="21" module-instance="SERCOM6" caption="Serial Communication Interface 6"/>
        <interrupt name="TCC0" index="22" module-instance="TCC0" caption="Timer/Counter for Control Applications 0"/>
        <interrupt name="TCC1" index="23" module-instance="TCC1" caption="Timer/Counter for Control Applications 1"/>
        <interrupt name="TCC2" index="24" module-instance="TCC2" caption="Timer/Counter for Control Applications 2"/>
        <interrupt name="TC0" index="25" module-instance="TC0" caption="Timer/Counter 0"/>
        <interrupt name="TC1" index="26" module-instance="TC1" caption="Timer/Counter 1"/>
        <interrupt name="TC2" index="27" module-instance="TC2" caption="Timer/Counter 2"/>
        <interrupt name="TC3" index="28" module-instance="TC3" caption="Timer/Counter 3"/>
        <interrupt name="TC4" index="29" module-instance="TC4" caption="Timer/Counter 4"/>
        <interrupt name="TC5" index="30" module-instance="TC5" caption="Timer/Counter 5"/>
        <interrupt name="TC6" index="31" module-instance="TC6" caption="Timer/Counter 6"/>
        <interrupt name="TC7" index="32" module-instance="TC7" caption="Timer/Counter 7"/>
        <interrupt name="TC8" index="33" module-instance="TC8" caption="Timer/Counter 8"/>
        <interrupt name="TC9" index="34" module-instance="TC9" caption="Timer/Counter 9"/>
        <interrupt name="ADCHS_IRQ" index="35" module-instance="ADCHS" caption="Analog-to-Digital Converter"/>
        <interrupt name="ADCHS_FAULT" index="36" module-instance="ADCHS" caption="ADC Fault Interrupt"/>
        <interrupt name="ADCHS_FCC" index="37" module-instance="ADCHS" caption="ADC FCC Interrupt"/>
        <interrupt name="ADCHS_BGVR_RDY" index="38" module-instance="ADCHS" caption="ADC BGVR Ready"/>
        <interrupt name="AC" index="39" module-instance="AC" caption="Analog Comparators"/>
        <interrupt name="CRYPTO_0" index="40" module-instance="CRYPTO" caption="Crypto 0"/>
        <interrupt name="CRYPTO_1" index="41" module-instance="CRYPTO" caption="Crypto 1"/>
        <interrupt name="QSPI" index="42" module-instance="QSPI" caption="Quad SPI interface"/>
        <interrupt name="ZB_INT0" index="43" module-instance="ZIGBEE" caption="ZIGBEE"/>
        <interrupt name="BT_INT0" index="44" module-instance="BLE" caption="Bluetooth 0"/>
        <interrupt name="BT_INT1" index="45" module-instance="BLE" caption="Bluetooth 1"/>
        <interrupt name="ARBITER" index="46" module-instance="ARB" caption="Radio Arbiter"/>
        <interrupt name="CLKI_WAKEUP_NMI" index="47" module-instance="BLE" caption="WSS WAKEUP"/>
        <interrupt name="CVD" index="48" module-instance="CVD" caption="CVD Interrpt"/>
        <interrupt name="CRYPTO_2" index="49" module-instance="CRYPTO" caption="Crypto 2"/>
        <interrupt name="QEI" index="50" module-instance="QEI" caption="QEI"/>
        <interrupt name="CAN0" index="51" module-instance="CAN0" caption="CAN0"/>
        <interrupt name="CAN1" index="52" module-instance="CAN1" caption="CAN1"/>
        <interrupt name="ETH" index="53" module-instance="ETH" caption="Ethernet"/>
        <interrupt name="USB" index="54" module-instance="USB" caption="USB"/>
        <interrupt name="PLL_LOCK_BOOT" index="55" module-instance="BTZBSYS" caption="Boot PLL Lock "/>
        <interrupt name="PLL_LOCK_USER" index="56" module-instance="BTZBSYS" caption="User PLL Lock"/>
        <interrupt name="BT_LC" index="57" module-instance="BLE" caption="Bluetooth LC"/>
      </interrupts>
      <events>
        <generators>
          <generator name="RTC_PER_0" index="1" module-instance="RTC"/>
          <generator name="RTC_PER_1" index="2" module-instance="RTC"/>
          <generator name="RTC_PER_2" index="3" module-instance="RTC"/>
          <generator name="RTC_PER_3" index="4" module-instance="RTC"/>
          <generator name="RTC_PER_4" index="5" module-instance="RTC"/>
          <generator name="RTC_PER_5" index="6" module-instance="RTC"/>
          <generator name="RTC_PER_6" index="7" module-instance="RTC"/>
          <generator name="RTC_PER_7" index="8" module-instance="RTC"/>
          <generator name="RTC_CMP_0" index="9" module-instance="RTC"/>
          <generator name="RTC_CMP_1" index="10" module-instance="RTC"/>
          <generator name="RTC_CMP_2" index="11" module-instance="RTC"/>
          <generator name="RTC_CMP_3" index="12" module-instance="RTC"/>
          <generator name="RTC_TAMPER" index="13" module-instance="RTC"/>
          <generator name="RTC_OVF" index="14" module-instance="RTC"/>
          <generator name="EIC_EXTINT_0" index="15" module-instance="EIC"/>
          <generator name="EIC_EXTINT_1" index="16" module-instance="EIC"/>
          <generator name="EIC_EXTINT_2" index="17" module-instance="EIC"/>
          <generator name="EIC_EXTINT_3" index="18" module-instance="EIC"/>
          <generator name="DMAC_CH_0" index="19" module-instance="DMAC"/>
          <generator name="DMAC_CH_1" index="20" module-instance="DMAC"/>
          <generator name="DMAC_CH_2" index="21" module-instance="DMAC"/>
          <generator name="DMAC_CH_3" index="22" module-instance="DMAC"/>
          <generator name="PAC_ACCERR" index="23" module-instance="PAC"/>
          <generator name="TCC0_OVF" index="24" module-instance="TCC0"/>
          <generator name="TCC0_TRG" index="25" module-instance="TCC0"/>
          <generator name="TCC0_CNT" index="26" module-instance="TCC0"/>
          <generator name="TCC0_MCX_0" index="27" module-instance="TCC0"/>
          <generator name="TCC0_MCX_1" index="28" module-instance="TCC0"/>
          <generator name="TCC0_MCX_2" index="29" module-instance="TCC0"/>
          <generator name="TCC0_MCX_3" index="30" module-instance="TCC0"/>
          <generator name="TCC0_MCX_4" index="31" module-instance="TCC0"/>
          <generator name="TCC0_MCX_5" index="32" module-instance="TCC0"/>
          <generator name="TCC1_OVF" index="33" module-instance="TCC1"/>
          <generator name="TCC1_TRG" index="34" module-instance="TCC1"/>
          <generator name="TCC1_CNT" index="35" module-instance="TCC1"/>
          <generator name="TCC1_MCX_0" index="36" module-instance="TCC1"/>
          <generator name="TCC1_MCX_1" index="37" module-instance="TCC1"/>
          <generator name="TCC1_MCX_2" index="38" module-instance="TCC1"/>
          <generator name="TCC1_MCX_3" index="39" module-instance="TCC1"/>
          <generator name="TCC1_MCX_4" index="40" module-instance="TCC1"/>
          <generator name="TCC1_MCX_5" index="41" module-instance="TCC1"/>
          <generator name="TCC2_OVF" index="42" module-instance="TCC2"/>
          <generator name="TCC2_TRG" index="43" module-instance="TCC2"/>
          <generator name="TCC2_CNT" index="44" module-instance="TCC2"/>
          <generator name="TCC2_MCX_0" index="45" module-instance="TCC2"/>
          <generator name="TCC2_MCX_1" index="46" module-instance="TCC2"/>
          <generator name="TC0_OVF" index="47" module-instance="TC0"/>
          <generator name="TC0_MCX_0" index="48" module-instance="TC0"/>
          <generator name="TC0_MCX_1" index="49" module-instance="TC0"/>
          <generator name="TC1_OVF" index="50" module-instance="TC1"/>
          <generator name="TC1_MCX_0" index="51" module-instance="TC1"/>
          <generator name="TC1_MCX_1" index="52" module-instance="TC1"/>
          <generator name="TC2_OVF" index="53" module-instance="TC2"/>
          <generator name="TC2_MCX_0" index="54" module-instance="TC2"/>
          <generator name="TC2_MCX_1" index="55" module-instance="TC2"/>
          <generator name="TC3_OVF" index="56" module-instance="TC3"/>
          <generator name="TC3_MCX_0" index="57" module-instance="TC3"/>
          <generator name="TC3_MCX_1" index="58" module-instance="TC3"/>
          <generator name="TC4_OVF" index="59" module-instance="TC4"/>
          <generator name="TC4_MCX_0" index="60" module-instance="TC4"/>
          <generator name="TC4_MCX_1" index="61" module-instance="TC4"/>
          <generator name="TC5_OVF" index="62" module-instance="TC5"/>
          <generator name="TC5_MCX_0" index="63" module-instance="TC5"/>
          <generator name="TC5_MCX_1" index="64" module-instance="TC5"/>
          <generator name="TC6_OVF" index="65" module-instance="TC6"/>
          <generator name="TC6_MCX_0" index="66" module-instance="TC6"/>
          <generator name="TC6_MCX_1" index="67" module-instance="TC6"/>
          <generator name="TC7_OVF" index="68" module-instance="TC7"/>
          <generator name="TC7_MCX_0" index="69" module-instance="TC7"/>
          <generator name="TC7_MCX_1" index="70" module-instance="TC7"/>
          <generator name="TC8_OVF" index="71" module-instance="TC8"/>
          <generator name="TC8_MCX_0" index="72" module-instance="TC8"/>
          <generator name="TC8_MCX_1" index="73" module-instance="TC8"/>
          <generator name="TC9_OVF" index="74" module-instance="TC9"/>
          <generator name="TC9_MCX_0" index="75" module-instance="TC9"/>
          <generator name="TC9_MCX_1" index="76" module-instance="TC9"/>
          <generator name="ADCHS_EVENT_0" index="77" module-instance="ADCHS"/>
          <generator name="AC_COMP_0" index="80" module-instance="AC"/>
          <generator name="AC_COMP_1" index="81" module-instance="AC"/>
          <generator name="AC_WIN" index="82" module-instance="AC"/>
          <generator name="CCL_LUTOUT_0" index="84" module-instance="CCL"/>
          <generator name="CCL_LUTOUT_1" index="85" module-instance="CCL"/>
          <generator name="ZIGBEE_TX_TS_ACTIVE" index="86" module-instance="ZIGBEE"/>
          <generator name="ZIGBEE_RX_TS_ACTIVE" index="87" module-instance="ZIGBEE"/>
          <generator name="QEI0" index="89" module-instance="QEI"/>
        </generators>
        <users>
          <user name="RTC_TAMPER" index="0" module-instance="RTC"/>
          <user name="DMAC_CH_0" index="1" module-instance="DMAC"/>
          <user name="DMAC_CH_1" index="2" module-instance="DMAC"/>
          <user name="DMAC_CH_2" index="3" module-instance="DMAC"/>
          <user name="DMAC_CH_3" index="4" module-instance="DMAC"/>
          <user name="DMAC_CH_4" index="5" module-instance="DMAC"/>
          <user name="DMAC_CH_5" index="6" module-instance="DMAC"/>
          <user name="DMAC_CH_6" index="7" module-instance="DMAC"/>
          <user name="DMAC_CH_7" index="8" module-instance="DMAC"/>
          <user name="CM4_TRACE_START" index="9" module-instance="CM4"/>
          <user name="CM4_TRACE_STOP" index="10" module-instance="CM4"/>
          <user name="CM4_TRACE_TRIG" index="11" module-instance="CM4"/>
          <user name="TCC0_EV0" index="12" module-instance="TCC0"/>
          <user name="TCC0_EV1" index="13" module-instance="TCC0"/>
          <user name="TCC0_MC0" index="14" module-instance="TCC0"/>
          <user name="TCC0_MC1" index="15" module-instance="TCC0"/>
          <user name="TCC0_MC2" index="16" module-instance="TCC0"/>
          <user name="TCC0_MC3" index="17" module-instance="TCC0"/>
          <user name="TCC0_MC4" index="18" module-instance="TCC0"/>
          <user name="TCC0_MC5" index="19" module-instance="TCC0"/>
          <user name="TCC1_EV0" index="20" module-instance="TCC1"/>
          <user name="TCC1_EV1" index="21" module-instance="TCC1"/>
          <user name="TCC1_MC0" index="22" module-instance="TCC1"/>
          <user name="TCC1_MC1" index="23" module-instance="TCC1"/>
          <user name="TCC1_MC2" index="24" module-instance="TCC1"/>
          <user name="TCC1_MC3" index="25" module-instance="TCC1"/>
          <user name="TCC1_MC4" index="26" module-instance="TCC1"/>
          <user name="TCC1_MC5" index="27" module-instance="TCC1"/>
          <user name="TCC2_EV0" index="28" module-instance="TCC2"/>
          <user name="TCC2_EV1" index="29" module-instance="TCC2"/>
          <user name="TCC2_MC0" index="30" module-instance="TCC2"/>
          <user name="TCC2_MC1" index="31" module-instance="TCC2"/>
          <user name="TC0_EVU" index="32" module-instance="TC0"/>
          <user name="TC1_EVU" index="33" module-instance="TC1"/>
          <user name="TC2_EVU" index="34" module-instance="TC2"/>
          <user name="TC3_EVU" index="35" module-instance="TC3"/>
          <user name="TC4_EVU" index="36" module-instance="TC4"/>
          <user name="TC5_EVU" index="37" module-instance="TC5"/>
          <user name="TC6_EVU" index="38" module-instance="TC6"/>
          <user name="TC7_EVU" index="39" module-instance="TC7"/>
          <user name="TC8_EVU" index="40" module-instance="TC8"/>
          <user name="TC9_EVU" index="41" module-instance="TC9"/>
          <user name="ADCHS_TRIG_5" index="42" module-instance="ADCHS"/>
          <user name="ADCHS_TRIG_6" index="43" module-instance="ADCHS"/>
          <user name="ADCHS_TRIG_7" index="44" module-instance="ADCHS"/>
          <user name="ADCHS_TRIG_8" index="45" module-instance="ADCHS"/>
          <user name="ADCHS_TRIG_9" index="46" module-instance="ADCHS"/>
          <user name="ADCHS_TRIG_10" index="47" module-instance="ADCHS"/>
          <user name="ADCHS_TRIG_11" index="48" module-instance="ADCHS"/>
          <user name="ADCHS_TRIG_12" index="49" module-instance="ADCHS"/>
          <user name="ADCHS_TRIG_13" index="50" module-instance="ADCHS"/>
          <user name="ADCHS_TRIG_14" index="51" module-instance="ADCHS"/>
          <user name="ADCHS_TRIG_15" index="52" module-instance="ADCHS"/>
          <user name="ADCHS_TRIG_16" index="53" module-instance="ADCHS"/>
          <user name="AC_SOC_0" index="54" module-instance="AC"/>
          <user name="AC_SOC_1" index="55" module-instance="AC"/>
          <user name="CCL_LUTIN_0" index="56" module-instance="CCL"/>
          <user name="CCL_LUTIN_1" index="57" module-instance="CCL"/>
          <user name="CVD_TRIGGER" index="58" module-instance="CVD"/>
        </users>
      </events>
      <interfaces>
        <interface name="SWD" type="swd"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="DSU_DID" value="0x0001A802"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module name="AC" id="U2501" version="1.0.0" caption="Analog Comparators">
      <register-group name="AC" caption="Analog Comparators">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
