zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
        <register name="ADCIMCON1" offset="0x40" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield caption="AN0 Signed Data Mode bit" mask="0x00000001" name="SIGN0" values="ADCIMCON1__SIGN0"/>
          <bitfield caption="AN0 Mode bit" mask="0x00000002" name="DIFF0" values="ADCIMCON1__DIFF0"/>
          <bitfield caption="AN1 Signed Data Mode bit" mask="0x00000004" name="SIGN1" values="ADCIMCON1__SIGN1"/>
          <bitfield caption="AN1 Mode bit" mask="0x00000008" name="DIFF1" values="ADCIMCON1__DIFF1"/>
          <bitfield caption="AN2 Signed Data Mode bit" mask="0x00000010" name="SIGN2" values="ADCIMCON1__SIGN2"/>
          <bitfield caption="AN2 Mode bit" mask="0x00000020" name="DIFF2" values="ADCIMCON1__DIFF2"/>
          <bitfield caption="AN3 Signed Data Mode bit" mask="0x00000040" name="SIGN3" values="ADCIMCON1__SIGN3"/>
          <bitfield caption="AN3 Mode bit" mask="0x00000080" name="DIFF3" values="ADCIMCON1__DIFF3"/>
          <bitfield caption="AN4 Signed Data Mode bit" mask="0x00000100" name="SIGN4" values="ADCIMCON1__SIGN4"/>
          <bitfield caption="AN4 Mode bit" mask="0x00000200" name="DIFF4" values="ADCIMCON1__DIFF4"/>
          <bitfield caption="AN5 Signed Data Mode bit" mask="0x00000400" name="SIGN5" values="ADCIMCON1__SIGN5"/>
          <bitfield caption="AN5 Mode bit" mask="0x00000800" name="DIFF5" values="ADCIMCON1__DIFF5"/>
          <bitfield caption="AN6 Signed Data Mode bit" mask="0x00001000" name="SIGN6" values="ADCIMCON1__SIGN6"/>
          <bitfield caption="AN6 Mode bit" mask="0x00002000" name="DIFF6" values="ADCIMCON1__DIFF6"/>
          <bitfield caption="AN7 Signed Data Mode bit" mask="0x00004000" name="SIGN7" values="ADCIMCON1__SIGN7"/>
          <bitfield caption="AN7 Mode bit" mask="0x00008000" name="DIFF7" values="ADCIMCON1__DIFF7"/>
          <bitfield caption="AN8 Signed Data Mode bit" mask="0x00010000" name="SIGN8" values="ADCIMCON1__SIGN8"/>
          <bitfield caption="AN8 Mode bit" mask="0x00020000" name="DIFF8" values="ADCIMCON1__DIFF8"/>
        </register>
        <register name="ADCIMCON2" offset="0x50" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield caption="AN19 Signed Data Mode bit" mask="0x00000040" name="SIGN19" values="ADCIMCON2__SIGN19"/>
          <bitfield caption="AN19 Mode bit" mask="0x00000080" name="DIFF19" values="ADCIMCON2__DIFF19"/>
          <bitfield caption="AN20 Signed Data Mode bit" mask="0x00000100" name="SIGN20" values="ADCIMCON2__SIGN20"/>
          <bitfield caption="AN20 Mode bit" mask="0x00000200" name="DIFF20" values="ADCIMCON2__DIFF20"/>
          <bitfield caption="AN21 Signed Data Mode bit" mask="0x00000400" name="SIGN21" values="ADCIMCON2__SIGN21"/>
          <bitfield caption="AN21 Mode bit" mask="0x00000800" name="DIFF21" values="ADCIMCON2__DIFF21"/>
          <bitfield caption="AN22 Signed Data Mode bit" mask="0x00001000" name="SIGN22" values="ADCIMCON2__SIGN22"/>
          <bitfield caption="AN22 Mode bit" mask="0x00002000" name="DIFF22" values="ADCIMCON2__DIFF22"/>
        </register>
        <register name="ADCGIRQEN1" offset="0x80" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield caption="ADC Global Interrupt Enable bit 0" mask="0x00000001" name="AGIEN0" values="ADCGIRQEN1__AGIEN0"/>
          <bitfield caption="ADC Global Interrupt Enable bit 1" mask="0x00000002" name="AGIEN1" values="ADCGIRQEN1__AGIEN1"/>
          <bitfield caption="ADC Global Interrupt Enable bit 2" mask="0x00000004" name="AGIEN2" values="ADCGIRQEN1__AGIEN2"/>
          <bitfield caption="ADC Global Interrupt Enable bit 3" mask="0x00000008" name="AGIEN3" values="ADCGIRQEN1__AGIEN3"/>
          <bitfield caption="ADC Global Interrupt Enable bit 4" mask="0x00000010" name="AGIEN4" values="ADCGIRQEN1__AGIEN4"/>
          <bitfield caption="ADC Global Interrupt Enable bit 5" mask="0x00000020" name="AGIEN5" values="ADCGIRQEN1__AGIEN5"/>
          <bitfield caption="ADC Global Interrupt Enable bit 6" mask="0x00000040" name="AGIEN6" values="ADCGIRQEN1__AGIEN6"/>
          <bitfield caption="ADC Global Interrupt Enable bit 7" mask="0x00000080" name="AGIEN7" values="ADCGIRQEN1__AGIEN7"/>
          <bitfield caption="ADC Global Interrupt Enable bit 8" mask="0x00000100" name="AGIEN8" values="ADCGIRQEN1__AGIEN8"/>
          <bitfield caption="ADC Global Interrupt Enable bit 19" mask="0x00080000" name="AGIEN19" values="ADCGIRQEN1__AGIEN19"/>
          <bitfield caption="ADC Global Interrupt Enable bit 20" mask="0x00100000" name="AGIEN20" values="ADCGIRQEN1__AGIEN20"/>
          <bitfield caption="ADC Global Interrupt Enable bit 21" mask="0x00200000" name="AGIEN21" values="ADCGIRQEN1__AGIEN21"/>
          <bitfield caption="ADC Global Interrupt Enable bit 22" mask="0x00400000" name="AGIEN22" values="ADCGIRQEN1__AGIEN22"/>
        </register>
        <register name="ADCCSS1" offset="0xa0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield caption="Analog Common Scan Select bits" mask="0x00000001" name="CSS0" values="ADCCSS1__CSS0"/>
          <bitfield caption="Analog Common Scan Select bits" mask="0x00000002" name="CSS1" values="ADCCSS1__CSS1"/>
          <bitfield caption="Analog Common Scan Select bits" mask="0x00000004" name="CSS2" values="ADCCSS1__CSS2"/>
          <bitfield caption="Analog Common Scan Select bits" mask="0x00000008" name="CSS3" values="ADCCSS1__CSS3"/>
          <bitfield caption="Analog Common Scan Select bits" mask="0x00000010" name="CSS4" values="ADCCSS1__CSS4"/>
          <bitfield caption="Analog Common Scan Select bits" mask="0x00000020" name="CSS5" values="ADCCSS1__CSS5"/>
          <bitfield caption="Analog Common Scan Select bits" mask="0x00000040" name="CSS6" values="ADCCSS1__CSS6"/>
          <bitfield caption="Analog Common Scan Select bits" mask="0x00000080" name="CSS7" values="ADCCSS1__CSS7"/>
          <bitfield caption="Analog Common Scan Select bits" mask="0x00000100" name="CSS8" values="ADCCSS1__CSS8"/>
          <bitfield caption="Analog Common Scan Select bits" mask="0x00080000" name="CSS19" values="ADCCSS1__CSS19"/>
          <bitfield caption="Analog Common Scan Select bits" mask="0x00100000" name="CSS20" values="ADCCSS1__CSS20"/>
          <bitfield caption="Analog Common Scan Select bits" mask="0x00200000" name="CSS21" values="ADCCSS1__CSS21"/>
          <bitfield caption="Analog Common Scan Select bits" mask="0x00400000" name="CSS22" values="ADCCSS1__CSS22"/>
        </register>
        <register name="ADCDSTAT1" offset="0xc0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="ARDY0" caption="" mask="0x1"/>
          <bitfield name="ARDY1" caption="" mask="0x2"/>
          <bitfield name="ARDY2" caption="" mask="0x4"/>
          <bitfield name="ARDY3" caption="" mask="0x8"/>
          <bitfield name="ARDY4" caption="" mask="0x10"/>
          <bitfield name="ARDY5" caption="" mask="0x20"/>
          <bitfield name="ARDY6" caption="" mask="0x40"/>
          <bitfield name="ARDY7" caption="" mask="0x80"/>
          <bitfield name="ARDY8" caption="" mask="0x100"/>
          <bitfield name="ARDY19" caption="" mask="0x00080000"/>
          <bitfield name="ARDY20" caption="" mask="0x00100000"/>
          <bitfield name="ARDY21" caption="" mask="0x00200000"/>
          <bitfield name="ARDY22" caption="" mask="0x00400000"/>
        </register>
        <register name="ADCCMPEN1" offset="0xe0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CMPE0" caption="" mask="0x1"/>
          <bitfield name="CMPE1" caption="" mask="0x2"/>
          <bitfield name="CMPE2" caption="" mask="0x4"/>
          <bitfield name="CMPE3" caption="" mask="0x8"/>
          <bitfield name="CMPE4" caption="" mask="0x10"/>
          <bitfield name="CMPE5" caption="" mask="0x20"/>
          <bitfield name="CMPE6" caption="" mask="0x40"/>
          <bitfield name="CMPE7" caption="" mask="0x80"/>
          <bitfield name="CMPE8" caption="" mask="0x100"/>
          <bitfield name="CMPE19" caption="" mask="0x80000"/>
          <bitfield name="CMPE20" caption="" mask="0x100000"/>
          <bitfield name="CMPE21" caption="" mask="0x200000"/>
          <bitfield name="CMPE22" caption="" mask="0x400000"/>
        </register>
