zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
        <register name="ADCSYSCFG0" offset="0x700" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield mask="0x00000001" name="AN0"/>
          <bitfield mask="0x00000002" name="AN1"/>
          <bitfield mask="0x00000004" name="AN2"/>
          <bitfield mask="0x00000008" name="AN3"/>
          <bitfield mask="0x00000010" name="AN4"/>
          <bitfield mask="0x00000020" name="AN5"/>
          <bitfield mask="0x00000040" name="AN6"/>
          <bitfield mask="0x00000080" name="AN7"/>
          <bitfield mask="0x00000100" name="AN8"/>
          <bitfield mask="0x00080000" name="AN19"/>
          <bitfield mask="0x00100000" name="AN20"/>
          <bitfield mask="0x00200000" name="AN21"/>
          <bitfield mask="0x00400000" name="AN22"/>
        </register>
        <register name="ADCDATA0" offset="0xa00" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCDATA1" offset="0xa10" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCDATA2" offset="0xa20" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCDATA3" offset="0xa30" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCDATA4" offset="0xa40" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCDATA5" offset="0xa50" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCDATA6" offset="0xa60" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCDATA7" offset="0xa70" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCDATA8" offset="0xa80" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCDATA19" offset="0xb30" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCDATA20" offset="0xb40" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCDATA21" offset="0xb50" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCDATA22" offset="0xb60" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCCON1CLR" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCCON1SET" offset="0x8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCCON1INV" offset="0xc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADCCON2CLR" offset="0x14" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCCON2SET" offset="0x18" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCCON2INV" offset="0x1c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADCCON3CLR" offset="0x24" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCCON3SET" offset="0x28" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCCON3INV" offset="0x2c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADCIMOD1CLR" offset="0x44" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCIMOD1SET" offset="0x48" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCIMOD1INV" offset="0x4c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADCGIRQEN1CLR" offset="0x84" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCGIRQEN1SET" offset="0x88" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCGIRQEN1INV" offset="0x8c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADCCSS1CLR" offset="0xa4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCCSS1SET" offset="0xa8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCCSS1INV" offset="0xac" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADCDSTAT1CLR" offset="0xc4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCDSTAT1SET" offset="0xc8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCDSTAT1INV" offset="0xcc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
