zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
        <register name="ADCCNTBCLR" offset="0x324" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCCNTBSET" offset="0x328" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCCNTBINV" offset="0x32c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADCDMABCLR" offset="0x334" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCDMABSET" offset="0x338" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCDMABINV" offset="0x33c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADCTRGSNSCLR" offset="0x344" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCTRGSNSSET" offset="0x348" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCTRGSNSINV" offset="0x34c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADC0TIMECLR" offset="0x354" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADC0TIMESET" offset="0x358" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADC0TIMEINV" offset="0x35c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADCEISTAT1CLR" offset="0x3e4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCEISTAT1SET" offset="0x3e8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCEISTAT1INV" offset="0x3ec" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADCANLCTLCLR" offset="0x404" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCANLCTLSET" offset="0x408" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCANLCTLINV" offset="0x40c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADCFGSHRCLR" offset="0x674" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCFGSHRSET" offset="0x678" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCFGSHRINV" offset="0x67c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADCSVCONCLR" offset="0x684" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCSVCONSET" offset="0x688" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCSVCONINV" offset="0x68c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADCSYSCFG0CLR" offset="0x704" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCSYSCFG0SET" offset="0x708" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCSYSCFG0INV" offset="0x70c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
      </register-group>
      <value-group caption="DMA to System RAM Buffer Length Size bits" name="ADCCON1__DMABL">
        <value caption="Allocates 128 locations in system memory to each analog input" name="128_DMABL" value="0x7"/>
        <value caption="Allocates 64 locations in system memory to each analog input" name="64_DMABL" value="0x6"/>
        <value caption="Allocates 32 locations in system memory to each analog input" name="32_DMABL" value="0x5"/>
        <value caption="Allocates 16 locations in system memory to each analog input" name="16_DMABL" value="0x4"/>
        <value caption="Allocates 8 locations in system memory to each analog input" name="8_DMABL" value="0x3"/>
        <value caption="Allocates 4 locations in system memory to each analog input" name="4_DMABL" value="0x2"/>
        <value caption="Allocates 2 locations in system memory to each analog input" name="2_DMABL" value="0x1"/>
        <value caption="Allocates 1 location in system memory to each analog input" name="1_DMABL" value="0x0"/>
      </value-group>
      <value-group caption="Scan Trigger High Level/Positive Edge Sensitivity bit" name="ADCCON1__STRGLVL">
        <value caption="Scan trigger is high level sensitive. Once STRIG mode is selected the scan trigger will continue for all selected analog inputs" name="SCTRIG_HIGH" value="0x1"/>
        <value caption="Scan trigger is positive edge sensitive. Once STRIG mode is selected only a single scan trigger will be generated which will complete the scan of all selected analog inputs. (TRGSRCx in the ADCTRGx register)" name="SCTRIG_POSEDGE" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Vector Shift bits" name="ADCCON1__IRQVS">
        <value caption="Shift x left 7 bit position" name="SHL_7" value="0x7"/>
        <value caption="Shift x left 6 bit position" name="SHL_6" value="0x6"/>
        <value caption="Shift x left 5 bit position" name="SHL_5" value="0x5"/>
        <value caption="Shift x left 4 bit position" name="SHL_4" value="0x4"/>
        <value caption="Shift x left 3 bit position" name="SHL_3" value="0x3"/>
        <value caption="Shift x left 2 bit position" name="SHL_2" value="0x2"/>
        <value caption="Shift x left 1 bit position" name="SHL_1" value="0x1"/>
        <value caption="Shift x left 0 bit position" name="SHL_0" value="0x0"/>
      </value-group>
