zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS2">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN2" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN2" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS3">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN3" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN3" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS4">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN4" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN4" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS5">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN5" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN5" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS6">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN6" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN6" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS7">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN7" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN7" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS8">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN8" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN8" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS19">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN19" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN19" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS20">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN20" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN20" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS21">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN21" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN21" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS22">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN22" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN22" value="0x0"/>
      </value-group>
      <value-group caption="AN0 Signed Data Mode bit" name="ADCIMCON1__SIGN0">
        <value caption="AN0 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN0 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
      <value-group caption="AN0 Mode bit" name="ADCIMCON1__DIFF0">
        <value caption="Selects AN0 differential input pair as AN0+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN0 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
      <value-group caption="AN1 Signed Data Mode bit" name="ADCIMCON1__SIGN1">
        <value caption="AN1 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN1 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
      <value-group caption="AN1 Mode bit" name="ADCIMCON1__DIFF1">
        <value caption="Selects AN1 differential input pair as AN1+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN1 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
      <value-group caption="AN2 Signed Data Mode bit" name="ADCIMCON1__SIGN2">
        <value caption="AN2 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN2 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
      <value-group caption="AN2 Mode bit" name="ADCIMCON1__DIFF2">
        <value caption="Selects AN2 differential input pair as AN2+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN2 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
      <value-group caption="AN3 Signed Data Mode bit" name="ADCIMCON1__SIGN3">
        <value caption="AN3 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN3 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
      <value-group caption="AN3 Mode bit" name="ADCIMCON1__DIFF3">
        <value caption="Selects AN3 differential input pair as AN3+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN3 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
