zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
      <value-group caption="AN4 Signed Data Mode bit" name="ADCIMCON1__SIGN4">
        <value caption="AN4 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN4 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
      <value-group caption="AN4 Mode bit" name="ADCIMCON1__DIFF4">
        <value caption="Selects AN4 differential input pair as AN4+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN4 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
      <value-group caption="AN5 Signed Data Mode bit" name="ADCIMCON1__SIGN5">
        <value caption="AN5 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN5 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
      <value-group caption="AN5 Mode bit" name="ADCIMCON1__DIFF5">
        <value caption="Selects AN5 differential input pair as AN5+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN5 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
      <value-group caption="AN6 Signed Data Mode bit" name="ADCIMCON1__SIGN6">
        <value caption="AN6 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN6 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
      <value-group caption="AN6 Mode bit" name="ADCIMCON1__DIFF6">
        <value caption="Selects AN6 differential input pair as AN6+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN6 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
      <value-group caption="AN7 Signed Data Mode bit" name="ADCIMCON1__SIGN7">
        <value caption="AN7 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN7 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
      <value-group caption="AN7 Mode bit" name="ADCIMCON1__DIFF7">
        <value caption="Selects AN7 differential input pair as AN7+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN7 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
      <value-group caption="AN8 Signed Data Mode bit" name="ADCIMCON1__SIGN8">
        <value caption="AN8 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN8 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
      <value-group caption="AN 8 Mode bit" name="ADCIMCON1__DIFF8">
        <value caption="Selects AN8 differential input pair as AN8+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN8 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
      <value-group caption="AN19 Signed Data Mode bit" name="ADCIMCON2__SIGN19">
        <value caption="AN19 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN19 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
      <value-group caption="AN19 Mode bit" name="ADCIMCON2__DIFF19">
        <value caption="Selects AN19 differential input pair as AN19+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN19 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
      <value-group caption="AN20 Signed Data Mode bit" name="ADCIMCON2__SIGN20">
        <value caption="AN20 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN20 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
      <value-group caption="AN20 Mode bit" name="ADCIMCON2__DIFF20">
        <value caption="Selects AN20 differential input pair as AN20+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN20 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
      <value-group caption="AN21 Signed Data Mode bit" name="ADCIMCON2__SIGN21">
        <value caption="AN21 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN21 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
      <value-group caption="AN21 Mode bit" name="ADCIMCON2__DIFF21">
        <value caption="Selects AN21 differential input pair as AN21+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN21 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
      <value-group caption="AN22 Signed Data Mode bit" name="ADCIMCON2__SIGN22">
        <value caption="AN22 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN22 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
      <value-group caption="AN22 Mode bit" name="ADCIMCON2__DIFF22">
        <value caption="Selects AN22 differential input pair as AN22+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN22 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN0">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="ENABLED" value="0x1"/>
        <value caption="Interrupts are disabled" name="DISABLED" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN1">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="ENABLED" value="0x1"/>
        <value caption="Interrupts are disabled" name="DISABLED" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN2">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="ENABLED" value="0x1"/>
        <value caption="Interrupts are disabled" name="DISABLED" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN3">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="ENABLED" value="0x1"/>
        <value caption="Interrupts are disabled" name="DISABLED" value="0x0"/>
      </value-group>
