zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
        <register name="SYSKEY" offset="0xd0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SYSKEY" caption="System Key" mask="0xffffffff"/>
        </register>
        <register name="PMD1" offset="0xe0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DACMD" caption="DAC Module Disable" mask="0x20"/>
          <bitfield name="ACMD" caption="AC Module Disable" mask="0x40"/>
          <bitfield name="ADCMD" caption="ADC Controller Module Disable" mask="0x80"/>
          <bitfield name="ADCSARMD" caption="ADC SAR Core Module Disable" mask="0x100"/>
          <bitfield name="CVDMD" caption="ADC CVD Module Disable" mask="0x200"/>
          <bitfield name="ADCSARSHRMD" caption="Shared ADC SAR Core Module Disable" mask="0x400"/>
          <bitfield name="RTCCMD" caption="RTCC Module Disable" mask="0x10000"/>
          <bitfield name="SQIMD" caption="SQI Module Disable" mask="0x20000000"/>
        </register>
        <register name="PMD2" offset="0xf0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="REFO5MD" caption="Reference (Clock) Out 5 Module Disable" mask="0x1000000"/>
          <bitfield name="REFO6MD" caption="Reference (Clock) Out 6 Module Disable" mask="0x2000000"/>
          <bitfield name="REFO1MD" caption="Reference (Clock) Out 1 Module Disable" mask="0x10000000"/>
          <bitfield name="REFO2MD" caption="Reference (Clock) Out 2 Module Disable" mask="0x20000000"/>
          <bitfield name="REFO3MD" caption="Reference (Clock) Out 3 Module Disable" mask="0x40000000"/>
          <bitfield name="REFO4MD" caption="Reference (Clock) Out 4 Module Disable" mask="0x80000000"/>
        </register>
        <register name="PMD3" offset="0x100" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SER0MD" caption="SERCOM0 Module Disable" mask="0x1"/>
          <bitfield name="SER1MD" caption="SERCOM1 Module Disable" mask="0x2"/>
          <bitfield name="SER2MD" caption="SERCOM2 Module Disable" mask="0x4"/>
          <bitfield name="SER3MD" caption="SERCOM3 Module Disable" mask="0x8"/>
          <bitfield name="SER4MD" caption="SERCOM4 Module Disable" mask="0x10"/>
          <bitfield name="SER5MD" caption="SERCOM5 Module Disable" mask="0x20"/>
          <bitfield name="SER6MD" caption="SERCOM6 Module Disable" mask="0x40"/>
          <bitfield name="QEIMD" caption="QEI Module Disable" mask="0x80"/>
          <bitfield name="TC0MD" caption="TC0 Module Disable" mask="0x100"/>
          <bitfield name="TC1MD" caption="TC1 Module Disable" mask="0x200"/>
          <bitfield name="TC2MD" caption="TC2 Module Disable" mask="0x400"/>
          <bitfield name="TC3MD" caption="TC3 Module Disable" mask="0x800"/>
          <bitfield name="TC4MD" caption="TC4 Module Disable" mask="0x1000"/>
          <bitfield name="TC5MD" caption="TC5 Module Disable" mask="0x2000"/>
          <bitfield name="TC6MD" caption="TC6 Module Disable" mask="0x4000"/>
          <bitfield name="TC7MD" caption="TC7 Module Disable" mask="0x8000"/>
          <bitfield name="TC8MD" caption="TC8 Module Disable" mask="0x10000"/>
          <bitfield name="TC9MD" caption="TC9 Module Disable" mask="0x20000"/>
          <bitfield name="TCC0MD" caption="TCC0 Module Disable" mask="0x100000"/>
          <bitfield name="TCC1MD" caption="TCC1 Module Disable" mask="0x200000"/>
          <bitfield name="TCC2MD" caption="TCC2 Module Disable" mask="0x400000"/>
          <bitfield name="USBMD" caption="USB Module Disable" mask="0x1000000"/>
          <bitfield name="ETHMD" caption="Ethernet Module Disable" mask="0x2000000"/>
          <bitfield name="CAN0MD" caption="CAN0 Module Disable" mask="0x4000000"/>
          <bitfield name="CAN1MD" caption="CAN1 Module Disable" mask="0x8000000"/>
        </register>
        <register name="MISCSTAT" offset="0x120" rw="RW" size="4" access-size="4" initval="0x01000081" caption="">
          <bitfield name="CLDORDY" caption="CLDO Ready" mask="0x200"/>
          <bitfield name="CM4SWRST_EN" caption="CM4 SW Reset Enable" mask="0x800"/>
        </register>
        <register name="ID" offset="0x160" rw="R" size="4" access-size="4" initval="0x00000000" caption="Device ID"/>
        <register name="BCFG0" offset="0x200" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="PCSCMODE" caption="PCHE Single cache Mode" mask="0x2"/>
          <bitfield name="CP" caption="Boot Code Protect" mask="0x10000000"/>
          <bitfield name="SIGN" caption="Flash SIGN" mask="0x20000000"/>
          <bitfield name="BINFOVALID0" caption="First 256-bit BCFG information Valid" mask="0x80000000"/>
        </register>
        <register name="CFGCON0CLR" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="CFGCON0SET" offset="0x8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="CFGCON0INV" offset="0xc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="CFGCON1CLR" offset="0x14" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="CFGCON1SET" offset="0x18" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="CFGCON1INV" offset="0x1c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="CFGCON2CLR" offset="0x24" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="CFGCON2SET" offset="0x28" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="CFGCON2INV" offset="0x2c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="CFGCON4CLR" offset="0x44" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="CFGCON4SET" offset="0x48" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
