zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
        <register caption="" name="UPLLCONCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x34"> </register>
        <register caption="" name="UPLLCONSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x38"> </register>
        <register caption="" name="UPLLCONINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x3C"> </register>
        <register caption="EPLL CONTROL REGISTER" initval="0x80000808" name="EPLLCON" offset="0x40" rw="RW" size="4">
          <bitfield caption="EPLL Bandwidth Select" mask="0x00000007" name="EPLLBSWSEL" values="EPLLCON__EPLLBWSEL"/>
          <bitfield caption="EPLL Power Down Register bit" mask="0x00000008" name="EPLLPWDN" values="EPLLCON__EPLLPWDN"/>
          <bitfield caption="First Post Divide Value in between 1 and 63, value of 0 is unused." mask="0x3f0" name="EPLLPOSTDIV1"/>
          <bitfield caption="Ethernet PLL Force Lock" mask="0x00000400" name="EPLLFLOCK" values="EPLLCON__EPLLFLOCK"/>
          <bitfield caption="Ethernet PLL Reset" mask="0x00000800" name="EPLLRST" values="EPLLCON__EPLLRESET"/>
          <bitfield caption="PLL feedback divider in between 16 and 1023, values of 0 to 15 are unused" mask="0x003FF000" name="EPLLFBDIV"/>
          <bitfield caption="Reference Frequency Divide in between 1 and 63, value of 0 is unused." mask="0x00FC00000" name="EPLLREFDIV"/>
          <bitfield caption="Ethernet Clock Out pin Enable" mask="0x10000000" name="ECLKOUTEN" values="EPLLCON__EPLLCLKOUTEN"/>
          <bitfield caption="The input clock REF bypasses PLL to PLLOUTx" mask="0x80000000" name="EPLL_BYP" values="EPLLCON__EPLL_BYP"/>
        </register>
        <register caption="" name="EPLLCONCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x44"> </register>
        <register caption="" name="EPLLCONSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x48"> </register>
        <register caption="" name="EPLLCONINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x4C"> </register>
        <register caption="APLL CONTROL REGISTER" initval="0x00000000" name="APLLCON" offset="0x50" rw="RW" size="4">
          <bitfield caption="EPLL Post Divider bits for controlling second PLL clock output, value of 0 is unused." mask="0x0000003f" name="EPLLPOSTIDIV2"/>
        </register>
        <register caption="" name="APLLCONCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x54"> </register>
        <register caption="" name="APLLCONSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x58"> </register>
        <register caption="" name="APLLCONINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x5C"> </register>
        <register caption="REFERENCE OSCILLATOR 1 CONTROL REGISTER" initval="0x0" name="REFO1CON" offset="0xa0" rw="RW" size="4">
          <bitfield caption="Reference Clock Source Select bits" mask="0x0000000F" name="ROSEL" values="REFO1CON__ROSEL"/>
          <bitfield caption="Reference Clock Request Status bit" mask="0x00000100" name="ACTIVE" values="REFO1CON__ACTIVE"/>
          <bitfield caption="Clock RODIV/ROTRIM switch enabled." mask="0x00000200" name="DIVSWEN" values="REFO1CON__DIVSWEN"/>
          <bitfield caption="Reference Oscillator Run in Sleep bit" mask="0x00000800" name="RSLP" values="REFO1CON__RSLP"/>
          <bitfield caption="Reference Clock Output Enable bit" mask="0x00001000" name="OE" values="REFO1CON__OE"/>
          <bitfield caption="Peripheral Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="REFO1CON__SIDL"/>
          <bitfield caption="Freeze in Debug mode bit" mask="0x4000" name="FRZ" values="REFO1CON__FRZ"/>
          <bitfield caption="Output Enable bit" mask="0x00008000" name="ON" values="REFO1CON__ON"/>
          <bitfield caption="Reference Clock Divider bits" mask="0x7FFF0000" name="RODIV" values="REFO1CON__RODIV"/>
        </register>
        <register caption="" name="REFO1CONCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xa4"> </register>
        <register caption="" name="REFO1CONSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xa8"> </register>
        <register caption="" name="REFO1CONINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xaC"> </register>
        <register caption="REFERENCE OSCILLATOR 1 TRIM REGISTER" initval="0x0" name="REFO1TRIM" offset="0xb0" rw="RW" size="4">
          <bitfield caption="Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock" mask="0xFF800000" name="ROTRIM" values="REFO1TRIM__ROTRIM"/>
        </register>
        <register caption="" name="REFO1TRIMCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xb4"> </register>
        <register caption="" name="REFO1TRIMSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xb8"> </register>
        <register caption="" name="REFO1TRIMINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xbC"> </register>
        <register caption="REFERENCE OSCILLATOR 2 CONTROL REGISTER" initval="0x0" name="REFO2CON" offset="0xc0" rw="RW" size="4">
          <bitfield caption="Reference Clock Source Select bits" mask="0x0000000F" name="ROSEL" values="REFO2CON__ROSEL"/>
          <bitfield caption="Reference Clock Request Status bit" mask="0x00000100" name="ACTIVE" values="REFO2CON__ACTIVE"/>
          <bitfield caption="Clock RODIV/ROTRIM switch enabled." mask="0x00000200" name="DIVSWEN" values="REFO2CON__DIVSWEN"/>
          <bitfield caption="Reference Oscillator Run in Sleep bit" mask="0x00000800" name="RSLP" values="REFO2CON__RSLP"/>
          <bitfield caption="Reference Clock Output Enable bit" mask="0x00001000" name="OE" values="REFO2CON__OE"/>
          <bitfield caption="Peripheral Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="REFO2CON__SIDL"/>
          <bitfield caption="Freeze in Debug mode bit" mask="0x4000" name="FRZ" values="REFO2CON__FRZ"/>
          <bitfield caption="Output Enable bit" mask="0x00008000" name="ON" values="REFO2CON__ON"/>
          <bitfield caption="Reference Clock Divider bits" mask="0x7FFF0000" name="RODIV" values="REFO2CON__RODIV"/>
        </register>
        <register caption="" name="REFO2CONCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xc4"> </register>
        <register caption="" name="REFO2CONSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xc8"> </register>
        <register caption="" name="REFO2CONINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xcc"> </register>
        <register caption="REFERENCE OSCILLATOR 2 TRIM REGISTER" initval="0x0" name="REFO2TRIM" offset="0xd0" rw="RW" size="4">
          <bitfield caption="Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock" mask="0xFF800000" name="ROTRIM" values="REFO2TRIM__ROTRIM"/>
        </register>
        <register caption="" name="REFO2TRIMCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xd4"> </register>
        <register caption="" name="REFO2TRIMSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xd8"> </register>
        <register caption="" name="REFO2TRIMINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xdC"> </register>
        <register caption="REFERENCE OSCILLATOR 3 CONTROL REGISTER" initval="0x0" name="REFO3CON" offset="0xe0" rw="RW" size="4">
          <bitfield caption="Reference Clock Source Select bits" mask="0x0000000F" name="ROSEL" values="REFO3CON__ROSEL"/>
          <bitfield caption="Reference Clock Request Status bit" mask="0x00000100" name="ACTIVE" values="REFO3CON__ACTIVE"/>
          <bitfield caption="Clock RODIV/ROTRIM switch enabled." mask="0x00000200" name="DIVSWEN" values="REFO3CON__DIVSWEN"/>
          <bitfield caption="Reference Oscillator Run in Sleep bit" mask="0x00000800" name="RSLP" values="REFO3CON__RSLP"/>
          <bitfield caption="Reference Clock Output Enable bit" mask="0x00001000" name="OE" values="REFO3CON__OE"/>
          <bitfield caption="Peripheral Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="REFO3CON__SIDL"/>
          <bitfield caption="Freeze in Debug mode bit" mask="0x4000" name="FRZ" values="REFO3CON__FRZ"/>
          <bitfield caption="Output Enable bit" mask="0x00008000" name="ON" values="REFO3CON__ON"/>
          <bitfield caption="Reference Clock Divider bits" mask="0x7FFF0000" name="RODIV" values="REFO3CON__RODIV"/>
        </register>
        <register caption="" name="REFO3CONCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xe4"> </register>
        <register caption="" name="REFO3CONSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xe8"> </register>
        <register caption="" name="REFO3CONINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xeC"> </register>
        <register caption="REFERENCE OSCILLATOR 3 TRIM REGISTER" initval="0x0" name="REFO3TRIM" offset="0xf0" rw="RW" size="4">
          <bitfield caption="Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock" mask="0xFF800000" name="ROTRIM" values="REFO3TRIM__ROTRIM"/>
        </register>
        <register caption="" name="REFO3TRIMCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xf4"> </register>
        <register caption="" name="REFO3TRIMSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xf8"> </register>
        <register caption="" name="REFO3TRIMINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xfC"> </register>
        <register caption="REFERENCE OSCILLATOR 4 CONTROL REGISTER" initval="0x0" name="REFO4CON" offset="0x100" rw="RW" size="4">
          <bitfield caption="Reference Clock Source Select bits" mask="0x0000000F" name="ROSEL" values="REFO4CON__ROSEL"/>
          <bitfield caption="Reference Clock Request Status bit" mask="0x00000100" name="ACTIVE" values="REFO4CON__ACTIVE"/>
          <bitfield caption="Clock RODIV/ROTRIM switch enabled." mask="0x00000200" name="DIVSWEN" values="REFO4CON__DIVSWEN"/>
          <bitfield caption="Reference Oscillator Run in Sleep bit" mask="0x00000800" name="RSLP" values="REFO4CON__RSLP"/>
          <bitfield caption="Reference Clock Output Enable bit" mask="0x00001000" name="OE" values="REFO4CON__OE"/>
          <bitfield caption="Peripheral Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="REFO4CON__SIDL"/>
          <bitfield caption="Freeze in Debug mode bit" mask="0x4000" name="FRZ" values="REFO4CON__FRZ"/>
          <bitfield caption="Output Enable bit" mask="0x00008000" name="ON" values="REFO4CON__ON"/>
          <bitfield caption="Reference Clock Divider bits" mask="0x7FFF0000" name="RODIV" values="REFO4CON__RODIV"/>
        </register>
