zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
      <value-group caption="EPLL Power Down Register bit" name="EPLLCON__EPLLPWDN">
        <value caption="EPLL is powered down" name="PLL_OFF" value="0x1"/>
        <value caption="EPLL is active" name="PLL_ON" value="0x0"/>
      </value-group>
      <value-group caption="ESB PLL Force Lock" name="EPLLCON__EPLLFLOCK">
        <value caption="Force the EPLL lock signal to be asserted" name="ASSERT" value="0x1"/>
        <value caption="Do not force the SPLL lock signal to be asserted" name="NO_ASSERT" value="0x0"/>
      </value-group>
      <value-group caption="Ethernet PLL Reset" name="EPLLCON__EPLLRESET">
        <value caption="Assert the reset to the EPLL" name="ASSERT" value="0x1"/>
        <value caption="De-assert the reset to the EPLL" name="NO_ASSERT" value="0x0"/>
      </value-group>
      <value-group caption="Ethernet Clock Out pin Enable" name="EPLLCON__EPLLCLKOUTEN">
        <value caption="ETH_CLK_OUT Pin is enabled" name="Enable" value="0x1"/>
        <value caption="ETH_CLK_OUT Pin is disabled" name="Disable" value="0x0"/>
      </value-group>
      <value-group caption="EPLL Bypass" name="EPLLCON__EPLL_BYP">
        <value caption="EPLL Bypass; when this bit is set, the input clock REF bypasses PLL to PLLOUTx" name="BYPASS" value="0x1"/>
        <value caption="The input clock dont bypass" name="NOT_BYPASS" value="0x0"/>
      </value-group>
      <value-group caption="Reference Clock Source Select bits" name="REFO1CON__ROSEL">
        <value caption="REFI Pin" name="REFCLKI" value="0xB"/>
        <value caption="System clock (reference clock reflects any device clock switching)" name="SYSCLK" value="0xA"/>
        <value caption="Peripheral clock 1 (reference clock reflects any peripheral clock switching)" name="PBCLK1" value="0x9"/>
        <value caption="Ethernet PLL1 (Clock-1)" name="EPLL1" value="0x8"/>
        <value caption="System PLL3 (Clock-3)" name="SPLL3" value="0x7"/>
        <value caption="USB PLL" name="USBPLL" value="0x6"/>
        <value caption="Ethernet PLL2 (Clock-2)" name="EPLL2" value="0x5"/>
        <value caption="LPRC" name="LPRC" value="0x4"/>
        <value caption="SOSC" name="SOSC" value="0x3"/>
        <value caption="POSC" name="POSC" value="0x2"/>
        <value caption="System PLL1 (Clock-1)" name="SPLL1" value="0x1"/>
        <value caption="FRC" name="FRC" value="0x0"/>
      </value-group>
      <value-group caption="Reference Clock Request Status bit" name="REFO1CON__ACTIVE">
        <value caption="Reference clock request is active (User should not update this REFOCON register)" name="ACTIVE" value="0x1"/>
        <value caption="Reference clock request is not active (User can update this REFOCON register)" name="NOT_ACTIVE" value="0x0"/>
      </value-group>
      <value-group caption="Clock RODIV/ROTRIM switch enabled." name="REFO1CON__DIVSWEN">
        <value caption="Clock Divider Switching currently in progress." name="SWINPROGRESS" value="0x1"/>
        <value caption="Clock Divider Switch has completed." name="SWCOMPLETE" value="0x0"/>
      </value-group>
      <value-group caption="Reference Oscillator Run in Sleep bit" name="REFO1CON__RSLP">
        <value caption="Reference Oscillator output continues to run in Sleep" name="RSLP" value="0x1"/>
        <value caption="Reference Oscillator output is disabled in Sleep" name="NO_RSLP" value="0x0"/>
      </value-group>
      <value-group caption="Reference Clock Output Enable bit" name="REFO1CON__OE">
        <value caption="Reference clock is driven out on REFO1 pin" name="REFO1_OE" value="0x1"/>
        <value caption="Reference clock is not driven out on REFO1 pin." name="NO_REFO1_OE" value="0x0"/>
      </value-group>
      <value-group caption="Peripheral Stop in Idle Mode bit" name="REFO1CON__SIDL">
        <value caption="Discontinue module operation when device enters Idle mode" name="SIDL" value="0x1"/>
        <value caption="Continue module operation in Idle mode" name="NO_SIDL" value="0x0"/>
      </value-group>
      <value-group caption="Freeze in Debug mode bit" name="REFO1CON__FRZ">
        <value caption="When emulator is in Debug mode, module freezes operation" name="FRZ" value="0x1"/>
        <value caption="When emulator is in Debug mode, module continues operation" name="NO_FRZ" value="0x0"/>
      </value-group>
      <value-group caption="Output Enable bit" name="REFO1CON__ON">
        <value caption="Reference Oscillator Module enabled" name="ON" value="0x1"/>
        <value caption="Reference Oscillator Module disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Reference Clock Divider bits" name="REFO1CON__RODIV">
        <value caption="REFO1 clock is Base clock frequency divided by 65,534 (32,767 *2)" name="65K" value="0x7fff"/>
        <value caption="REFO1 clock is Base clock frequency divided by 4 (2*2)" name="4" value="0x2"/>
        <value caption="REFO1 clock is Base clock frequency divided by 2 (1*2)" name="2" value="0x1"/>
        <value caption="REFO1 clock is same frequency as Base clock (no divider)" name="NONE" value="0x0"/>
      </value-group>
      <value-group caption="Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock" name="REFO1TRIM__ROTRIM">
        <value caption="0/512 (0.0) divisor added to RODIV value" name="ZERO" value="0x0"/>
        <value caption="1/512 (0.001953125) divisor added to RODIV value" name="1" value="0x1"/>
        <value caption="2/512 (0.00390625) divisor added to RODIV value" name="2" value="0x2"/>
        <value caption="256/512 (0.5000) divisor added to RODIV value" name="256" value="0x100"/>
        <value caption="511/512 (0.998046875) divisor added to RODIV value" name="511" value="0x1ff"/>
      </value-group>
      <value-group caption="Reference Clock Source Select bits" name="REFO2CON__ROSEL">
        <value caption="REFI Pin" name="REFCLKI" value="0xB"/>
        <value caption="System clock (reference clock reflects any device clock switching)" name="SYSCLK" value="0xA"/>
        <value caption="Peripheral clock 1 (reference clock reflects any peripheral clock switching)" name="PBCLK1" value="0x9"/>
        <value caption="Ethernet PLL1 (Clock-1)" name="EPLL1" value="0x8"/>
        <value caption="System PLL3 (Clock-3)" name="SPLL3" value="0x7"/>
        <value caption="USB PLL" name="USBPLL" value="0x6"/>
        <value caption="Ethernet PLL2 (Clock-2)" name="EPLL2" value="0x5"/>
        <value caption="LPRC" name="LPRC" value="0x4"/>
        <value caption="SOSC" name="SOSC" value="0x3"/>
        <value caption="POSC" name="POSC" value="0x2"/>
        <value caption="System PLL1 (Clock-1)" name="SPLL1" value="0x1"/>
        <value caption="FRC" name="FRC" value="0x0"/>
      </value-group>
      <value-group caption="Reference Clock Request Status bit" name="REFO2CON__ACTIVE">
        <value caption="Reference clock request is active (User should not update this REFOCON register)" name="ACTIVE" value="0x1"/>
        <value caption="Reference clock request is not active (User can update this REFOCON register)" name="NOT_ACTIVE" value="0x0"/>
      </value-group>
      <value-group caption="Clock RODIV/ROTRIM switch enabled." name="REFO2CON__DIVSWEN">
        <value caption="Clock Divider Switching currently in progress." name="SWINPROGRESS" value="0x1"/>
        <value caption="Clock Divider Switch has completed." name="SWCOMPLETE" value="0x0"/>
      </value-group>
      <value-group caption="Reference Oscillator Run in Sleep bit" name="REFO2CON__RSLP">
        <value caption="Reference Oscillator output continues to run in Sleep" name="RSLP" value="0x1"/>
        <value caption="Reference Oscillator output is disabled in Sleep" name="NO_RSLP" value="0x0"/>
      </value-group>
      <value-group caption="Reference Clock Output Enable bit" name="REFO2CON__OE">
        <value caption="Reference clock is driven out on REFO2 pin" name="REFO2_OE" value="0x1"/>
        <value caption="Reference clock is not driven out on REFO2 pin." name="NO_REFO2_OE" value="0x0"/>
      </value-group>
      <value-group caption="Peripheral Stop in Idle Mode bit" name="REFO2CON__SIDL">
        <value caption="Discontinue module operation when device enters Idle mode" name="SIDL" value="0x1"/>
        <value caption="Continue module operation in Idle mode" name="NO_SIDL" value="0x0"/>
      </value-group>
      <value-group caption="Freeze in Debug mode bit" name="REFO2CON__FRZ">
        <value caption="When emulator is in Debug mode, module freezes operation" name="FRZ" value="0x1"/>
        <value caption="When emulator is in Debug mode, module continues operation" name="NO_FRZ" value="0x0"/>
      </value-group>
