zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
        <register name="CVDSD2C3" offset="0x128" rw="RW" size="4" initval="0x00000000" caption="CVD SCAN DESCRIPTOR N CONTROL3 REGISTER">
          <bitfield name="SDCHGTIME" caption="Scan Descriptor Charge TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the CHARGE statedriving both the internal and external capacitor nodes, as well as the TX output(s)" mask="0x7F"/>
          <bitfield name="SDACQTIME" caption="Scan Descriptor Acquire TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the ACQUIRE stateto allow the ADC voltage to settle" mask="0x7F00"/>
          <bitfield name="CVDCPL" caption="Capacitor Voltage Divider (CVD) Setting bits" mask="0x70000"/>
          <bitfield name="CVDEN" caption=" Capacitive Voltage Division Enable bit" mask="0x80000"/>
          <bitfield name="SDMUT" caption="Scan Descriptor Mutual Mode1= Mutual Measurement Mode; TX outputs are part of CVD measurement and are driven0=No Mutual Measurement Mode; TX outputs are not part of CVD measurements" mask="0x1000000"/>
          <bitfield name="SDSELF" caption="Scan Descriptor Mutual Mode1= Self Measurement Mode; RX outputs are part of CVD measurement and are driven0= No Self Measurement; RX outputs are not part of CVD measurements" mask="0x2000000"/>
          <bitfield name="SDINTEN" caption="Scan Descriptor Interrupt Enable1= Scan Descriptor creates an interrupt if the accumulator threshold is met0= Scan descriptor does not create an interrupt" mask="0x4000000"/>
          <bitfield name="SDBUF" caption="Scan Descriptor CVD Buffer Enable1= Use the SOC's CVD Buffer macro to drive the party-line (shared ADC core input) rather than the RX outputs0= SOC's CVD Buffer macro not used to drive party-line (or doesn't exist)" mask="0x8000000"/>
          <bitfield name="SDEN" caption="Scan Descriptor Enable Mode00= Scan Descriptor Disabled01= Execute Scan Descriptor one time only, then clear the enable.10= Execute the Scan Descriptor, but keep enabled. Move on to next enabled descriptors.11= Execute the Scan Descriptor in a loop until a threshold match is detected, then clear the enable and move on tonext enabled descriptors." mask="0xC0000000"/>
        </register>
        <register name="CVDSD3C3" offset="0x138" rw="RW" size="4" initval="0x00000000" caption="CVD SCAN DESCRIPTOR N CONTROL3 REGISTER">
          <bitfield name="SDCHGTIME" caption="Scan Descriptor Charge TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the CHARGE statedriving both the internal and external capacitor nodes, as well as the TX output(s)" mask="0x7F"/>
          <bitfield name="SDACQTIME" caption="Scan Descriptor Acquire TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the ACQUIRE stateto allow the ADC voltage to settle" mask="0x7F00"/>
          <bitfield name="CVDCPL" caption="Capacitor Voltage Divider (CVD) Setting bits" mask="0x70000"/>
          <bitfield name="CVDEN" caption=" Capacitive Voltage Division Enable bit" mask="0x80000"/>
          <bitfield name="SDMUT" caption="Scan Descriptor Mutual Mode1= Mutual Measurement Mode; TX outputs are part of CVD measurement and are driven0=No Mutual Measurement Mode; TX outputs are not part of CVD measurements" mask="0x1000000"/>
          <bitfield name="SDSELF" caption="Scan Descriptor Mutual Mode1= Self Measurement Mode; RX outputs are part of CVD measurement and are driven0= No Self Measurement; RX outputs are not part of CVD measurements" mask="0x2000000"/>
          <bitfield name="SDINTEN" caption="Scan Descriptor Interrupt Enable1= Scan Descriptor creates an interrupt if the accumulator threshold is met0= Scan descriptor does not create an interrupt" mask="0x4000000"/>
          <bitfield name="SDBUF" caption="Scan Descriptor CVD Buffer Enable1= Use the SOC's CVD Buffer macro to drive the party-line (shared ADC core input) rather than the RX outputs0= SOC's CVD Buffer macro not used to drive party-line (or doesn't exist)" mask="0x8000000"/>
          <bitfield name="SDEN" caption="Scan Descriptor Enable Mode00= Scan Descriptor Disabled01= Execute Scan Descriptor one time only, then clear the enable.10= Execute the Scan Descriptor, but keep enabled. Move on to next enabled descriptors.11= Execute the Scan Descriptor in a loop until a threshold match is detected, then clear the enable and move on tonext enabled descriptors." mask="0xC0000000"/>
        </register>
        <register name="CVDSD0T2" offset="0x10C" rw="RW" size="4" initval="0x00000000" caption="CVD SCAN DESCRIPTOR N TIME2 REGISTER">
          <bitfield name="SDCONTIME" caption="Scan Descriptor Charge TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the CONVERT statewaiting for the ADC sample data. It must be ensured that the ADC will assert End-Of-Convert (EOC) before the CONVERT state timer expires." mask="0x7F"/>
          <bitfield name="SDPOLTIME" caption="Scan Descriptor Polarity TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the POLARITY statebefore taking the second polarity measurement of an RX/TX pair" mask="0x7F00"/>
          <bitfield name="SDOVRTIME" caption="Scan Descriptor Oversample TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the OVERSAMPstate before taking the next oversampling measurement of an RX/TX pair." mask="0x7F0000"/>
          <bitfield name="SDCHNTIME" caption="Scan Descriptor Channel TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the RXCHAN orTXCHAN state before moving to the next RX/TX pair" mask="0x7F000000"/>
        </register>
        <register name="CVDSD1T2" offset="0x11C" rw="RW" size="4" initval="0x00000000" caption="CVD SCAN DESCRIPTOR N TIME2 REGISTER">
          <bitfield name="SDCONTIME" caption="Scan Descriptor Charge TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the CONVERT statewaiting for the ADC sample data. It must be ensured that the ADC will assert End-Of-Convert (EOC) before the CONVERT state timer expires." mask="0x7F"/>
          <bitfield name="SDPOLTIME" caption="Scan Descriptor Polarity TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the POLARITY statebefore taking the second polarity measurement of an RX/TX pair" mask="0x7F00"/>
          <bitfield name="SDOVRTIME" caption="Scan Descriptor Oversample TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the OVERSAMPstate before taking the next oversampling measurement of an RX/TX pair." mask="0x7F0000"/>
          <bitfield name="SDCHNTIME" caption="Scan Descriptor Channel TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the RXCHAN orTXCHAN state before moving to the next RX/TX pair" mask="0x7F000000"/>
        </register>
        <register name="CVDSD2T2" offset="0x12C" rw="RW" size="4" initval="0x00000000" caption="CVD SCAN DESCRIPTOR N TIME2 REGISTER">
          <bitfield name="SDCONTIME" caption="Scan Descriptor Charge TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the CONVERT statewaiting for the ADC sample data. It must be ensured that the ADC will assert End-Of-Convert (EOC) before the CONVERT state timer expires." mask="0x7F"/>
          <bitfield name="SDPOLTIME" caption="Scan Descriptor Polarity TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the POLARITY statebefore taking the second polarity measurement of an RX/TX pair" mask="0x7F00"/>
          <bitfield name="SDOVRTIME" caption="Scan Descriptor Oversample TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the OVERSAMPstate before taking the next oversampling measurement of an RX/TX pair." mask="0x7F0000"/>
          <bitfield name="SDCHNTIME" caption="Scan Descriptor Channel TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the RXCHAN orTXCHAN state before moving to the next RX/TX pair" mask="0x7F000000"/>
        </register>
        <register name="CVDSD3T2" offset="0x13C" rw="RW" size="4" initval="0x00000000" caption="CVD SCAN DESCRIPTOR N TIME2 REGISTER">
          <bitfield name="SDCONTIME" caption="Scan Descriptor Charge TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the CONVERT statewaiting for the ADC sample data. It must be ensured that the ADC will assert End-Of-Convert (EOC) before the CONVERT state timer expires." mask="0x7F"/>
          <bitfield name="SDPOLTIME" caption="Scan Descriptor Polarity TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the POLARITY statebefore taking the second polarity measurement of an RX/TX pair" mask="0x7F00"/>
          <bitfield name="SDOVRTIME" caption="Scan Descriptor Oversample TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the OVERSAMPstate before taking the next oversampling measurement of an RX/TX pair." mask="0x7F0000"/>
          <bitfield name="SDCHNTIME" caption="Scan Descriptor Channel TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the RXCHAN orTXCHAN state before moving to the next RX/TX pair" mask="0x7F000000"/>
        </register>
