zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
      <value-group name="DMAC_CHPRILVL__PRILVL">
        <value name="LVL0" caption="Channel Priority Level 0 (Lowest Level)" value="0"/>
        <value name="LVL1" caption="Channel Priority Level 1" value="1"/>
        <value name="LVL2" caption="Channel Priority Level 2" value="2"/>
        <value name="LVL3" caption="Channel Priority Level 3 (Highest Level)" value="3"/>
      </value-group>
      <value-group name="DMAC_CHEVCTRL__EVACT">
        <value name="NOACT" caption="No action" value="0"/>
        <value name="TRIG" caption="Transfer and periodic transfer trigger" value="1"/>
        <value name="CTRIG" caption="Conditional transfer trigger" value="2"/>
        <value name="CBLOCK" caption="Conditional block transfer" value="3"/>
        <value name="SUSPEND" caption="Channel suspend operation" value="4"/>
        <value name="RESUME" caption="Channel resume operation" value="5"/>
        <value name="SSKIP" caption="Skip next block suspend action" value="6"/>
        <value name="INCPRI" caption="Increase priority" value="7"/>
      </value-group>
      <value-group name="DMAC_CHEVCTRL__EVOMODE">
        <value name="DEFAULT" caption="Block event output selection. Refer to BTCTRL.EVOSEL for available selections." value="0"/>
        <value name="TRIGACT" caption="Ongoing trigger action" value="1"/>
      </value-group>
    </module>
    <module name="DMT" id="01520" version="1.0" caption="Dead Man Timer">
      <register-group name="DMT" caption="Dead Man Timer">
        <register name="DMTCON" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="ON" caption="" mask="0x8000"/>
        </register>
        <register name="DMTPRECLR" offset="0x10" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="STEP1" caption="" mask="0xff00"/>
        </register>
        <register name="DMTCLR" offset="0x20" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="STEP2" caption="" mask="0xff"/>
        </register>
        <register name="DMTSTAT" offset="0x30" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="WINOPN" caption="" mask="0x1"/>
          <bitfield name="DMTEVENT" caption="" mask="0x20"/>
          <bitfield name="BAD2" caption="" mask="0x40"/>
          <bitfield name="BAD1" caption="" mask="0x80"/>
        </register>
        <register name="DMTCNT" offset="0x40" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="COUNTER" caption="" mask="0xffffffff"/>
        </register>
        <register name="DMTHOLDREG" offset="0x50" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="UPRCNT" caption="" mask="0xffff"/>
        </register>
        <register name="DMTPSCNT" offset="0x60" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="PSCNT" caption="" mask="0xffffffff"/>
        </register>
        <register name="DMTPSINTV" offset="0x70" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="PSINTV" caption="" mask="0xffffffff"/>
        </register>
        <register name="DMTCONCLR" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="DMTCONSET" offset="0x8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="DMTCONINV" offset="0xc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="DMTPRECLRCLR" offset="0x14" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="DMTPRECLRSET" offset="0x18" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="DMTPRECLRINV" offset="0x1c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="DMTCLRCLR" offset="0x24" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="DMTCLRSET" offset="0x28" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="DMTCLRINV" offset="0x2c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="DMTSTATCLR" offset="0x34" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="DMTSTATSET" offset="0x38" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="DMTSTATINV" offset="0x3c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="DMTCNTCLR" offset="0x44" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="DMTCNTSET" offset="0x48" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="DMTCNTINV" offset="0x4c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="DMTHOLDREGCLR" offset="0x54" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="DMTHOLDREGSET" offset="0x58" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="DMTHOLDREGINV" offset="0x5c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="DMTPSCNTCLR" offset="0x64" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="DMTPSCNTSET" offset="0x68" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="DMTPSCNTINV" offset="0x6c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
