zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
      <value-group name="EIC_DPRESCALER__TICKON">
        <value name="CLK_GCLK_EIC" caption="Clocked by GCLK" value="0"/>
        <value name="CLK_LFREQ" caption="Clocked by Low Frequency Clock" value="1"/>
      </value-group>
      <value-group name="EIC_NMICTRL__NMISENSE">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising-edge detection" value="1"/>
        <value name="FALL" caption="Falling-edge detection" value="2"/>
        <value name="BOTH" caption="Both-edges detection" value="3"/>
        <value name="HIGH" caption="High-level detection" value="4"/>
        <value name="LOW" caption="Low-level detection" value="5"/>
      </value-group>
      <value-group name="EIC_NMICTRL__NMIASYNCH">
        <value name="SYNC" caption="Edge detection is clock synchronously operated" value="0"/>
        <value name="ASYNC" caption="Edge detection is clock asynchronously operated" value="1"/>
      </value-group>
      <value-group name="EIC_ASYNCH__ASYNCH">
        <value name="SYNC" caption="Edge detection is clock synchronously operated" value="0"/>
        <value name="ASYNC" caption="Edge detection is clock asynchronously operated" value="1"/>
      </value-group>
      <value-group name="EIC_CONFIG__SENSE0">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
      <value-group name="EIC_CONFIG__SENSE1">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
      <value-group name="EIC_CONFIG__SENSE2">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
      <value-group name="EIC_CONFIG__SENSE3">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
    </module>
    <module name="EFUSE" id="EIP_00504" version="1.0.0">
      <register-group name="EFUSE" caption="Efuse Memory Map">
        <register name="SECCFG0" offset="0x0" rw="RW" size="1" initval="0x00" caption="Secure Configuration">
          <bitfield name="UUID_LCK" caption="Programming lock bits for Unique ID fuses" mask="0x30" values="SECCFG__UUID_LCK"/>
          <bitfield name="DEBUG_LCK" caption="Lock bits for debug/programming" mask="0xC0" values="SECCFG__DEBUG_LCK"/>
        </register>
        <register name="SECCFG1" offset="0x1" rw="RW" size="1" initval="0x00" caption="Secure Configuration">
          <bitfield name="ROOT_KEY_LCK" caption="Lock bits for storage root Key" mask="0x3" values="SECCFG__ROOT_KEY_LCK"/>
          <bitfield name="BOOT_KEY_LCK" caption="Lock bits for Secure Boot/OTA Key" mask="0xC" values="SECCFG__BOOT_KEY_LCK"/>
        </register>
        <register name="SECCFG2" offset="0x2" rw="RW" size="1" initval="0x00" caption="Secure Configuration">
          <bitfield name="ADD_BOOT_KEY" caption="Additional boot Key bit" mask="0x1"/>
        </register>
        <register name="ANTIROLLBACKCOUNTER" offset="0x4" rw="RW" size="1" count="32" initval="0x00" caption="Anti Roll back counter">
          <bitfield name="ANTIROLLBACKCOUNTER" caption="Anti rollback counter bits" mask="0xFF"/>
        </register>
        <register name="LIFECYCLECOUNTER" offset="0x24" rw="RW" size="1" count="2" initval="0x00" caption="Life cycle counter">
          <bitfield name="LIFECYCLECOUNTER" caption="Life cycle counter bits" mask="0xFF"/>
        </register>
        <register name="SECUREBOOTKEY" offset="0x26" rw="RW" size="1" count="48" initval="0x00" caption="Secure boot key">
          <bitfield name="SECUREBOOTKEY" caption="Secure boot key bits" mask="0xFF"/>
        </register>
        <register name="UUID" offset="0x1D8" rw="RW" size="1" count="16" initval="0x00" caption="Unique ID">
          <bitfield name="UUID" caption="Unique ID bits" mask="0xFF"/>
        </register>
      </register-group>
      <value-group name="SECCFG__UUID_LCK">
        <value name="0" caption="Unique ID is not locked" value="0"/>
        <value name="1" caption="Unique ID is locked and cannot be programmed" value="1"/>
        <value name="2" caption="Unique ID is locked and cannot be programmed" value="2"/>
        <value name="3" caption="Unique ID is locked and cannot be programmed" value="3"/>
      </value-group>
      <value-group name="SECCFG__DEBUG_LCK">
        <value name="0" caption="Debug is not locked" value="0"/>
        <value name="1" caption="Debug is locked" value="1"/>
        <value name="2" caption="Debug is locked" value="2"/>
        <value name="3" caption="Debug is locked" value="3"/>
      </value-group>
      <value-group name="SECCFG__ROOT_KEY_LCK">
        <value name="0" caption="Storage root key is not locked" value="0"/>
        <value name="1" caption="Storage root key is locked and cannot be programmed" value="1"/>
        <value name="2" caption="Storage root key is locked and cannot be programmed" value="2"/>
        <value name="3" caption="Storage root key is locked and cannot be programmed" value="3"/>
      </value-group>
      <value-group name="SECCFG__BOOT_KEY_LCK">
        <value name="0" caption="Secure boot key is not locked" value="0"/>
        <value name="1" caption="Secure boot key is locked and cannot be programmed" value="1"/>
        <value name="2" caption="Secure boot key is locked and cannot be programmed" value="2"/>
        <value name="3" caption="Secure boot key is locked and cannot be programmed" value="3"/>
      </value-group>
    </module>
