zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
        <register name="REVREG" offset="0x10FC" rw="R" size="4" initval="0x00000000" caption="TX and RX packet buffer fill levels">
          <bitfield name="MR" caption="Module Revision" mask="0xFFFF"/>
          <bitfield name="MID" caption="Module Identification" mask="0xFFF0000"/>
          <bitfield name="FN" caption="Fix Number" mask="0xF0000000"/>
        </register>
        <register name="OTLO" offset="0x1100" rw="RW" size="4" initval="0x00000000" caption="Octets Transmitted [31:0] Register">
          <bitfield name="TXO" caption="Transmitted Octets" mask="0xFFFFFFFF"/>
        </register>
        <register name="OTHI" offset="0x1104" rw="RW" size="4" initval="0x00000000" caption="Octets Transmitted [47:32] Register">
          <bitfield name="TXO" caption="Transmitted Octets" mask="0xFFFF"/>
        </register>
        <register name="FT" offset="0x1108" rw="RW" size="4" initval="0x00000000" caption="Frames Transmitted Register">
          <bitfield name="FTX" caption="Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="BCFT" offset="0x110C" rw="RW" size="4" initval="0x00000000" caption="Broadcast Frames Transmitted Register">
          <bitfield name="BFTX" caption="Broadcast Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="MFT" offset="0x1110" rw="RW" size="4" initval="0x00000000" caption="Multicast Frames Transmitted Register">
          <bitfield name="MFTX" caption="Multicast Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="PFT" offset="0x1114" rw="RW" size="4" initval="0x00000000" caption="Pause Frames Transmitted Register">
          <bitfield name="PFTX" caption="Pause Frames Transmitted Register" mask="0xFFFF"/>
        </register>
        <register name="BFT64" offset="0x1118" rw="RW" size="4" initval="0x00000000" caption="64 Byte Frames Transmitted Register">
          <bitfield name="NFTX" caption="64 Byte Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="TBFT127" offset="0x111C" rw="RW" size="4" initval="0x00000000" caption="65 to 127 Byte Frames Transmitted Register">
          <bitfield name="NFTX" caption="65 to 127 Byte Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="TBFT255" offset="0x1120" rw="RW" size="4" initval="0x00000000" caption="128 to 255 Byte Frames Transmitted Register">
          <bitfield name="NFTX" caption="128 to 255 Byte Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="TBFT511" offset="0x1124" rw="RW" size="4" initval="0x00000000" caption="256 to 511 Byte Frames Transmitted Register">
          <bitfield name="NFTX" caption="256 to 511 Byte Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="TBFT1023" offset="0x1128" rw="RW" size="4" initval="0x00000000" caption="512 to 1023 Byte Frames Transmitted Register">
          <bitfield name="NFTX" caption="512 to 1023 Byte Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="TBFT1518" offset="0x112C" rw="RW" size="4" initval="0x00000000" caption="1024 to 1518 Byte Frames Transmitted Register">
          <bitfield name="NFTX" caption="1024 to 1518 Byte Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="GTBFT1518" offset="0x1130" rw="RW" size="4" initval="0x00000000" caption="Greater Than 1518 Byte Frames Transmitted Register">
          <bitfield name="NFTX" caption="Greater than 1518 Byte Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="TUR" offset="0x1134" rw="RW" size="4" initval="0x00000000" caption="Transmit Underruns Register">
          <bitfield name="TXUNR" caption="Transmit Underruns" mask="0x3FF"/>
        </register>
        <register name="SCF" offset="0x1138" rw="RW" size="4" initval="0x00000000" caption="Single Collision Frames Register">
          <bitfield name="SCOL" caption="Single Collision" mask="0x3FFFF"/>
        </register>
        <register name="MCF" offset="0x113C" rw="RW" size="4" initval="0x00000000" caption="Multiple Collision Frames Register">
          <bitfield name="MCOL" caption="Multiple Collision" mask="0x3FFFF"/>
        </register>
        <register name="EC" offset="0x1140" rw="RW" size="4" initval="0x00000000" caption="Excessive Collisions Register">
          <bitfield name="XCOL" caption="Excessive Collisions" mask="0x3FF"/>
        </register>
        <register name="LC" offset="0x1144" rw="RW" size="4" initval="0x00000000" caption="Late Collisions Register">
          <bitfield name="LCOL" caption="Late Collisions" mask="0x3FF"/>
        </register>
        <register name="DTF" offset="0x1148" rw="RW" size="4" initval="0x00000000" caption="Deferred Transmission Frames Register">
          <bitfield name="DEFT" caption="Deferred Transmission" mask="0x3FFFF"/>
        </register>
        <register name="CSE" offset="0x114C" rw="RW" size="4" initval="0x00000000" caption="Carrier Sense Errors Register">
          <bitfield name="CSR" caption="Carrier Sense Error" mask="0x3FF"/>
        </register>
        <register name="ORLO" offset="0x1150" rw="RW" size="4" initval="0x00000000" caption="Octets Received [31:0] Received">
          <bitfield name="RXO" caption="Received Octets" mask="0xFFFFFFFF"/>
        </register>
        <register name="ORHI" offset="0x1154" rw="RW" size="4" initval="0x00000000" caption="Octets Received [47:32] Received">
          <bitfield name="RXO" caption="Received Octets" mask="0xFFFF"/>
        </register>
        <register name="FR" offset="0x1158" rw="RW" size="4" initval="0x00000000" caption="Frames Received Register">
          <bitfield name="FRX" caption="Frames Received without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="BCFR" offset="0x115C" rw="RW" size="4" initval="0x00000000" caption="Broadcast Frames Received Register">
          <bitfield name="BFRX" caption="Broadcast Frames Received without Error" mask="0xFFFFFFFF"/>
        </register>
