zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
        <register name="CBSCTRL" offset="0x14BC" rw="RW" size="4" initval="0x00000000" caption="CBS Control Register">
          <bitfield name="CBSEQA" caption="Enable Credit-Based shaping on the highest priority queue (queue A)" mask="0x1"/>
          <bitfield name="CBSEQB" caption="Enable Credit-Based shaping on the 2nd highest priority queue (queue B)" mask="0x2"/>
        </register>
        <register name="CBSISQA" offset="0x14C0" rw="RW" size="4" initval="0x00000000" caption="IdleSlope value for queue A">
          <bitfield name="ISA" caption="IdleSlope value for queue A" mask="0xFFFFFFFF"/>
        </register>
        <register name="CBSISQB" offset="0x14C4" rw="RW" size="4" initval="0x00000000" caption="IdleSlope value for queue B">
          <bitfield name="ISA" caption="IdleSlope value for queue A" mask="0xFFFFFFFF"/>
        </register>
        <register name="UTXQBA" offset="0x14C8" rw="RW" size="4" initval="0x00000000" caption="Upper 32 bits of transmit buffer descriptor queue base address">
          <bitfield name="UTXQBA" caption="Upper 32 bits of transmit buffer descriptor queue base address" mask="0xFFFFFFFF"/>
        </register>
        <register name="TXBDCTRL" offset="0x14CC" rw="RW" size="4" initval="0x00000000" caption="TX BD control register">
          <bitfield name="TXBDTSM" caption="TX Descriptor Timestamp Insertion mode" mask="0x30"/>
        </register>
        <register name="RXBDCTRL" offset="0x14D0" rw="RW" size="4" initval="0x00000000" caption="RX BD control register">
          <bitfield name="RXBDTSM" caption="RX Descriptor Timestamp Insertion mode" mask="0x30"/>
        </register>
        <register name="URXQBA" offset="0x14D4" rw="RW" size="4" initval="0x00000000" caption="Upper 32 bits of receive buffer descriptor queue base address">
          <bitfield name="URXQBA" caption="Upper 32 bits of receive buffer descriptor queue base address" mask="0xFFFFFFFF"/>
        </register>
        <register name="SCRT1" offset="0x1500" rw="RW" size="4" count="16" initval="0x00000000" caption="Screening Type 1 Register N">
          <bitfield name="QNMBR" caption="Queue Number" mask="0xF"/>
          <bitfield name="DSTCM" caption="DS/TC Match" mask="0xFF0"/>
          <bitfield name="UDPP" caption="UDP Port Match" mask="0xFFFF000"/>
          <bitfield name="DSTCE" caption="DS/TC Enable" mask="0x10000000"/>
          <bitfield name="UDPE" caption="UDP Port Match Enable" mask="0x20000000"/>
        </register>
        <register name="SCRT2" offset="0x1540" rw="RW" size="4" count="16" initval="0x00000000" caption="Screening Type 2 Register">
          <bitfield name="QNMBR" caption="Queue Number" mask="0xF"/>
          <bitfield name="VLANPRI" caption="VLAN Priority" mask="0x70"/>
          <bitfield name="VLANE" caption="VLAN Enable" mask="0x100"/>
          <bitfield name="ETID" caption="EtherType Index" mask="0xE00"/>
          <bitfield name="ETE" caption="EtherType Enable" mask="0x1000"/>
          <bitfield name="CMPAID" caption="Compare A Index" mask="0x3E000"/>
          <bitfield name="CMPAE" caption="Compare A Enable" mask="0x40000"/>
          <bitfield name="CMPBID" caption="Compare B Index" mask="0xF80000"/>
          <bitfield name="CMPBE" caption="Compare B Enable" mask="0x1000000"/>
          <bitfield name="CMPCID" caption="Compare C Index" mask="0x3E000000"/>
          <bitfield name="CMPCE" caption="Compare C Enable" mask="0x40000000"/>
        </register>
        <register name="RXQPTR" offset="0x15C0" rw="RW" size="4" count="8" initval="0x00000000" caption="Receive buffer queue base address">
          <bitfield name="DMARXQPTR" caption="Receive buffer queue base address" mask="0xFFFFFFFC"/>
        </register>
        <register name="DMARXQS" offset="0x15E0" rw="RW" size="4" count="8" initval="0x00000000" caption="Receive Buffer Queue Size">
          <bitfield name="DMARXQS" caption="Receive Buffer Queue Size" mask="0xFF"/>
        </register>
        <register name="IERQ" offset="0x1600" rw="RW" size="4" atomic-op="set:IMRQ" count="7" initval="0x00000000" caption="Interrupt Enable Queue N">
          <bitfield name="RCOMP" caption="Receive Complete" mask="0x2"/>
          <bitfield name="RXUBR" caption="RX Used Bit Read" mask="0x4"/>
          <bitfield name="TXUBR" caption="TX Used Bit Read" mask="0x8"/>
          <bitfield name="TUR" caption="Transmit Underrun" mask="0x10"/>
          <bitfield name="RLEX" caption="Retry Limit Exceeded" mask="0x20"/>
          <bitfield name="TFC" caption="Transmit Frame Corruption Due to AHB Error" mask="0x40"/>
          <bitfield name="TCOMP" caption="Transmit Complete" mask="0x80"/>
          <bitfield name="ROVR" caption="Receive Overrun" mask="0x400"/>
          <bitfield name="HRESP" caption="HRESP Not OK" mask="0x800"/>
        </register>
        <register name="IDRQ" offset="0x1620" rw="RW" size="4" atomic-op="clear:IMRQ" count="7" initval="0x00000000" caption="Interrupt Disable Queue N">
          <bitfield name="RCOMP" caption="Receive Complete" mask="0x2"/>
          <bitfield name="RXUBR" caption="RX Used Bit Read" mask="0x4"/>
          <bitfield name="TXUBR" caption="TX Used Bit Read" mask="0x8"/>
          <bitfield name="TUR" caption="Transmit Underrun" mask="0x10"/>
          <bitfield name="RLEX" caption="Retry Limit Exceeded" mask="0x20"/>
          <bitfield name="TFC" caption="Transmit Frame Corruption Due to AHB Error" mask="0x40"/>
          <bitfield name="TCOMP" caption="Transmit Complete" mask="0x80"/>
          <bitfield name="ROVR" caption="Receive Overrun" mask="0x400"/>
          <bitfield name="HRESP" caption="HRESP Not OK" mask="0x800"/>
        </register>
        <register name="IMRQ" offset="0x1640" rw="RW" size="4" count="7" initval="0x00000876" caption="Interrupt Mask  Queue Register">
          <bitfield name="RCOMP" caption="Receive Complete" mask="0x2"/>
          <bitfield name="RXUBR" caption="RX Used Bit Read" mask="0x4"/>
          <bitfield name="TXUBR" caption="TX Used Bit Read" mask="0x8"/>
          <bitfield name="TUR" caption="Transmit Underrun" mask="0x10"/>
          <bitfield name="RLEX" caption="Retry Limit Exceeded" mask="0x20"/>
          <bitfield name="TFC" caption="Transmit Frame Corruption Due to AHB Error" mask="0x40"/>
          <bitfield name="TCOMP" caption="Transmit Complete" mask="0x80"/>
          <bitfield name="ROVR" caption="Receive Overrun" mask="0x400"/>
          <bitfield name="HRESP" caption="HRESP Not OK" mask="0x800"/>
        </register>
        <register name="IERQU" offset="0x1660" rw="RW" size="4" atomic-op="set:IMRQ" count="8" initval="0x00000000" caption="Interrupt Enable Queue N (upper)">
          <bitfield name="RCOMP" caption="Receive Complete" mask="0x2"/>
          <bitfield name="RXUBR" caption="RX Used Bit Read" mask="0x4"/>
          <bitfield name="TXUBR" caption="TX Used Bit Read" mask="0x8"/>
          <bitfield name="TUR" caption="Transmit Underrun" mask="0x10"/>
          <bitfield name="RLEX" caption="Retry Limit Exceeded" mask="0x20"/>
          <bitfield name="TFC" caption="Transmit Frame Corruption Due to AHB Error" mask="0x40"/>
          <bitfield name="TCOMP" caption="Transmit Complete" mask="0x80"/>
          <bitfield name="ROVR" caption="Receive Overrun" mask="0x400"/>
          <bitfield name="HRESP" caption="HRESP Not OK" mask="0x800"/>
        </register>
        <register name="IDRQU" offset="0x1680" rw="RW" size="4" atomic-op="clear:IMRQ" count="8" initval="0x00000000" caption="Interrupt Disable Queue N (upper)">
          <bitfield name="RCOMP" caption="Receive Complete" mask="0x2"/>
          <bitfield name="RXUBR" caption="RX Used Bit Read" mask="0x4"/>
          <bitfield name="TXUBR" caption="TX Used Bit Read" mask="0x8"/>
          <bitfield name="TUR" caption="Transmit Underrun" mask="0x10"/>
          <bitfield name="RLEX" caption="Retry Limit Exceeded" mask="0x20"/>
          <bitfield name="TFC" caption="Transmit Frame Corruption Due to AHB Error" mask="0x40"/>
          <bitfield name="TCOMP" caption="Transmit Complete" mask="0x80"/>
          <bitfield name="ROVR" caption="Receive Overrun" mask="0x400"/>
          <bitfield name="HRESP" caption="HRESP Not OK" mask="0x800"/>
        </register>
        <register name="IMRQU" offset="0x16A0" rw="RW" size="4" count="8" initval="0x00000876" caption="Interrupt Mask Queue N (upper)">
          <bitfield name="RCOMP" caption="Receive Complete" mask="0x2"/>
          <bitfield name="RXUBR" caption="RX Used Bit Read" mask="0x4"/>
          <bitfield name="TXUBR" caption="TX Used Bit Read" mask="0x8"/>
          <bitfield name="TUR" caption="Transmit Underrun" mask="0x10"/>
          <bitfield name="RLEX" caption="Retry Limit Exceeded" mask="0x20"/>
          <bitfield name="TFC" caption="Transmit Frame Corruption Due to AHB Error" mask="0x40"/>
          <bitfield name="TCOMP" caption="Transmit Complete" mask="0x80"/>
          <bitfield name="ROVR" caption="Receive Overrun" mask="0x400"/>
          <bitfield name="HRESP" caption="HRESP Not OK" mask="0x800"/>
        </register>
        <register name="SCRT2ET" offset="0x16E0" rw="RW" size="4" count="8" initval="0x00000000" caption="Screening Type 2 EtherType Register">
          <bitfield name="CMPVAL" caption="Ethertype compare value" mask="0xFFFF"/>
        </register>
        <register-group name="SCRT2CMP" name-in-module="SCRT2CMP" offset="0x1700" size="0x8" count="32"/>
      </register-group>
    </module>
    <module name="EVSYS" id="U2504" version="1.0.0" caption="Event System Interface">
      <register-group name="CHANNEL" size="0x8">
        <register name="CHANNEL" offset="0x0" rw="RW" size="4" initval="0x00008000" caption="Channel n Control">
          <bitfield name="EVGEN" caption="Event Generator Selection" mask="0x7F"/>
          <bitfield name="PATH" caption="Path Selection" mask="0x300" values="EVSYS_CHANNEL__PATH"/>
          <bitfield name="EDGSEL" caption="Edge Detection Selection" mask="0xC00" values="EVSYS_CHANNEL__EDGSEL"/>
          <bitfield name="RUNSTDBY" caption="Run in standby" mask="0x4000"/>
          <bitfield name="ONDEMAND" caption="Generic Clock On Demand" mask="0x8000"/>
        </register>
        <register name="CHINTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:CHINTENCLR" initval="0x00" caption="Channel n Interrupt Enable Clear">
          <bitfield name="OVR" caption="Channel Overrun Interrupt Disable" mask="0x1"/>
          <bitfield name="EVD" caption="Channel Event Detected Interrupt Disable" mask="0x2"/>
        </register>
        <register name="CHINTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:CHINTENSET" initval="0x00" caption="Channel n Interrupt Enable Set">
          <bitfield name="OVR" caption="Channel Overrun Interrupt Enable" mask="0x1"/>
          <bitfield name="EVD" caption="Channel Event Detected Interrupt Enable" mask="0x2"/>
        </register>
        <register name="CHINTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:CHINTFLAG" initval="0x00" caption="Channel n Interrupt Flag Status and Clear">
          <bitfield name="OVR" caption="Channel Overrun" mask="0x1"/>
          <bitfield name="EVD" caption="Channel Event Detected" mask="0x2"/>
        </register>
        <register name="CHSTATUS" offset="0x7" rw="R" size="1" initval="0x01" caption="Channel n Status">
          <bitfield name="RDYUSR" caption="Ready User" mask="0x1"/>
          <bitfield name="BUSYCH" caption="Busy Channel" mask="0x2"/>
        </register>
      </register-group>
