zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
      <value-group caption="VDDBUKPCORE 32kHz clock source selection" name="DEVCFG4__VBKP_32KCSEL">
        <value caption="FRC" name="FRC" value="0x0"/>
        <value caption="POSC" name="POSC" value="0x1"/>
        <value caption="SOSC" name="SOSC" value="0x2"/>
        <value caption="LPRC" name="LPRC" value="0x3"/>
      </value-group>
      <value-group caption="VDDBUKPCORE LPCLK Clock Selection" name="DEVCFG4__VBKP_1KCSEL">
        <value caption="Divide by 32 or 31.25 clock depending on VBKP_DIVSEL" name="_1K" value="0x1"/>
        <value caption="32kHz low power clock" name="_32K" value="0x0"/>
      </value-group>
      <value-group caption="RTCEVENT Enable" name="DEVCFG4__RTCEVENT_EN">
        <value caption="Enable RTC Event" name="ON" value="0x1"/>
        <value caption="Disable RTC Event" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="RTC Event Selection" name="DEVCFG4__RTCEVENT_SEL">
        <value caption="1-Second Clock" name="ONE_SEC" value="0x0"/>
        <value caption="Alarm Pulse" name="ALARM_PULSE" value="0x1"/>
        <value caption="32 kHz Clock" name="_32_KHZ" value="0x1"/>
      </value-group>
      <!-- FBCFG0 -->
      <value-group caption="PCache Single cache Mode" name="FBCFG0__PCSCMODE">
        <value caption="PCHE ICache Only.CPU Instructions (code, data) go to PCHE ONLY." name="SINGLE" value="0x1"/>
        <value caption="PCHE ICache and DCache. CPU opcodes go to PCEHE ICache port and data goes to PCHE" name="DUAL" value="0x0"/>
      </value-group>
      <value-group caption="BCFG area valid" name="FBCFG0__BINFOVALID">
        <value caption="BCFG0 to BCFG7 is not valid." name="NOT_VALID" value="0x1"/>
        <value caption="BCFG0 to BCFG7 is valid." name="VALID" value="0x0"/>
      </value-group>
      <!-- FCPN0 -->
      <value-group caption="Boot Code Protect" name="FCPN0__CP">
        <value caption="Protection Disabled" name="DISABLED" value="0x1"/>
        <value caption="Protection Enabled" name="ENABLED" value="0x0"/>
      </value-group>
    </module>
    <module name="GPIO" id="02467" version="1.0" caption="GPIO">
      <register-group name="GPIO">
        <register name="ANSEL" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="ANS0" caption="" mask="0x1"/>
          <bitfield name="ANS1" caption="" mask="0x2"/>
          <bitfield name="ANS2" caption="" mask="0x4"/>
          <bitfield name="ANS3" caption="" mask="0x8"/>
          <bitfield name="ANS4" caption="" mask="0x10"/>
          <bitfield name="ANS5" caption="" mask="0x20"/>
          <bitfield name="ANS6" caption="" mask="0x40"/>
          <bitfield name="ANS7" caption="" mask="0x80"/>
          <bitfield name="ANS8" caption="" mask="0x100"/>
          <bitfield name="ANS9" caption="" mask="0x200"/>
          <bitfield name="ANS10" caption="" mask="0x400"/>
          <bitfield name="ANS11" caption="" mask="0x800"/>
          <bitfield name="ANS12" caption="" mask="0x1000"/>
          <bitfield name="ANS13" caption="" mask="0x2000"/>
          <bitfield name="ANS14" caption="" mask="0x4000"/>
          <bitfield name="ANS15" caption="" mask="0x8000"/>
        </register>
        <register name="ANSELCLR" offset="0x04" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="ANSELSET" offset="0x08" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="ANSELINV" offset="0x0C" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="TRIS" offset="0x10" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TRIS0" caption="" mask="0x1"/>
          <bitfield name="TRIS1" caption="" mask="0x2"/>
          <bitfield name="TRIS2" caption="" mask="0x4"/>
          <bitfield name="TRIS3" caption="" mask="0x8"/>
          <bitfield name="TRIS4" caption="" mask="0x10"/>
          <bitfield name="TRIS5" caption="" mask="0x20"/>
          <bitfield name="TRIS6" caption="" mask="0x40"/>
          <bitfield name="TRIS7" caption="" mask="0x80"/>
          <bitfield name="TRIS8" caption="" mask="0x100"/>
          <bitfield name="TRIS9" caption="" mask="0x200"/>
          <bitfield name="TRIS10" caption="" mask="0x400"/>
          <bitfield name="TRIS11" caption="" mask="0x800"/>
          <bitfield name="TRIS12" caption="" mask="0x1000"/>
          <bitfield name="TRIS13" caption="" mask="0x2000"/>
          <bitfield name="TRIS14" caption="" mask="0x4000"/>
          <bitfield name="TRIS15" caption="" mask="0x8000"/>
        </register>
        <register name="TRISCLR" offset="0x14" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="TRISSET" offset="0x18" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="TRISINV" offset="0x1C" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="PORT" offset="0x20" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="R0" caption="" mask="0x1"/>
          <bitfield name="R1" caption="" mask="0x2"/>
          <bitfield name="R2" caption="" mask="0x4"/>
          <bitfield name="R3" caption="" mask="0x8"/>
          <bitfield name="R4" caption="" mask="0x10"/>
          <bitfield name="R5" caption="" mask="0x20"/>
          <bitfield name="R6" caption="" mask="0x40"/>
          <bitfield name="R7" caption="" mask="0x80"/>
          <bitfield name="R8" caption="" mask="0x100"/>
          <bitfield name="R9" caption="" mask="0x200"/>
          <bitfield name="R10" caption="" mask="0x400"/>
          <bitfield name="R11" caption="" mask="0x800"/>
          <bitfield name="R12" caption="" mask="0x1000"/>
          <bitfield name="R13" caption="" mask="0x2000"/>
          <bitfield name="R14" caption="" mask="0x4000"/>
          <bitfield name="R15" caption="" mask="0x8000"/>
        </register>
        <register name="PORTCLR" offset="0x24" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="PORTSET" offset="0x28" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
