zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
        <register name="SRCON0CLR" offset="0xc4" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="SRCON0SET" offset="0xc8" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="SRCON0INV" offset="0xcC" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="SRCON1" offset="0xd0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SR10" caption="" mask="0x1"/>
          <bitfield name="SR11" caption="" mask="0x2"/>
          <bitfield name="SR12" caption="" mask="0x4"/>
          <bitfield name="SR13" caption="" mask="0x8"/>
          <bitfield name="SR14" caption="" mask="0x10"/>
          <bitfield name="SR15" caption="" mask="0x20"/>
          <bitfield name="SR16" caption="" mask="0x40"/>
          <bitfield name="SR17" caption="" mask="0x80"/>
          <bitfield name="SR18" caption="" mask="0x100"/>
          <bitfield name="SR19" caption="" mask="0x200"/>
          <bitfield name="SR110" caption="" mask="0x400"/>
          <bitfield name="SR111" caption="" mask="0x800"/>
          <bitfield name="SR112" caption="" mask="0x1000"/>
          <bitfield name="SR113" caption="" mask="0x2000"/>
          <bitfield name="SR114" caption="" mask="0x4000"/>
          <bitfield name="SR115" caption="" mask="0x8000"/>
        </register>
        <register name="SRCON1CLR" offset="0xd4" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="SRCON1SET" offset="0xd8" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="SRCON1INV" offset="0xdC" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
      </register-group>
    </module>
    <module name="HMATRIX2TOP" id="04585" version="6.0.0" caption="HSB Matrix">
      <register-group name="HMATRIX2TOP" caption="HSB Matrix">
        <register name="PRAS0" offset="0x80" rw="RW" size="4" access-size="4" initval="0x00000003" caption="Priority part A for Target 0"/>
        <register name="PRBS0" offset="0x84" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Priority part B for Target 0"/>
        <register name="PRAS1" offset="0x88" rw="RW" size="4" access-size="4" initval="0x30000300" caption="Priority part A for Target 1"/>
        <register name="PRBS1" offset="0x8C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Priority part B for Target 1"/>
        <register name="PRAS2" offset="0x90" rw="RW" size="4" access-size="4" initval="0x03330000" caption="Priority part A for Target 2"/>
        <register name="PRBS2" offset="0x94" rw="RW" size="4" access-size="4" initval="0x00000300" caption="Priority part B for Target 2"/>
        <register name="PRAS3" offset="0x98" rw="RW" size="4" access-size="4" initval="0x00003000" caption="Priority part A for Target 3"/>
        <register name="PRBS3" offset="0x9C" rw="RW" size="4" access-size="4" initval="0x00000033" caption="Priority part B for Target 3"/>
        <register name="PRAS4" offset="0xA0" rw="RW" size="4" access-size="4" initval="0x00000030" caption="Priority part A for Target 4"/>
        <register name="PRBS4" offset="0xA4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Priority part B for Target 4"/>
        <register name="PRAS5" offset="0xA8" rw="RW" size="4" access-size="4" initval="0x00330303" caption="Priority part A for Target 5"/>
        <register name="PRBS5" offset="0xAC" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Priority part B for Target 5"/>
        <register name="PRAS6" offset="0xB0" rw="RW" size="4" access-size="4" initval="0x00033303" caption="Priority part A for Target 6"/>
        <register name="PRBS6" offset="0xB4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Priority part B for Target 6"/>
        <register name="PRAS7" offset="0xB8" rw="RW" size="4" access-size="4" initval="0x00033303" caption="Priority part A for Target 7"/>
        <register name="PRBS7" offset="0xBC" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Priority part B for Target 7"/>
        <register name="PRAS8" offset="0xC0" rw="RW" size="4" access-size="4" initval="0x00033303" caption="Priority part A for Target 8"/>
        <register name="PRBS8" offset="0xC4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Priority part B for Target 8"/>
        <register name="PRAS9" offset="0xC8" rw="RW" size="4" access-size="4" initval="0x00033303" caption="Priority part A for Target 9"/>
        <register name="PRBS9" offset="0xCC" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Priority part B for Target 9"/>
        <register name="PRAS10" offset="0xD0" rw="RW" size="4" access-size="4" initval="0x00333330" caption="Priority part A for Target 10"/>
        <register name="PRBS10" offset="0xD4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Priority part B for Target 10"/>
        <register name="PRAS11" offset="0xD8" rw="RW" size="4" access-size="4" initval="0x00000030" caption="Priority part A for Target 11"/>
        <register name="PRBS11" offset="0xDC" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Priority part B for Target 11"/>
        <register name="PRAS12" offset="0xE0" rw="RW" size="4" access-size="4" initval="0x00333303" caption="Priority part A for Target 12"/>
        <register name="PRBS12" offset="0xE4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Priority part B for Target 12"/>
        <register name="PRAS13" offset="0xE8" rw="RW" size="4" access-size="4" initval="0x00033303" caption="Priority part A for Target 13"/>
        <register name="PRBS13" offset="0xEC" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Priority part B for Target 13"/>
      </register-group>
    </module>
    <module name="NVM" id="03140" version="1.0" caption="flash controller">
      <register-group name="NVM" caption="flash controller">
        <register name="NVMCON" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="NVMOP" caption="" mask="0xf"/>
          <bitfield name="LVDERR" caption="" mask="0x1000"/>
          <bitfield name="WRERR" caption="" mask="0x2000"/>
          <bitfield name="WREN" caption="" mask="0x4000"/>
          <bitfield name="WR" caption="" mask="0x8000"/>
        </register>
