zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
        <register name="CHESTATSET" offset="0x18" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CHESTATINV" offset="0x1C" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CHEHIT" offset="0x20" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CHEHIT" caption="" mask="0xffffffff"/>
        </register>
        <register name="CHEHITCLR" offset="0x24" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CHEHITSET" offset="0x28" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CHEHITINV" offset="0x2C" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CHEMIS" offset="0x30" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CHEMIS" caption="" mask="0xffffffff"/>
        </register>
        <register name="CHEMISCLR" offset="0x34" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CHEMISSET" offset="0x38" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CHEMISINV" offset="0x3C" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
      </register-group>
    </module>
    <module name="PFW" id="03141" version="1.0" caption="flash wrapper">
      <register-group name="PFW" caption="flash wrapper">
        <register name="IFT_CON" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="FRZ" caption="" mask="0x2000"/>
          <bitfield name="SIDL" caption="" mask="0x4000"/>
          <bitfield name="ON" caption="" mask="0x8000"/>
        </register>
        <register name="IFT_CRCCON" offset="0x10" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="AUTOR" caption="" mask="0x1"/>
          <bitfield name="RBITO" caption="" mask="0x2"/>
          <bitfield name="PAUSE" caption="" mask="0x4"/>
          <bitfield name="PLEN32" caption="" mask="0x1000"/>
          <bitfield name="ERROR" caption="" mask="0x2000"/>
          <bitfield name="DONE" caption="" mask="0x4000"/>
          <bitfield name="CRCEN" caption="" mask="0x8000"/>
          <bitfield name="PERIOD" caption="" mask="0xffff0000"/>
        </register>
        <register name="IFT_CRCMADR" offset="0x20" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="IFT_CRCMADR" caption="" mask="0xffffffff"/>
        </register>
        <register name="IFT_CRCMLEN" offset="0x30" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CRCMLEN" caption="" mask="0xffffff"/>
        </register>
        <register name="IFT_CRCIV" offset="0x40" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CRCIV" caption="" mask="0xffffffff"/>
        </register>
        <register name="IFT_CRCACC" offset="0x50" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CRCACC" caption="" mask="0xffffffff"/>
        </register>
        <register name="IFT_CRCPOLY" offset="0x60" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CYCPOLY" caption="" mask="0xffffffff"/>
        </register>
        <register name="IFT_CRCFXOR" offset="0x70" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CRCFXOR" caption="" mask="0xffffffff"/>
        </register>
        <register name="IFT_CRCSUM" offset="0x80" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CRCSUM" caption="" mask="0xffffffff"/>
        </register>
        <register name="IFT_ECCCON" offset="0x90" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="FLT_MD" caption="" mask="0x7"/>
          <bitfield name="EVENT" caption="" mask="0x80"/>
          <bitfield name="CTLFLT" caption="" mask="0x700"/>
          <bitfield name="FLTEN" caption="" mask="0x8000"/>
        </register>
        <register name="IFT_ECCFLT" offset="0xA0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="FLT1PTR" caption="" mask="0x1ff"/>
          <bitfield name="FLT2PTR" caption="" mask="0x1ff0000"/>
        </register>
        <register name="IFT_ECCADR" offset="0xB0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="ECCADR" caption="" mask="0xffffffff"/>
        </register>
        <register name="IFT_ECCPAR" offset="0xC0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SECIN" caption="" mask="0x1ff"/>
          <bitfield name="DEDIN" caption="" mask="0x8000"/>
          <bitfield name="SECOUT" caption="" mask="0x1ff0000"/>
          <bitfield name="DEDOUT" caption="" mask="0x80000000"/>
        </register>
        <register name="IFT_ECCSYN" offset="0xD0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SECSYN" caption="" mask="0x1ff"/>
          <bitfield name="DEDSYS" caption="" mask="0x8000"/>
          <bitfield name="SERR" caption="" mask="0x10000"/>
          <bitfield name="DERR" caption="" mask="0x20000"/>
          <bitfield name="CERR" caption="" mask="0x40000"/>
          <bitfield name="CTLSTAT" caption="" mask="0x7000000"/>
          <bitfield name="PERR0" caption="" mask="0x10000000"/>
          <bitfield name="PERR1" caption="" mask="0x20000000"/>
          <bitfield name="PERR2" caption="" mask="0x40000000"/>
          <bitfield name="PERR3" caption="" mask="0x80000000"/>
        </register>
        <register name="DFT_VALCON" offset="0xF0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="VAL_ON" caption="" mask="0x8000"/>
        </register>
