zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
        <register name="CCLIN3R" offset="0xc0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CCLIN3" caption="CCL/IN3" mask="0x1f" values="CCLIN3_PINS"/>
        </register>
        <register name="CCLIN4R" offset="0xc4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CCLIN4" caption="CCL/IN4" mask="0x1f" values="CCLIN4_PINS"/>
        </register>
        <register name="CCLIN5R" offset="0xc8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CCLIN5" caption="CCL/IN5" mask="0x1f" values="CCLIN5_PINS"/>
        </register>
        <register name="TC0WO0G1R" offset="0xcc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC0WO0G1" caption="TC0/WO0G1" mask="0x1f" values="TC0WO0G1_PINS"/>
        </register>
        <register name="TC0WO0G2R" offset="0xd0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC0WO0G2" caption="TC0/WO0G2" mask="0x1f" values="TC0WO0G2_PINS"/>
        </register>
        <register name="TC0WO1G3R" offset="0xd4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC0WO1G3" caption="TC0/WO1G3" mask="0x1f" values="TC0WO1G3_PINS"/>
        </register>
        <register name="TC0WO1G4R" offset="0xd8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC0WO1G4" caption="TC0/WO1G4" mask="0x1f" values="TC0WO1G4_PINS"/>
        </register>
        <register name="TC1WO0G1R" offset="0xdc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC1WO0G1" caption="TC1/WO0G1" mask="0x1f" values="TC1WO0G1_PINS"/>
        </register>
        <register name="TC1WO1G2R" offset="0xe4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC1WO1G2" caption="TC1/WO1G2" mask="0x1f" values="TC1WO1G2_PINS"/>
        </register>
        <register name="TC2WO0G1R" offset="0xec" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC2WO0G1" caption="TC2/WO0G1" mask="0x1f" values="TC2WO0G1_PINS"/>
        </register>
        <register name="TC2WO0G3R" offset="0xf0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC2WO0G3" caption="TC2/WO0G3" mask="0x1f" values="TC2WO0G3_PINS"/>
        </register>
        <register name="TC2WO1G2R" offset="0xf4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC2WO1G2" caption="TC2/WO1G2" mask="0x1f" values="TC2WO1G2_PINS"/>
        </register>
        <register name="TC2WO1G4R" offset="0xf8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC2WO1G4" caption="TC2/WO1G4" mask="0x1f" values="TC2WO1G4_PINS"/>
        </register>
        <register name="TC3WO0G1R" offset="0xfc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC3WO0G1" caption="TC3/WO0G1" mask="0x1f" values="TC3WO0G1_PINS"/>
        </register>
        <register name="TC3WO0G3R" offset="0x100" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC3WO0G3" caption="TC3/WO0G3" mask="0x1f" values="TC3WO0G3_PINS"/>
        </register>
        <register name="TC3WO1G2R" offset="0x104" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC3WO1G2" caption="TC3/WO1G2" mask="0x1f" values="TC3WO1G2_PINS"/>
        </register>
        <register name="TC3WO1G4R" offset="0x108" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC3WO1G4" caption="TC3/WO1G4" mask="0x1f" values="TC3WO1G4_PINS"/>
        </register>
        <register name="TC4WO0G1R" offset="0x10c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC4WO0G1" caption="TC4/WO0G1" mask="0x1f" values="TC4WO0G1_PINS"/>
        </register>
        <register name="TC4WO0G3R" offset="0x110" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC4WO0G3" caption="TC4/WO0G3" mask="0x1f" values="TC4WO0G3_PINS"/>
        </register>
        <register name="TC4WO1G2R" offset="0x114" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC4WO1G2" caption="TC4/WO1G2" mask="0x1f" values="TC4WO1G2_PINS"/>
        </register>
        <register name="TC4WO1G4R" offset="0x118" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC4WO1G4" caption="TC4/WO1G4" mask="0x1f" values="TC4WO1G4_PINS"/>
        </register>
        <register name="TC5WO0G1R" offset="0x11c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC5WO0G1" caption="TC5/WO0G1" mask="0x1f" values="TC5WO0G1_PINS"/>
        </register>
        <register name="TC5WO0G3R" offset="0x120" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC5WO0G3" caption="TC5/WO0G3" mask="0x1f" values="TC5WO0G3_PINS"/>
        </register>
        <register name="TC5WO1G2R" offset="0x124" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC5WO1G2" caption="TC5/WO1G2" mask="0x1f" values="TC5WO1G2_PINS"/>
        </register>
        <register name="TC5WO1G4R" offset="0x128" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC5WO1G4" caption="TC5/WO1G4" mask="0x1f" values="TC5WO1G4_PINS"/>
        </register>
        <register name="TC6WO0G1R" offset="0x12c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC6WO0G1" caption="TC6/WO0G1" mask="0x1f" values="TC6WO0G1_PINS"/>
        </register>
        <register name="TC6WO0G3R" offset="0x130" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC6WO0G3" caption="TC6/WO0G3" mask="0x1f" values="TC6WO0G3_PINS"/>
        </register>
        <register name="TC6WO1G2R" offset="0x134" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC6WO1G2" caption="TC6/WO1G2" mask="0x1f" values="TC6WO1G2_PINS"/>
        </register>
        <register name="TC6WO1G4R" offset="0x138" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC6WO1G4" caption="TC6/WO1G4" mask="0x1f" values="TC6WO1G4_PINS"/>
        </register>
        <register name="TC7WO0G1R" offset="0x13c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC7WO0G1" caption="TC7/WO0G1" mask="0x1f" values="TC7WO0G1_PINS"/>
        </register>
        <register name="TC7WO0G3R" offset="0x140" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC7WO0G3" caption="TC7/WO0G3" mask="0x1f" values="TC7WO0G3_PINS"/>
        </register>
        <register name="TC7WO1G2R" offset="0x144" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC7WO1G2" caption="TC7/WO1G2" mask="0x1f" values="TC7WO1G2_PINS"/>
        </register>
        <register name="TC7WO1G4R" offset="0x148" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC7WO1G4" caption="TC7/WO1G4" mask="0x1f" values="TC7WO1G4_PINS"/>
        </register>
        <register name="TC8WO0G1R" offset="0x14c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC8WO0G1" caption="TC8/WO0G1" mask="0x1f" values="TC8WO0G1_PINS"/>
        </register>
        <register name="TC8WO0G3R" offset="0x150" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC8WO0G3" caption="TC8/WO0G3" mask="0x1f" values="TC8WO0G3_PINS"/>
        </register>
        <register name="TC8WO1G2R" offset="0x154" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC8WO1G2" caption="TC8/WO1G2" mask="0x1f" values="TC8WO1G2_PINS"/>
        </register>
        <register name="TC8WO1G5R" offset="0x158" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC8WO1G5" caption="TC8/WO1G5" mask="0x1f" values="TC8WO1G5_PINS"/>
        </register>
