zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
        <register name="TC9WO0G2R" offset="0x15c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC9WO0G2" caption="TC9/WO0G2" mask="0x1f" values="TC9WO0G2_PINS"/>
        </register>
        <register name="TC9WO0G4R" offset="0x160" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC9WO0G4" caption="TC9/WO0G4" mask="0x1f" values="TC9WO0G4_PINS"/>
        </register>
        <register name="TC9WO1G3R" offset="0x164" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC9WO1G3" caption="TC9/WO1G3" mask="0x1f" values="TC9WO1G3_PINS"/>
        </register>
        <register name="TC9WO1G5R" offset="0x168" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC9WO1G5" caption="TC9/WO1G5" mask="0x1f" values="TC9WO1G5_PINS"/>
        </register>
        <register name="QEIHOME0G1R" offset="0x16c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="QEIHOME0G1" caption="QEI/HOME0G1" mask="0x1f" values="QEIHOME0G1_PINS"/>
        </register>
        <register name="QEIHOME0G2R" offset="0x170" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="QEIHOME0G2" caption="QEI/HOME0G2" mask="0x1f" values="QEIHOME0G2_PINS"/>
        </register>
        <register name="QEIINDX0G2R" offset="0x174" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="QEIINDX0G2" caption="QEI/INDX0G2" mask="0x1f" values="QEIINDX0G2_PINS"/>
        </register>
        <register name="QEIINDX0G3R" offset="0x178" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="QEIINDX0G3" caption="QEI/INDX0G3" mask="0x1f" values="QEIINDX0G3_PINS"/>
        </register>
        <register name="QEIQEA0G3R" offset="0x17c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="QEIQEA0G3" caption="QEI/QEA0G3" mask="0x1f" values="QEIQEA0G3_PINS"/>
        </register>
        <register name="QEIQEA0G4R" offset="0x180" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="QEIQEA0G4" caption="QEI/QEA0G4" mask="0x1f" values="QEIQEA0G4_PINS"/>
        </register>
        <register name="QEIQEB0G4R" offset="0x184" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="QEIQEB0G4" caption="QEI/QEB0G4" mask="0x1f" values="QEIQEB0G4_PINS"/>
        </register>
        <register name="QEIQEB0G5R" offset="0x188" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="QEIQEB0G5" caption="QEI/QEB0G5" mask="0x1f" values="QEIQEB0G5_PINS"/>
        </register>
        <register name="ACCMPTENR" offset="0x18c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="ACCMPTEN" caption="AC/CMPTEN" mask="0x1f" values="ACCMPTEN_PINS"/>
        </register>
        <register name="CAN1RXR" offset="0x190" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CAN1RX" caption="CAN1/RX" mask="0x1f" values="CAN1RX_PINS"/>
        </register>
        <register name="COEXWLANACTR" offset="0x194" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="COEXWLANACT" caption="COEX/WLAN_ACT" mask="0x1f" values="COEXWLANACT_PINS"/>
        </register>
        <!-- Next lines are OUTPUT pin mappings -->
        <register name="RPA0G1R" offset="0x200" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA0G1R" caption="RPA0/G1" mask="0x3f" values="RPA0G1_PINS"/>
        </register>
        <register name="RPA0G2R" offset="0x204" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA0G2R" caption="RPA0/G2" mask="0x3f" values="RPA0G2_PINS"/>
        </register>
        <register name="RPA0G3R" offset="0x208" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA0G3R" caption="RPA0/G3" mask="0x3f" values="RPA0G3_PINS"/>
        </register>
        <register name="RPA0G4R" offset="0x20c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA0G4R" caption="RPA0/G4" mask="0x3f" values="RPA0G4_PINS"/>
        </register>
        <register name="RPA1G2R" offset="0x210" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA1G2R" caption="RPA1/G2" mask="0x3f" values="RPA1G2_PINS"/>
        </register>
        <register name="RPA1G3R" offset="0x214" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA1G3R" caption="RPA1/G3" mask="0x3f" values="RPA1G3_PINS"/>
        </register>
        <register name="RPA1G4R" offset="0x218" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA1G4R" caption="RPA1/G4" mask="0x3f" values="RPA1G4_PINS"/>
        </register>
        <register name="RPA1G5R" offset="0x21c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA1G5R" caption="RPA1/G5" mask="0x3f" values="RPA1G5_PINS"/>
        </register>
        <register name="RPA2G1R" offset="0x220" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA2G1R" caption="RPA2/G1" mask="0x3f" values="RPA2G1_PINS"/>
        </register>
        <register name="RPA2G3R" offset="0x224" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA2G3R" caption="RPA2/G3" mask="0x3f" values="RPA2G3_PINS"/>
        </register>
        <register name="RPA2G4R" offset="0x228" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA2G4R" caption="RPA2/G4" mask="0x3f" values="RPA2G4_PINS"/>
        </register>
        <register name="RPA3G1R" offset="0x22c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA3G1R" caption="RPA3/G1" mask="0x3f" values="RPA3G1_PINS"/>
        </register>
