zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
        <register name="RPA14G4R" offset="0x2ac" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA14G4R" caption="RPA14/G4" mask="0x3f" values="RPA14G4_PINS"/>
        </register>
        <register name="RPB0G1R" offset="0x2b4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB0G1R" caption="RPB0/G1" mask="0x3f" values="RPB0G1_PINS"/>
        </register>
        <register name="RPB0G2R" offset="0x2b8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB0G2R" caption="RPB0/G2" mask="0x3f" values="RPB0G2_PINS"/>
        </register>
        <register name="RPB0G5R" offset="0x2bc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB0G5R" caption="RPB0/G5" mask="0x3f" values="RPB0G5_PINS"/>
        </register>
        <register name="RPB1G1R" offset="0x2c0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB1G1R" caption="RPB1/G1" mask="0x3f" values="RPB1G1_PINS"/>
        </register>
        <register name="RPB1G2R" offset="0x2c4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB1G2R" caption="RPB1/G2" mask="0x3f" values="RPB1G2_PINS"/>
        </register>
        <register name="RPB1G3R" offset="0x2c8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB1G3R" caption="RPB1/G3" mask="0x3f" values="RPB1G3_PINS"/>
        </register>
        <register name="RPB2G2R" offset="0x2cc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB2G2R" caption="RPB2/G2" mask="0x3f" values="RPB2G2_PINS"/>
        </register>
        <register name="RPB2G3R" offset="0x2d0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB2G3R" caption="RPB2/G3" mask="0x3f" values="RPB2G3_PINS"/>
        </register>
        <register name="RPB2G4R" offset="0x2d4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB2G4R" caption="RPB2/G4" mask="0x3f" values="RPB2G4_PINS"/>
        </register>
        <register name="RPB3G1R" offset="0x2d8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB3G1R" caption="RPB3/G1" mask="0x3f" values="RPB3G1_PINS"/>
        </register>
        <register name="RPB3G3R" offset="0x2dc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB3G3R" caption="RPB3/G3" mask="0x3f" values="RPB3G3_PINS"/>
        </register>
        <register name="RPB3G4R" offset="0x2e0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB3G4R" caption="RPB3/G4" mask="0x3f" values="RPB3G4_PINS"/>
        </register>
        <register name="RPB4G1R" offset="0x2e4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB4G1R" caption="RPB4/G1" mask="0x3f" values="RPB4G1_PINS"/>
        </register>
        <register name="RPB4G2R" offset="0x2e8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB4G2R" caption="RPB4/G2" mask="0x3f" values="RPB4G2_PINS"/>
        </register>
        <register name="RPB4G4R" offset="0x2ec" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB4G4R" caption="RPB4/G4" mask="0x3f" values="RPB4G4_PINS"/>
        </register>
        <register name="RPB4G5R" offset="0x2f0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB4G5R" caption="RPB4/G5" mask="0x3f" values="RPB4G5_PINS"/>
        </register>
        <register name="RPB5G2R" offset="0x2f4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB5G2R" caption="RPB5/G2" mask="0x3f" values="RPB5G2_PINS"/>
        </register>
        <register name="RPB5G3R" offset="0x2f8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB5G3R" caption="RPB5/G3" mask="0x3f" values="RPB5G3_PINS"/>
        </register>
        <register name="RPB5G6R" offset="0x2fc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB5G6R" caption="RPB5/G6" mask="0x3f" values="RPB5G6_PINS"/>
        </register>
        <register name="RPB6G1R" offset="0x300" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB6G1R" caption="RPB6/G1" mask="0x3f" values="RPB6G1_PINS"/>
        </register>
        <register name="RPB6G3R" offset="0x304" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB6G3R" caption="RPB6/G3" mask="0x3f" values="RPB6G3_PINS"/>
        </register>
        <register name="RPB6G4R" offset="0x308" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB6G4R" caption="RPB6/G4" mask="0x3f" values="RPB6G4_PINS"/>
        </register>
        <register name="RPB6G6R" offset="0x30c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB6G6R" caption="RPB6/G6" mask="0x3f" values="RPB6G6_PINS"/>
        </register>
        <register name="RPB7G1R" offset="0x310" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB7G1R" caption="RPB7/G1" mask="0x3f" values="RPB7G1_PINS"/>
        </register>
        <register name="RPB7G2R" offset="0x314" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB7G2R" caption="RPB7/G2" mask="0x3f" values="RPB7G2_PINS"/>
        </register>
        <register name="RPB7G4R" offset="0x318" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB7G4R" caption="RPB7/G4" mask="0x3f" values="RPB7G4_PINS"/>
        </register>
        <register name="RPB8G1R" offset="0x31c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB8G1R" caption="RPB8/G1" mask="0x3f" values="RPB8G1_PINS"/>
        </register>
        <register name="RPB8G2R" offset="0x320" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB8G2R" caption="RPB8/G2" mask="0x3f" values="RPB8G2_PINS"/>
        </register>
        <register name="RPB8G3R" offset="0x324" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB8G3R" caption="RPB8/G3" mask="0x3f" values="RPB8G3_PINS"/>
        </register>
