zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
        <register name="RPB8G6R" offset="0x328" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB8G6R" caption="RPB8/G6" mask="0x3f" values="RPB8G6_PINS"/>
        </register>
        <register name="RPB9G2R" offset="0x32c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB9G2R" caption="RPB9/G2" mask="0x3f" values="RPB9G2_PINS"/>
        </register>
        <register name="RPB9G3R" offset="0x330" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB9G3R" caption="RPB9/G3" mask="0x3f" values="RPB9G3_PINS"/>
        </register>
        <register name="RPB9G6R" offset="0x334" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB9G6R" caption="RPB9/G6" mask="0x3f" values="RPB9G6_PINS"/>
        </register>
        <register name="RPB10G3R" offset="0x338" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB10G3R" caption="RPB10/G3" mask="0x3f" values="RPB10G3_PINS"/>
        </register>
        <register name="RPB10G4R" offset="0x33c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB10G4R" caption="RPB10/G4" mask="0x3f" values="RPB10G4_PINS"/>
        </register>
        <register name="RPB10G5R" offset="0x340" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB10G5R" caption="RPB10/G5" mask="0x3f" values="RPB10G5_PINS"/>
        </register>
        <register name="RPB11G1R" offset="0x344" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB11G1R" caption="RPB11/G1" mask="0x3f" values="RPB11G1_PINS"/>
        </register>
        <register name="RPB11G4R" offset="0x348" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB11G4R" caption="RPB11/G4" mask="0x3f" values="RPB11G4_PINS"/>
        </register>
        <register name="RPB12G1R" offset="0x34c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB12G1R" caption="RPB12/G1" mask="0x3f" values="RPB12G1_PINS"/>
        </register>
        <register name="RPB12G2R" offset="0x350" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB12G2R" caption="RPB12/G2" mask="0x3f" values="RPB12G2_PINS"/>
        </register>
        <register name="RPB13G2R" offset="0x354" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB13G2R" caption="RPB13/G2" mask="0x3f" values="RPB13G2_PINS"/>
        </register>
        <register name="RPB13G3R" offset="0x358" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB13G3R" caption="RPB13/G3" mask="0x3f" values="RPB13G3_PINS"/>
        </register>
      </register-group>
      <!-- INPUT pin group values -->
      <value-group name="EXTINT0_PINS" caption="Group1">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="RPA0" caption="RPA0" value="1"/>
        <value name="RPA6" caption="RPA6" value="2"/>
        <value name="RPA11" caption="RPA11" value="3"/>
        <value name="RPB0" caption="RPB0" value="4"/>
        <value name="RPB6" caption="RPB6" value="5"/>
        <value name="RPB11" caption="RPB11" value="6"/>
        <value name="RPB1" caption="RPB1" value="11"/>
        <value name="RPA3" caption="RPA3" value="15"/>
        <value name="RPA7" caption="RPA7" value="16"/>
        <value name="RPB4" caption="RPB4" value="17"/>
        <value name="RPB8" caption="RPB8" value="18"/>
        <value name="RPB12" caption="RPB12" value="19"/>
        <value name="RPA2" caption="RPA2" value="20"/>
        <value name="RPA10" caption="RPA10" value="21"/>
        <value name="RPA14" caption="RPA14" value="22"/>
        <value name="RPB3" caption="RPB3" value="23"/>
        <value name="RPB7" caption="RPB7" value="24"/>
        <value name="RPA9" caption="RPA9" value="25"/>
      </value-group>
      <value-group name="EXTINT1_PINS" caption="Group2">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="RPA1" caption="RPA1" value="1"/>
        <value name="RPA7" caption="RPA7" value="2"/>
        <value name="RPA12" caption="RPA12" value="3"/>
        <value name="RPB1" caption="RPB1" value="4"/>
        <value name="RPB7" caption="RPB7" value="5"/>
        <value name="RPA3" caption="RPA3" value="10"/>
        <value name="RPB2" caption="RPB2" value="11"/>
        <value name="RPA4" caption="RPA4" value="15"/>
        <value name="RPA8" caption="RPA8" value="16"/>
        <value name="RPB12" caption="RPB12" value="17"/>
        <value name="RPB5" caption="RPB5" value="18"/>
        <value name="RPB9" caption="RPB9" value="19"/>
        <value name="RPB13" caption="RPB13" value="20"/>
        <value name="RPB0" caption="RPB0" value="21"/>
        <value name="RPB4" caption="RPB4" value="22"/>
        <value name="RPB8" caption="RPB8" value="23"/>
        <value name="RPA0" caption="RPA0" value="24"/>
        <value name="RPA11" caption="RPA11" value="25"/>
      </value-group>
      <value-group name="EXTINT2_PINS" caption="Group3">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="RPA2" caption="RPA2" value="1"/>
        <value name="RPA8" caption="RPA8" value="2"/>
        <value name="RPA13" caption="RPA13" value="3"/>
        <value name="RPB2" caption="RPB2" value="4"/>
        <value name="RPB8" caption="RPB8" value="5"/>
        <value name="RPB13" caption="RPB13" value="6"/>
        <value name="RPA4" caption="RPA4" value="10"/>
        <value name="RPB3" caption="RPB3" value="11"/>
        <value name="RPA5" caption="RPA5" value="15"/>
        <value name="RPA9" caption="RPA9" value="16"/>
        <value name="RPB6" caption="RPB6" value="17"/>
        <value name="RPB10" caption="RPB10" value="18"/>
        <value name="RPA0" caption="RPA0" value="19"/>
        <value name="RPB1" caption="RPB1" value="20"/>
        <value name="RPB5" caption="RPB5" value="21"/>
        <value name="RPB9" caption="RPB9" value="22"/>
        <value name="RPA1" caption="RPA1" value="23"/>
        <value name="RPA12" caption="RPA12" value="24"/>
      </value-group>
