zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
      <value-group name="TC0WO0G1_PINS" caption="Group1">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="RPA0" caption="RPA0" value="1"/>
        <value name="RPA6" caption="RPA6" value="2"/>
        <value name="RPA11" caption="RPA11" value="3"/>
        <value name="RPB0" caption="RPB0" value="4"/>
        <value name="RPB6" caption="RPB6" value="5"/>
        <value name="RPB11" caption="RPB11" value="6"/>
        <value name="RPB1" caption="RPB1" value="11"/>
        <value name="RPA3" caption="RPA3" value="15"/>
        <value name="RPA7" caption="RPA7" value="16"/>
        <value name="RPB4" caption="RPB4" value="17"/>
        <value name="RPB8" caption="RPB8" value="18"/>
        <value name="RPB12" caption="RPB12" value="19"/>
        <value name="RPA2" caption="RPA2" value="20"/>
        <value name="RPA10" caption="RPA10" value="21"/>
        <value name="RPA14" caption="RPA14" value="22"/>
        <value name="RPB3" caption="RPB3" value="23"/>
        <value name="RPB7" caption="RPB7" value="24"/>
        <value name="RPA9" caption="RPA9" value="25"/>
      </value-group>
      <value-group name="TC0WO0G2_PINS" caption="Group2">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="RPA1" caption="RPA1" value="1"/>
        <value name="RPA7" caption="RPA7" value="2"/>
        <value name="RPA12" caption="RPA12" value="3"/>
        <value name="RPB1" caption="RPB1" value="4"/>
        <value name="RPB7" caption="RPB7" value="5"/>
        <value name="RPA3" caption="RPA3" value="10"/>
        <value name="RPB2" caption="RPB2" value="11"/>
        <value name="RPA4" caption="RPA4" value="15"/>
        <value name="RPA8" caption="RPA8" value="16"/>
        <value name="RPB12" caption="RPB12" value="17"/>
        <value name="RPB5" caption="RPB5" value="18"/>
        <value name="RPB9" caption="RPB9" value="19"/>
        <value name="RPB13" caption="RPB13" value="20"/>
        <value name="RPB0" caption="RPB0" value="21"/>
        <value name="RPB4" caption="RPB4" value="22"/>
        <value name="RPB8" caption="RPB8" value="23"/>
        <value name="RPA0" caption="RPA0" value="24"/>
        <value name="RPA11" caption="RPA11" value="25"/>
      </value-group>
      <value-group name="TC0WO1G3_PINS" caption="Group3">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="RPA2" caption="RPA2" value="1"/>
        <value name="RPA8" caption="RPA8" value="2"/>
        <value name="RPA13" caption="RPA13" value="3"/>
        <value name="RPB2" caption="RPB2" value="4"/>
        <value name="RPB8" caption="RPB8" value="5"/>
        <value name="RPB13" caption="RPB13" value="6"/>
        <value name="RPA4" caption="RPA4" value="10"/>
        <value name="RPB3" caption="RPB3" value="11"/>
        <value name="RPA5" caption="RPA5" value="15"/>
        <value name="RPA9" caption="RPA9" value="16"/>
        <value name="RPB6" caption="RPB6" value="17"/>
        <value name="RPB10" caption="RPB10" value="18"/>
        <value name="RPA0" caption="RPA0" value="19"/>
        <value name="RPB1" caption="RPB1" value="20"/>
        <value name="RPB5" caption="RPB5" value="21"/>
        <value name="RPB9" caption="RPB9" value="22"/>
        <value name="RPA1" caption="RPA1" value="23"/>
        <value name="RPA12" caption="RPA12" value="24"/>
      </value-group>
      <value-group name="TC0WO1G4_PINS" caption="Group4">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="RPA3" caption="RPA3" value="1"/>
        <value name="RPA9" caption="RPA9" value="2"/>
        <value name="RPA14" caption="RPA14" value="3"/>
        <value name="RPB3" caption="RPB3" value="4"/>
        <value name="RPA0" caption="RPA0" value="8"/>
        <value name="RPB4" caption="RPB4" value="9"/>
        <value name="RPA6" caption="RPA6" value="13"/>
        <value name="RPA10" caption="RPA10" value="14"/>
        <value name="RPB7" caption="RPB7" value="15"/>
        <value name="RPB11" caption="RPB11" value="16"/>
        <value name="RPA1" caption="RPA1" value="17"/>
        <value name="RPA5" caption="RPA5" value="18"/>
        <value name="RPA13" caption="RPA13" value="19"/>
        <value name="RPB2" caption="RPB2" value="20"/>
        <value name="RPB6" caption="RPB6" value="21"/>
        <value name="RPB10" caption="RPB10" value="22"/>
        <value name="RPA8" caption="RPA8" value="23"/>
        <value name="RPA2" caption="RPA2" value="24"/>
      </value-group>
      <value-group name="TC1WO0G1_PINS" caption="Group1">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="RPA0" caption="RPA0" value="1"/>
        <value name="RPA6" caption="RPA6" value="2"/>
        <value name="RPA11" caption="RPA11" value="3"/>
        <value name="RPB0" caption="RPB0" value="4"/>
        <value name="RPB6" caption="RPB6" value="5"/>
        <value name="RPB11" caption="RPB11" value="6"/>
        <value name="RPB1" caption="RPB1" value="11"/>
        <value name="RPA3" caption="RPA3" value="15"/>
        <value name="RPA7" caption="RPA7" value="16"/>
        <value name="RPB4" caption="RPB4" value="17"/>
        <value name="RPB8" caption="RPB8" value="18"/>
        <value name="RPB12" caption="RPB12" value="19"/>
        <value name="RPA2" caption="RPA2" value="20"/>
        <value name="RPA10" caption="RPA10" value="21"/>
        <value name="RPA14" caption="RPA14" value="22"/>
        <value name="RPB3" caption="RPB3" value="23"/>
        <value name="RPB7" caption="RPB7" value="24"/>
        <value name="RPA9" caption="RPA9" value="25"/>
      </value-group>
      <value-group name="TC1WO1G2_PINS" caption="Group2">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="RPA1" caption="RPA1" value="1"/>
        <value name="RPA7" caption="RPA7" value="2"/>
        <value name="RPA12" caption="RPA12" value="3"/>
        <value name="RPB1" caption="RPB1" value="4"/>
        <value name="RPB7" caption="RPB7" value="5"/>
        <value name="RPA3" caption="RPA3" value="10"/>
        <value name="RPB2" caption="RPB2" value="11"/>
        <value name="RPA4" caption="RPA4" value="15"/>
        <value name="RPA8" caption="RPA8" value="16"/>
        <value name="RPB12" caption="RPB12" value="17"/>
        <value name="RPB5" caption="RPB5" value="18"/>
        <value name="RPB9" caption="RPB9" value="19"/>
        <value name="RPB13" caption="RPB13" value="20"/>
        <value name="RPB0" caption="RPB0" value="21"/>
        <value name="RPB4" caption="RPB4" value="22"/>
        <value name="RPB8" caption="RPB8" value="23"/>
        <value name="RPA0" caption="RPA0" value="24"/>
        <value name="RPA11" caption="RPA11" value="25"/>
      </value-group>
