zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
      <value-group name="QEIHOME0G2_PINS" caption="Group2">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="RPA1" caption="RPA1" value="1"/>
        <value name="RPA7" caption="RPA7" value="2"/>
        <value name="RPA12" caption="RPA12" value="3"/>
        <value name="RPB1" caption="RPB1" value="4"/>
        <value name="RPB7" caption="RPB7" value="5"/>
        <value name="RPA3" caption="RPA3" value="10"/>
        <value name="RPB2" caption="RPB2" value="11"/>
        <value name="RPA4" caption="RPA4" value="15"/>
        <value name="RPA8" caption="RPA8" value="16"/>
        <value name="RPB12" caption="RPB12" value="17"/>
        <value name="RPB5" caption="RPB5" value="18"/>
        <value name="RPB9" caption="RPB9" value="19"/>
        <value name="RPB13" caption="RPB13" value="20"/>
        <value name="RPB0" caption="RPB0" value="21"/>
        <value name="RPB4" caption="RPB4" value="22"/>
        <value name="RPB8" caption="RPB8" value="23"/>
        <value name="RPA0" caption="RPA0" value="24"/>
        <value name="RPA11" caption="RPA11" value="25"/>
      </value-group>
      <value-group name="QEIINDX0G2_PINS" caption="Group2">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="RPA1" caption="RPA1" value="1"/>
        <value name="RPA7" caption="RPA7" value="2"/>
        <value name="RPA12" caption="RPA12" value="3"/>
        <value name="RPB1" caption="RPB1" value="4"/>
        <value name="RPB7" caption="RPB7" value="5"/>
        <value name="RPA3" caption="RPA3" value="10"/>
        <value name="RPB2" caption="RPB2" value="11"/>
        <value name="RPA4" caption="RPA4" value="15"/>
        <value name="RPA8" caption="RPA8" value="16"/>
        <value name="RPB12" caption="RPB12" value="17"/>
        <value name="RPB5" caption="RPB5" value="18"/>
        <value name="RPB9" caption="RPB9" value="19"/>
        <value name="RPB13" caption="RPB13" value="20"/>
        <value name="RPB0" caption="RPB0" value="21"/>
        <value name="RPB4" caption="RPB4" value="22"/>
        <value name="RPB8" caption="RPB8" value="23"/>
        <value name="RPA0" caption="RPA0" value="24"/>
        <value name="RPA11" caption="RPA11" value="25"/>
      </value-group>
      <value-group name="QEIINDX0G3_PINS" caption="Group3">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="RPA2" caption="RPA2" value="1"/>
        <value name="RPA8" caption="RPA8" value="2"/>
        <value name="RPA13" caption="RPA13" value="3"/>
        <value name="RPB2" caption="RPB2" value="4"/>
        <value name="RPB8" caption="RPB8" value="5"/>
        <value name="RPB13" caption="RPB13" value="6"/>
        <value name="RPA4" caption="RPA4" value="10"/>
        <value name="RPB3" caption="RPB3" value="11"/>
        <value name="RPA5" caption="RPA5" value="15"/>
        <value name="RPA9" caption="RPA9" value="16"/>
        <value name="RPB6" caption="RPB6" value="17"/>
        <value name="RPB10" caption="RPB10" value="18"/>
        <value name="RPA0" caption="RPA0" value="19"/>
        <value name="RPB1" caption="RPB1" value="20"/>
        <value name="RPB5" caption="RPB5" value="21"/>
        <value name="RPB9" caption="RPB9" value="22"/>
        <value name="RPA1" caption="RPA1" value="23"/>
        <value name="RPA12" caption="RPA12" value="24"/>
      </value-group>
      <value-group name="QEIQEA0G3_PINS" caption="Group3">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="RPA2" caption="RPA2" value="1"/>
        <value name="RPA8" caption="RPA8" value="2"/>
        <value name="RPA13" caption="RPA13" value="3"/>
        <value name="RPB2" caption="RPB2" value="4"/>
        <value name="RPB8" caption="RPB8" value="5"/>
        <value name="RPB13" caption="RPB13" value="6"/>
        <value name="RPA4" caption="RPA4" value="10"/>
        <value name="RPB3" caption="RPB3" value="11"/>
        <value name="RPA5" caption="RPA5" value="15"/>
        <value name="RPA9" caption="RPA9" value="16"/>
        <value name="RPB6" caption="RPB6" value="17"/>
        <value name="RPB10" caption="RPB10" value="18"/>
        <value name="RPA0" caption="RPA0" value="19"/>
        <value name="RPB1" caption="RPB1" value="20"/>
        <value name="RPB5" caption="RPB5" value="21"/>
        <value name="RPB9" caption="RPB9" value="22"/>
        <value name="RPA1" caption="RPA1" value="23"/>
        <value name="RPA12" caption="RPA12" value="24"/>
      </value-group>
      <value-group name="QEIQEA0G4_PINS" caption="Group4">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="RPA3" caption="RPA3" value="1"/>
        <value name="RPA9" caption="RPA9" value="2"/>
        <value name="RPA14" caption="RPA14" value="3"/>
        <value name="RPB3" caption="RPB3" value="4"/>
        <value name="RPA0" caption="RPA0" value="8"/>
        <value name="RPB4" caption="RPB4" value="9"/>
        <value name="RPA6" caption="RPA6" value="13"/>
        <value name="RPA10" caption="RPA10" value="14"/>
        <value name="RPB7" caption="RPB7" value="15"/>
        <value name="RPB11" caption="RPB11" value="16"/>
        <value name="RPA1" caption="RPA1" value="17"/>
        <value name="RPA5" caption="RPA5" value="18"/>
        <value name="RPA13" caption="RPA13" value="19"/>
        <value name="RPB2" caption="RPB2" value="20"/>
        <value name="RPB6" caption="RPB6" value="21"/>
        <value name="RPB10" caption="RPB10" value="22"/>
        <value name="RPA8" caption="RPA8" value="23"/>
        <value name="RPA2" caption="RPA2" value="24"/>
      </value-group>
      <value-group name="QEIQEB0G4_PINS" caption="Group4">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="RPA3" caption="RPA3" value="1"/>
        <value name="RPA9" caption="RPA9" value="2"/>
        <value name="RPA14" caption="RPA14" value="3"/>
        <value name="RPB3" caption="RPB3" value="4"/>
        <value name="RPA0" caption="RPA0" value="8"/>
        <value name="RPB4" caption="RPB4" value="9"/>
        <value name="RPA6" caption="RPA6" value="13"/>
        <value name="RPA10" caption="RPA10" value="14"/>
        <value name="RPB7" caption="RPB7" value="15"/>
        <value name="RPB11" caption="RPB11" value="16"/>
        <value name="RPA1" caption="RPA1" value="17"/>
        <value name="RPA5" caption="RPA5" value="18"/>
        <value name="RPA13" caption="RPA13" value="19"/>
        <value name="RPB2" caption="RPB2" value="20"/>
        <value name="RPB6" caption="RPB6" value="21"/>
        <value name="RPB10" caption="RPB10" value="22"/>
        <value name="RPA8" caption="RPA8" value="23"/>
        <value name="RPA2" caption="RPA2" value="24"/>
      </value-group>
      <value-group name="QEIQEB0G5_PINS" caption="Group5">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="RPA4" caption="RPA4" value="1"/>
        <value name="RPA10" caption="RPA10" value="2"/>
        <value name="RPB4" caption="RPB4" value="3"/>
        <value name="RPB10" caption="RPB10" value="4"/>
        <value name="RPA1" caption="RPA1" value="7"/>
        <value name="RPB0" caption="RPB0" value="8"/>
      </value-group>
      <value-group name="ACCMPTEN_PINS" caption="Group1">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="RPA0" caption="RPA0" value="1"/>
        <value name="RPA6" caption="RPA6" value="2"/>
        <value name="RPA11" caption="RPA11" value="3"/>
        <value name="RPB0" caption="RPB0" value="4"/>
        <value name="RPB6" caption="RPB6" value="5"/>
        <value name="RPB11" caption="RPB11" value="6"/>
        <value name="RPB1" caption="RPB1" value="11"/>
        <value name="RPA3" caption="RPA3" value="15"/>
        <value name="RPA7" caption="RPA7" value="16"/>
        <value name="RPB4" caption="RPB4" value="17"/>
        <value name="RPB8" caption="RPB8" value="18"/>
        <value name="RPB12" caption="RPB12" value="19"/>
        <value name="RPA2" caption="RPA2" value="20"/>
        <value name="RPA10" caption="RPA10" value="21"/>
        <value name="RPA14" caption="RPA14" value="22"/>
        <value name="RPB3" caption="RPB3" value="23"/>
        <value name="RPB7" caption="RPB7" value="24"/>
        <value name="RPA9" caption="RPA9" value="25"/>
      </value-group>
      <value-group name="CAN1RX_PINS" caption="Group3">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="RPA2" caption="RPA2" value="1"/>
        <value name="RPA8" caption="RPA8" value="2"/>
        <value name="RPA13" caption="RPA13" value="3"/>
        <value name="RPB2" caption="RPB2" value="4"/>
        <value name="RPB8" caption="RPB8" value="5"/>
        <value name="RPB13" caption="RPB13" value="6"/>
        <value name="RPA4" caption="RPA4" value="10"/>
        <value name="RPB3" caption="RPB3" value="11"/>
        <value name="RPA5" caption="RPA5" value="15"/>
        <value name="RPA9" caption="RPA9" value="16"/>
        <value name="RPB6" caption="RPB6" value="17"/>
        <value name="RPB10" caption="RPB10" value="18"/>
        <value name="RPA0" caption="RPA0" value="19"/>
        <value name="RPB1" caption="RPB1" value="20"/>
        <value name="RPB5" caption="RPB5" value="21"/>
        <value name="RPB9" caption="RPB9" value="22"/>
        <value name="RPA1" caption="RPA1" value="23"/>
        <value name="RPA12" caption="RPA12" value="24"/>
      </value-group>
      <value-group name="COEXWLANACT_PINS" caption="Group4">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="RPA3" caption="RPA3" value="1"/>
        <value name="RPA9" caption="RPA9" value="2"/>
        <value name="RPA14" caption="RPA14" value="3"/>
        <value name="RPB3" caption="RPB3" value="4"/>
        <value name="RPA0" caption="RPA0" value="8"/>
        <value name="RPB4" caption="RPB4" value="9"/>
        <value name="RPA6" caption="RPA6" value="13"/>
        <value name="RPA10" caption="RPA10" value="14"/>
        <value name="RPB7" caption="RPB7" value="15"/>
        <value name="RPB11" caption="RPB11" value="16"/>
        <value name="RPA1" caption="RPA1" value="17"/>
        <value name="RPA5" caption="RPA5" value="18"/>
        <value name="RPA13" caption="RPA13" value="19"/>
        <value name="RPB2" caption="RPB2" value="20"/>
        <value name="RPB6" caption="RPB6" value="21"/>
        <value name="RPB10" caption="RPB10" value="22"/>
        <value name="RPA8" caption="RPA8" value="23"/>
        <value name="RPA2" caption="RPA2" value="24"/>
      </value-group>
      <!-- OUTPUT pin group values -->
      <value-group name="RPA0G1_PINS" caption="Group1">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="SCOM0P3" caption="SERCOM0/PAD3" value="1"/>
        <value name="SCOM0P2" caption="SERCOM0/PAD2" value="2"/>
        <value name="SCOM1P0" caption="SERCOM1/PAD0" value="3"/>
        <value name="SCOM1P2" caption="SERCOM1/PAD2" value="4"/>
        <value name="SCOM2P3" caption="SERCOM2/PAD3" value="5"/>
        <value name="SCOM2P2" caption="SERCOM2/PAD2" value="6"/>
        <value name="SCOM3P0" caption="SERCOM3/PAD0" value="7"/>
        <value name="SCOM3P2" caption="SERCOM3/PAD2" value="8"/>
        <value name="TCC0WO0" caption="TCC0/WO0" value="13"/>
        <value name="TCC0WO4" caption="TCC0/WO4" value="14"/>
        <value name="TCC1WO0" caption="TCC1/WO0" value="15"/>
        <value name="TCC1WO4" caption="TCC1/WO4" value="16"/>
        <value name="TCC2WO0" caption="TCC2/WO0" value="17"/>
        <value name="TC0WO1" caption="TC0/WO1" value="18"/>
        <value name="TC1WO0" caption="TC1/WO0" value="19"/>
        <value name="TC2WO0" caption="TC2/WO0" value="20"/>
        <value name="TC3WO0" caption="TC3/WO0" value="21"/>
        <value name="TC4WO0" caption="TC4/WO0" value="22"/>
        <value name="TC5WO0" caption="TC5/WO0" value="23"/>
        <value name="TC6WO0" caption="TC6/WO0" value="24"/>
        <value name="TC7WO0" caption="TC7/WO0" value="25"/>
        <value name="TC8WO0" caption="TC8/WO0" value="26"/>
        <value name="QSPICS" caption="QSPI/CS" value="27"/>
        <value name="QD3" caption="QSPI/DATA3" value="28"/>
        <value name="QD2" caption="QSPI/DATA2" value="29"/>
        <value name="QD1" caption="QSPI/DATA1" value="30"/>
        <value name="QEICCMP0" caption="QEI/CCMP0" value="31"/>
        <value name="TSTBUS0" caption="TSTBUS0" value="32"/>
        <value name="TSTBUS4" caption="TSTBUS4" value="33"/>
        <value name="TSTBUS8" caption="TSTBUS8" value="34"/>
        <value name="FECTRL1" caption="FECTRL1" value="35"/>
        <value name="FECTRL2" caption="FECTRL2" value="36"/>
        <value name="COEX_BT_STATE" caption="COEX/BT/STATE" value="37"/>
      </value-group>
      <value-group name="RPA0G2_PINS" caption="Group2">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="CCLO1" caption="CCL/OUT1" value="1"/>
        <value name="SCOM0P0" caption="SERCOM0/PAD0" value="2"/>
        <value name="SCOM0P3" caption="SERCOM0/PAD3" value="3"/>
        <value name="SCOM0P2" caption="SERCOM0/PAD2" value="4"/>
        <value name="SCOM1P3" caption="SERCOM1/PAD3" value="5"/>
        <value name="SCOM1P2" caption="SERCOM1/PAD2" value="6"/>
        <value name="SCOM2P0" caption="SERCOM2/PAD0" value="7"/>
        <value name="SCOM2P3" caption="SERCOM2/PAD3" value="8"/>
        <value name="SCOM2P2" caption="SERCOM2/PAD2" value="9"/>
        <value name="SCOM3P3" caption="SERCOM3/PAD3" value="10"/>
        <value name="SCOM3P2" caption="SERCOM3/PAD2" value="11"/>
        <value name="TCC0WO1" caption="TCC0/WO1" value="17"/>
        <value name="TCC0WO5" caption="TCC0/WO5" value="18"/>
        <value name="TCC0WO3" caption="TCC0/WO3" value="19"/>
        <value name="TCC1WO1" caption="TCC1/WO1" value="20"/>
        <value name="TCC1WO5" caption="TCC1/WO5" value="21"/>
        <value name="TCC1WO3" caption="TCC1/WO3" value="22"/>
        <value name="TCC2WO1" caption="TCC2/WO1" value="23"/>
        <value name="TC0WO1" caption="TC0/WO1" value="24"/>
        <value name="TC1WO1" caption="TC1/WO1" value="25"/>
        <value name="TC2WO1" caption="TC2/WO1" value="26"/>
        <value name="TC3WO1" caption="TC3/WO1" value="27"/>
        <value name="TC4WO1" caption="TC4/WO1" value="28"/>
        <value name="TC5WO1" caption="TC5/WO1" value="29"/>
        <value name="TC6WO1" caption="TC6/WO1" value="30"/>
        <value name="TC7WO1" caption="TC7/WO1" value="31"/>
        <value name="TC8WO1" caption="TC8/WO1" value="32"/>
        <value name="TC9WO0" caption="TC9/WO0" value="33"/>
        <value name="QSPICS" caption="QSPI/CS" value="34"/>
        <value name="QD0" caption="QSPI/DATA0" value="35"/>
        <value name="QD3" caption="QSPI/DATA3" value="36"/>
        <value name="QD2" caption="QSPI/DATA2" value="37"/>
        <value name="TSTBUS5" caption="TSTBUS5" value="38"/>
        <value name="TSTBUS9" caption="TSTBUS9" value="39"/>
        <value name="FECTRL0" caption="FECTRL0" value="40"/>
        <value name="COEX_RF_ACT" caption="COEX/RF/ACT" value="41"/>
      </value-group>
