zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
      <value-group caption="Counter Control Mode Selection bits" name="QEICON__CCM">
        <value caption="Internal timer mode with optional external count enable" name="INT_TMR_EXT_COUNT" value="0x3"/>
        <value caption="External clock count with optional external count gating" name="EXT_CLOCK_EXT_COUNT" value="0x2"/>
        <value caption="External clock count with external Up/Dn direction selection" name="EXT_CLK_EXT_UPDN" value="0x1"/>
        <value caption="Quadrature Encoder Interface Count mode (x4 mode)" name="COUNT_MODE" value="0x0"/>
      </value-group>
      <value-group caption="External Count Gate Enable bit" name="QEICON__GATEN">
        <value caption="External gate signal controls position counter operation" name="ON" value="0x1"/>
        <value caption="External gate signal has no affect on position counter/timer operation" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Position and Index Counter/Timer Direction Select bit" name="QEICON__CNTPOL">
        <value caption="Counter direction is negative unless modified by external Up/Down signal" name="NEG" value="0x1"/>
        <value caption="Counter direction is positive unless modified by external Up/Down signal" name="POS" value="0x0"/>
      </value-group>
      <value-group caption="Timer Input Clock Prescale Select bits " name="QEICON__INTDIV">
        <value caption="1:128 prescale value" name="1_128" value="0x7"/>
        <value caption="1:64 prescale value" name="1_64" value="0x6"/>
        <value caption="1:32 prescale value" name="1_32" value="0x5"/>
        <value caption="1:16 prescale value" name="1_16" value="0x4"/>
        <value caption="1:8 prescale value" name="1_8" value="0x3"/>
        <value caption="1:4 prescale value" name="1_4" value="0x2"/>
        <value caption="1:2 prescale value" name="1_2" value="0x1"/>
        <value caption="1:1 prescale value" name="1_1" value="0x0"/>
      </value-group>
      <value-group caption="Index Match Value bits" name="QEICON__IMV">
        <value caption="Index match occurs when QEB is 1 and QEA is 1" name="B1_A1" value="0x3"/>
        <value caption="Index match occurs when QEB is 1 and QEA is 0" name="B1_A0" value="0x2"/>
        <value caption="Index match occurs when QEB is 0 and QEA is 1" name="B0_A1" value="0x1"/>
        <value caption="Index match occurs when QEB is 0 and QEA is 0" name="B0_A0" value="0x0"/>
      </value-group>
      <value-group caption="Position Counter Initialization Mode Select bits" name="QEICON__PIMOD">
        <value caption="Modulo Count mode for position counter and every index event resets the position counter" name="7" value="0x7"/>
        <value caption="Modulo Count mode for position counter" name="6" value="0x6"/>
        <value caption="Resets the position counter when the position counter equals QEIICCH register" name="5" value="0x5"/>
        <value caption="Second index event after home event initializes position counter with contents of QEIICCHregister" name="4" value="0x4"/>
        <value caption="First index event after home event initializes position counter with contents of QEIICCH register" name="3" value="0x3"/>
        <value caption="Next index input event initializes the position counter with contents of QEIICCH register" name="2" value="0x2"/>
        <value caption="Every Index input event resets the position counter" name="1" value="0x1"/>
        <value caption="Index input event does not affect position counter" name="0" value="0x0"/>
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="QEICON__QEISIDL">
        <value caption="Discontinue module operation when device enters Idle mode" name="DISCONT" value="0x1"/>
        <value caption="Continue module operation in Idle mode" name="CONT" value="0x0"/>
      </value-group>
      <value-group caption="Quadrature Encoder Interface Module Counter Enable bit" name="QEICON__QEIEN">
        <value caption="Module counters are enabled" name="ON" value="0x1"/>
        <value caption="Module counters are disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Status of QEAx Input Pin after Polarity Control and SWPAB Pin Swapping bit" name="QEIIOC__QEA">
        <value caption="Status of QEA input pin after polarity control and SWPAB pin swapping" name="1" value="0x1"/>
        <value caption="Status of QEA input pin after polarity control and SWPAB pin swapping" name="0" value="0x0"/>
      </value-group>
      <value-group caption="Status of QEBx Input Pin after Polarity Control and SWPAB Pin Swapping bit" name="QEIIOC__QEB">
        <value caption="Status of QEB input pin after polarity control and SWPAB pin swapping" name="1" value="0x1"/>
        <value caption="Status of QEB input pin after polarity control and SWPAB pin swapping" name="0" value="0x0"/>
      </value-group>
      <value-group caption="QEAx Input Polarity Select bit" name="QEIIOC__QEAPOL">
        <value caption="Input is inverted" name="INVERT" value="0x1"/>
        <value caption="Input is not inverted" name="NORMAL" value="0x0"/>
      </value-group>
      <value-group caption="QEBx Input Polarity Select bit" name="QEIIOC__QEBPOL">
        <value caption="Input is inverted" name="INVERT" value="0x1"/>
        <value caption="Input is not inverted" name="NORMAL" value="0x0"/>
      </value-group>
      <value-group caption="INDXx Input Polarity Select bit" name="QEIIOC__IDXPOL">
        <value caption="Input is inverted" name="INVERT" value="0x1"/>
        <value caption="Input is not inverted" name="NORMAL" value="0x0"/>
      </value-group>
      <value-group caption="HOMEx Input Polarity Select bit" name="QEIIOC__HOMPOL">
        <value caption="Input is inverted" name="INVERT" value="0x1"/>
        <value caption="Input is not inverted" name="NORMAL" value="0x0"/>
      </value-group>
      <value-group caption="Swap QEA and QEB Inputs bit" name="QEIIOC__SWPAB">
        <value caption="QEAx and QEBx are swapped prior to quadrature decoder logic" name="SWAP" value="0x1"/>
        <value caption="QEAx and QEBx are not swapped" name="NORMAL" value="0x0"/>
      </value-group>
