zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
      <value-group caption="QEI Module Output Function Mode Select bits" name="QEIIOC__OUTFNC">
        <value caption="The position coutner is either case" name="EITHER" value="0x3"/>
        <value caption="The position counter less than or equal to the range of CMPLH and CMPLL" name="LESS_THAN" value="0x2"/>
        <value caption="The position counter greater than or equal to the range of ICCH and ICCL" name="GREATER_THAN" value="0x1"/>
        <value caption="Output is disabled" name="DISABLE" value="0x0"/>
      </value-group>
      <value-group caption="QEA/QEB/INDX/HOMEx Digital Input Filter Clock Divide Select bits" name="QEIIOC__QFDIV">
        <value caption="1:128 clock divide" name="1_128" value="0x7"/>
        <value caption="1:64 clock divide" name="1_64" value="0x6"/>
        <value caption="1:32 clock divide" name="1_32" value="0x5"/>
        <value caption="1:16 clock divide" name="1_16" value="0x4"/>
        <value caption="1:8 clock divide" name="1_8" value="0x3"/>
        <value caption="1:4 clock divide" name="1_4" value="0x2"/>
        <value caption="1:2 clock divide" name="1_2" value="0x1"/>
        <value caption="1:1 clock divide" name="1_1" value="0x0"/>
      </value-group>
      <value-group caption="QEA/QEB/INDX/HOMEx Digital Filter Enable bit" name="QEIIOC__FLTREN">
        <value caption="Input Pin Digital filter is enabled" name="ON" value="0x1"/>
        <value caption="Input Pin Digital filter is disabled (bypassed)" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Position Counter Input Capture Enable bit" name="QEIIOC__QCAPEN">
        <value caption="Positive edge detect of Home input triggers position capture function" name="TRIGGERED" value="0x1"/>
        <value caption="Home input event (positive edge) does not trigger a capture even" name="NOT_TRIGGERED" value="0x0"/>
      </value-group>
      <value-group caption="Position Counter Input Capture by Home Event Enable bit" name="QEIIOC__HCAPEN">
        <value caption="HOMEx input event (positive edge) triggers a position capture event" name="TRIGGERED" value="0x1"/>
        <value caption="HOMEx input event (positive edge) does not trigger a position capture event" name="NOT_TRIGGERED" value="0x0"/>
      </value-group>
      <value-group caption="Index Input Event Interrupt Enable bit" name="QEISTAT__IDXIEN">
        <value caption="Interrupt is enabled" name="ON" value="0x1"/>
        <value caption="Interrupt is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Status Flag for Index Event Status bit" name="QEISTAT__IDXIRQ">
        <value caption="Index event has occurred" name="ON" value="0x1"/>
        <value caption="No Index event has occurred" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Home Input Event Interrupt Enable bit" name="QEISTAT__HOMIEN">
        <value caption="Interrupt is enabled" name="ON" value="0x1"/>
        <value caption="Interrupt is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Status Flag for Home Event Status bit" name="QEISTAT__HOMIRQ">
        <value caption="Home event has occurred" name="ON" value="0x1"/>
        <value caption="No Home event has occurred" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Velocity Counter Overflow Interrupt Enable bit" name="QEISTAT__VELOVIEN">
        <value caption="Interrupt is enabled" name="ON" value="0x1"/>
        <value caption="Interrupt is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Velocity Counter Overflow Status bit" name="QEISTAT__VELOVIRQ">
        <value caption="Overflow has occurred" name="OVERFLOW" value="0x1"/>
        <value caption="No overflow has not occurred" name="NO_OVERFLOW" value="0x0"/>
      </value-group>
      <value-group caption="Position Counter Initialization Process Complete Interrupt Enable bit" name="QEISTAT__PCIIEN">
        <value caption="Interrupt is enabled" name="ON" value="0x1"/>
        <value caption="Interrupt is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Position Counter Initialization Process Complete Status bit" name="QEISTAT__PCIIRQ">
        <value caption="POSxCNT was reinitialized" name="DONE" value="0x1"/>
        <value caption="POSxCNT was not reinitialized" name="NOT_DONE" value="0x0"/>
      </value-group>
      <value-group caption="Position Counter Overflow Interrupt Enable bit" name="QEISTAT__POSOVIEN">
        <value caption="Interrupt is enabled" name="ON" value="0x1"/>
        <value caption="Interrupt is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Position Counter Overflow Status bit" name="QEISTAT__POSOVIRQ">
        <value caption="Overflow has occurred" name="OVERFLOW" value="0x1"/>
        <value caption="No overflow has occurred" name="NO_OVERFLOW" value="0x0"/>
      </value-group>
      <value-group caption="Position Counter Less Than or Equal Compare Interrupt Enable bit" name="QEISTAT__PCLEQIEN">
        <value caption="Interrupt is enabled" name="ON" value="0x1"/>
        <value caption="Interrupt is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Position Counter Less Than or Equal Compare Status bit" name="QEISTAT__PCLEQIRQ">
        <value caption="POSxCNT less than or equal to QEICMPL" name="LESS_EQUAL" value="0x1"/>
        <value caption="POSxCNT greater than QEICMPL" name="GREATER" value="0x0"/>
      </value-group>
      <value-group caption="Position Counter Greater Than or Equal Compare Interrupt Enable bit" name="QEISTAT__PCHEQIEN">
        <value caption="Interrupt is enabled" name="ON" value="0x1"/>
        <value caption="Interrupt is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Position Counter Greater Than or Equal Compare Status bit" name="QEISTAT__PCHEQIRQ">
        <value caption="POSxCNT greater than or equal to QEIICCH" name="MORE_EQUAL" value="0x1"/>
        <value caption="POSxCNT less than QEIICCH" name="LESS" value="0x0"/>
      </value-group>
    </module>
    <module name="QSPI" id="U2008" version="1.6.3" caption="Quad SPI interface">
      <register-group name="QSPI" caption="Quad SPI interface">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="LASTXFER" caption="Last Transfer" mask="0x1000000"/>
        </register>
        <register name="CTRLB" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Control B">
          <bitfield name="MODE" caption="Serial Memory Mode" mask="0x1" values="QSPI_CTRLB__MODE"/>
          <bitfield name="LOOPEN" caption="Local Loopback Enable" mask="0x2" values="QSPI_CTRLB__LOOPEN"/>
          <bitfield name="WDRBT" caption="Wait Data Read Before Transfer" mask="0x4"/>
          <bitfield name="SMEMREG" caption="Serial Memory reg" mask="0x8"/>
          <bitfield name="CSMODE" caption="Chip Select Mode" mask="0x30" values="QSPI_CTRLB__CSMODE"/>
          <bitfield name="DATALEN" caption="Data Length" mask="0xF00" values="QSPI_CTRLB__DATALEN"/>
          <bitfield name="DLYBCT" caption="Delay Between Consecutive Transfers" mask="0xFF0000"/>
          <bitfield name="DLYCS" caption="Minimum Inactive CS Delay" mask="0xFF000000"/>
        </register>
        <register name="BAUD" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Baud Rate">
          <bitfield name="CPOL" caption="Clock Polarity" mask="0x1"/>
          <bitfield name="CPHA" caption="Clock Phase" mask="0x2"/>
          <bitfield name="BAUD" caption="Serial Clock Baud Rate" mask="0xFF00"/>
          <bitfield name="DLYBS" caption="Delay Before SCK" mask="0xFF0000"/>
        </register>
        <register name="RXDATA" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Receive Data">
          <bitfield name="DATA" caption="Receive Data" mask="0xFFFF"/>
        </register>
        <register name="TXDATA" offset="0x10" rw="W" size="4" initval="0x00000000" caption="Transmit Data">
          <bitfield name="DATA" caption="Transmit Data" mask="0xFFFF"/>
        </register>
