zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
    <module name="ROT" id="05544" name2="sec_root_of_trust_v2" version="Rev A.1" caption="Secure Root of Trust Macro">
      <register-group name="ROT" caption="Secure Root of Trust Macro">
        <register name="SECCFG" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Secure Configuration HOLDING REGISTER1,2">
          <bitfield name="UUID_LCK" caption="Programming lock bits for Unique ID fuses" mask="0x30" values="SECCFG__UUID_LCK"/>
          <bitfield name="DEBUG_LCK" caption="Lock bits for debug/programming" mask="0xC0" values="SECCFG__DEBUG_LCK"/>
          <bitfield name="ROOT_KEY_LCK" caption="Lock bits for storage root Key" mask="0x300" values="SECCFG__ROOT_KEY_LCK"/>
          <bitfield name="BOOT_KEY_LCK" caption="Lock bits for Secure Boot/OTA Key" mask="0xC00" values="SECCFG__BOOT_KEY_LCK"/>
          <bitfield name="PATCH_LCK" caption="Lock bits for patch" mask="0xC000" values="SECCFG__PATCH_LCK"/>
          <bitfield name="ADD_BOOT_KEY" caption="Additional boot Key bit" mask="0x10000"/>
        </register>
        <register name="ANTIROLLBACKCOUNTER" offset="0x4" rw="RW" size="4" count="8" initval="0x00000000" caption="Anti Roll back counter">
          <bitfield name="ANTIROLLBACKCOUNTER" caption="Anti rollback counter bits" mask="0xFF"/>
        </register>
        <register name="LIFECYCLECTR_BOOTKEY" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="Life cycle counter and Secure boot key LSB bytes">
          <bitfield name="LIFECYCLECOUNTER" caption="Life cycle counter bits" mask="0x0F"/>
          <bitfield name="SECUREBOOTKEY_1_2" caption="Secure boot key bits" mask="0xFFFF0000"/>
        </register>
        <register name="SECUREBOOTKEY_3_46" offset="0x28" rw="RW" size="4" count="11" initval="0x00000000" caption="Secure boot key">
          <bitfield name="SECUREBOOTKEY_3_46" caption="Secure boot key bits" mask="0xFFFFFFFF"/>
        </register>
        <register name="SECUREBOOTKEY_47_48_STORAGE_KEY" offset="0x54" rw="RW" size="4" initval="0x00000000" caption="Secure boot key, Storage Key">
          <bitfield name="SECUREBOOTKEY_47_48" caption="Secure boot key bits" mask="0xFFFF"/>
          <bitfield name="STORAGE_KEY_1_2" caption="Storage root key bits" mask="0xFFFF0000"/>
        </register>
        <register name="STORAGE_KEY_3_30" offset="0x58" rw="RW" size="4" count="7" initval="0x00000000" caption="Storage Key">
          <bitfield name="STORAGE_KEY_3_30" caption="Storage Key bits" mask="0xFFFFFFFF"/>
        </register>
        <register name="STORAGE_KEY_FFCFG" offset="0x74" rw="RW" size="4" initval="0x00000000" caption="Storage Key, FFCFG">
          <bitfield name="STORAGE_KEY_31_32" caption="Storage Key bits" mask="0xFFFF"/>
          <bitfield name="DEV_ID_LCK" caption="Device ID bits" mask="0x300000" values="SECCFG__DEV_ID_LCK"/>
          <bitfield name="DIE_INFO_LCK" caption="Die info bits" mask="0xC0000000" values="SECCFG__DIE_INFO_LCK"/>
        </register>
        <register name="DEVICE_ID_PATCH_CFG" offset="0x78" rw="RW" size="4" initval="0x00000000" caption="Device ID and Patch CFG">
          <bitfield name="VSEL" caption="VSEL of device ID" mask="0xFF"/>
          <bitfield name="PATCH_CFG1_LB" caption="Patch CFG-1 lower 16 bits" mask="0xFFFF0000"/>
        </register>
        <register name="PATCH_CFG" offset="0x7C" rw="RW" size="4" initval="0x00000000" caption="Patch CFG">
          <bitfield name="PATCH_CFG1_HB" caption="Patch CFG-1 higher 8 bits" mask="0xff"/>
          <bitfield name="PATCH_CFG2" caption="Patch CFG-2 bits" mask="0xFFFFFF00"/>
        </register>
        <register name="PATCH_CODE" offset="0x80" rw="RW" size="4" count="60" initval="0x00000000" caption="Patch Code">
          <bitfield name="PATCH_CODE" caption="Patch Code bits" mask="0xFFFFFFFF"/>
        </register>
        <register name="UUID" offset="0x170" rw="RW" size="4" count="4" initval="0x00" caption="Unique ID">
          <bitfield name="UUID" caption="Unique ID bits" mask="0xFFFFFFFF"/>
        </register>
        <register name="SEC_BOOT" offset="0xC00" rw="RW" size="4" initval="0x00010002" caption="Secure Boot Register">
          <bitfield name="SEC_BOOT_REQD" caption="Bits to indicate that secure boot is required on the next device reset." mask="0x3" values="SEC_BOOT__SEC_BOOT_REQD"/>
          <bitfield name="SEC_FLASH_NOT_DIRTY" caption="Bits to indicate whether the Flash contents have been changed since the last code authentication operation" mask="0x30" values="SEC_BOOT__SEC_FLASH_NOT_DIRTY"/>
          <bitfield name="SEC_BOOT_STATUS" caption="Bits to indicate that secure boot status" mask="0xFF00"/>
          <bitfield name="SEC_BOOT_DONE" caption="Bits to indicate that secure boot is done" mask="0x30000" values="SEC_BOOT__SEC_BOOT_DONE"/>
        </register>
        <register name="EFUSE_RWDATA" offset="0xC04" rw="RW" size="4" initval="0x00000000" caption="EFuse RW Data Register">
          <bitfield name="DATA" caption="eFuse Program (Write) Data" mask="0xFF"/>
          <bitfield name="ADDR" caption="eFuse Program/Read Address" mask="0xFFF0000"/>
        </register>
        <register name="EFUSE_CON" offset="0xC08" rw="RW" size="4" initval="0x00000000" caption="Efuse Configuration Register2">
          <bitfield name="PGM_1BIT" caption="eFuse CTRL to program 1 bit at a time. Valid only when EN_PGM is set" mask="0x1" values="EFUSE_CON__PGM_1BIT"/>
          <bitfield name="PGM_MODE" caption="eFuse Programming Mode Enable bit" mask="0x2" values="EFUSE_CON__PGM_MODE"/>
          <bitfield name="EN_LD" caption="eFuse Word Read Start bit for loading the fuse byte pointed by ADDR field into the holding register" mask="0x20" values="EFUSE_CON__EN_LD"/>
          <bitfield name="EN_LD_ALL1" caption="eFuse Panel Read Start bit for loading into the holding registers" mask="0x40" values="EFUSE_CON__EN_LD_ALL1"/>
          <bitfield name="EN_PGM" caption="eFuse Programming Start bit" mask="0x80" values="EFUSE_CON__EN_PGM"/>
        </register>
      </register-group>
      <value-group name="SECCFG__UUID_LCK">
        <value name="0" caption="Unique ID is not locked" value="0"/>
        <value name="1" caption="Unique ID is locked and cannot be programmed" value="1"/>
        <value name="2" caption="Unique ID is locked and cannot be programmed" value="2"/>
        <value name="3" caption="Unique ID is locked and cannot be programmed" value="3"/>
      </value-group>
      <value-group name="SECCFG__DEBUG_LCK">
        <value name="0" caption="Debug is not locked" value="0"/>
        <value name="1" caption="Debug is locked" value="1"/>
        <value name="2" caption="Debug is locked" value="2"/>
        <value name="3" caption="Debug is locked" value="3"/>
      </value-group>
      <value-group name="SECCFG__ROOT_KEY_LCK">
        <value name="0" caption="Storage root key is not locked" value="0"/>
        <value name="1" caption="Storage root key is locked and cannot be programmed" value="1"/>
        <value name="2" caption="Storage root key is locked and cannot be programmed" value="2"/>
        <value name="3" caption="Storage root key is locked and cannot be programmed" value="3"/>
      </value-group>
      <value-group name="SECCFG__BOOT_KEY_LCK">
        <value name="0" caption="Secure boot key is not locked" value="0"/>
        <value name="1" caption="Secure boot key is locked and cannot be programmed" value="1"/>
        <value name="2" caption="Secure boot key is locked and cannot be programmed" value="2"/>
        <value name="3" caption="Secure boot key is locked and cannot be programmed" value="3"/>
      </value-group>
      <value-group name="SECCFG__PATCH_LCK">
        <value name="0" caption="Patch config and code are not locked" value="0"/>
        <value name="1" caption="Patch config and code are locked and cannot be programmed" value="1"/>
        <value name="2" caption="Patch config and code are locked and cannot be programmed" value="2"/>
        <value name="3" caption="Patch config and code are locked and cannot be programmed" value="3"/>
      </value-group>
