zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
      <value-group name="SEC_BOOT__SEC_BOOT_REQD">
        <value name="0" caption="S ecure boot code authentication is required" value="0"/>
        <value name="1" caption="S ecure boot code authentication is NOT required" value="1"/>
        <value name="2" caption="S ecure boot code authentication is NOT required" value="2"/>
        <value name="3" caption="S ecure boot code authentication is required" value="3"/>
      </value-group>
      <value-group name="SEC_BOOT__SEC_BOOT_DONE">
        <value name="0" caption="S ecure boot is done" value="0"/>
        <value name="1" caption="S ecure boot is not done" value="1"/>
        <value name="2" caption="S ecure boot is not done" value="2"/>
        <value name="3" caption="S ecure boot is done" value="3"/>
      </value-group>
      <value-group name="EFUSE_CON__PGM_1BIT">
        <value name="0" caption="EFuse controller will program EFUSE_RWDATA.DATA[15:0] to the address in EFUSE_RWDATA.ADDR[11:3]" value="0"/>
        <value name="1" caption="EFuse controller will program EFUSE_RWDATA.DATA[0] to the address in EFUSE_RWDATA.ADDR[11:0]" value="1"/>
      </value-group>
      <value-group name="EFUSE_CON__PGM_MODE">
        <value name="0" caption="EFuse Programming disabled" value="0"/>
        <value name="1" caption="EFuse Programming enabled" value="1"/>
      </value-group>
      <value-group name="EFUSE_CON__EN_LD">
        <value name="0" caption="EFuse Read operation has completed" value="0"/>
        <value name="1" caption="Start eFuse Read operation for specified eFuse word as addressed in EFUSE_RWDATA register" value="1"/>
      </value-group>
      <value-group name="EFUSE_CON__EN_LD_ALL1">
        <value name="0" caption="EFuse Read operation has completed" value="0"/>
        <value name="1" caption="Start eFuse Read operation for entire eFuse panel" value="1"/>
      </value-group>
      <value-group name="EFUSE_CON__EN_PGM">
        <value name="0" caption="EFuse Programming operation has completed" value="0"/>
        <value name="1" caption="Start eFuse Programming operation" value="1"/>
      </value-group>
      <value-group name="SEC_BOOT__SEC_FLASH_NOT_DIRTY">
        <value name="0" caption="Flash contents have changed since the last authentication" value="0"/>
        <value name="1" caption="Flash contents have changed since the last authentication" value="1"/>
        <value name="2" caption="Flash contents have changed since the last authentication" value="2"/>
        <value name="3" caption="Flash contents have not changed since the last authentication" value="3"/>
      </value-group>
      <value-group name="SECCFG__DEV_ID_LCK">
        <value name="0" caption="Device ID fuses are not locked" value="0"/>
        <value name="1" caption="Device ID fuses are locked and cannot be programmed" value="1"/>
        <value name="2" caption="Device ID fuses are locked and cannot be programmed" value="2"/>
        <value name="3" caption="Device ID fuses are locked and cannot be programmed" value="3"/>
      </value-group>
      <value-group name="SECCFG__DIE_INFO_LCK">
        <value name="0" caption="Die information fuses are not locked" value="0"/>
        <value name="1" caption="Die information fuses are locked and cannot be programmed" value="1"/>
        <value name="2" caption="Die information fuses are locked and cannot be programmed" value="2"/>
        <value name="3" caption="Die information fuses are locked and cannot be programmed" value="3"/>
      </value-group>
    </module>
    <module name="RTC" id="U2250" version="2.1.0" caption="Real-Time Counter">
      <register-group name="RTC" caption="Real-Time Counter">
        <mode name="MODE0" qualifier="RTC.MODE0.CTRLA.MODE" value="0" caption="32-bit Counter with Single 32-bit Compare"/>
        <mode name="MODE1" qualifier="RTC.MODE1.CTRLA.MODE" value="1" caption="16-bit Counter with Two 16-bit Compares"/>
        <mode name="MODE2" qualifier="RTC.MODE2.CTRLA.MODE" value="2" caption="Clock/Calendar with Alarm"/>
        <register modes="MODE0" name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="MODE0 Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode" mask="0xC" values="RTC_MODE0_CTRLA__MODE"/>
          <bitfield name="MATCHCLR" caption="Clear on Match" mask="0x80"/>
          <bitfield name="PRESCALER" caption="Prescaler" mask="0xF00" values="RTC_MODE0_CTRLA__PRESCALER"/>
          <bitfield name="BKTRST" caption="BKUP Registers Reset On Tamper Enable" mask="0x2000"/>
          <bitfield name="GPTRST" caption="GP Registers Reset On Tamper Enable" mask="0x4000"/>
          <bitfield name="COUNTSYNC" caption="Count Read Synchronization Enable" mask="0x8000"/>
        </register>
        <register modes="MODE1" name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="MODE1 Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode" mask="0xC" values="RTC_MODE1_CTRLA__MODE"/>
          <bitfield name="PRESCALER" caption="Prescaler" mask="0xF00" values="RTC_MODE1_CTRLA__PRESCALER"/>
          <bitfield name="BKTRST" caption="BKUP Registers Reset On Tamper Enable" mask="0x2000"/>
          <bitfield name="GPTRST" caption="GP Registers Reset On Tamper Enable" mask="0x4000"/>
          <bitfield name="COUNTSYNC" caption="Count Read Synchronization Enable" mask="0x8000"/>
        </register>
        <register modes="MODE2" name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="MODE2 Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode" mask="0xC" values="RTC_MODE2_CTRLA__MODE"/>
          <bitfield name="CLKREP" caption="Clock Representation" mask="0x40"/>
          <bitfield name="MATCHCLR" caption="Clear on Match" mask="0x80"/>
          <bitfield name="PRESCALER" caption="Prescaler" mask="0xF00" values="RTC_MODE2_CTRLA__PRESCALER"/>
          <bitfield name="BKTRST" caption="BKUP Registers Reset On Tamper Enable" mask="0x2000"/>
          <bitfield name="GPTRST" caption="GP Registers Reset On Tamper Enable" mask="0x4000"/>
          <bitfield name="CLOCKSYNC" caption="Clock Read Synchronization Enable" mask="0x8000"/>
        </register>
