zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
        <register modes="MODE2" name="ALARM1" offset="0x28" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="MODE2_ALARM Alarm n Value">
          <bitfield name="SECOND" caption="Second" mask="0x3F"/>
          <bitfield name="MINUTE" caption="Minute" mask="0xFC0"/>
          <bitfield name="HOUR" caption="Hour" mask="0x1F000" values="RTC_MODE2_ALARM_ALARM__HOUR"/>
          <bitfield name="DAY" caption="Day" mask="0x3E0000"/>
          <bitfield name="MONTH" caption="Month" mask="0x3C00000"/>
          <bitfield name="YEAR" caption="Year" mask="0xFC000000"/>
        </register>
        <register modes="MODE2" name="MASK1" offset="0x2C" rw="RW" access="WSYNC" size="1" initval="0x00" caption="MODE2_ALARM Alarm n Mask">
          <bitfield name="SEL" caption="Alarm Mask Selection" mask="0x7" values="RTC_MODE2_ALARM_MASK__SEL"/>
        </register>
        <register name="TAMPCTRL" offset="0x60" rw="RW" size="4" initval="0x00000000" caption="Tamper Control">
          <bitfield name="IN0ACT" caption="Tamper Input 0 Action" mask="0x3" values="RTC_TAMPCTRL__IN0ACT"/>
          <bitfield name="IN1ACT" caption="Tamper Input 1 Action" mask="0xC" values="RTC_TAMPCTRL__IN1ACT"/>
          <bitfield name="IN2ACT" caption="Tamper Input 2 Action" mask="0x30" values="RTC_TAMPCTRL__IN2ACT"/>
          <bitfield name="IN3ACT" caption="Tamper Input 3 Action" mask="0xC0" values="RTC_TAMPCTRL__IN3ACT"/>
          <bitfield name="TAMLVL0" caption="Tamper Level Select 0" mask="0x10000"/>
          <bitfield name="TAMLVL1" caption="Tamper Level Select 1" mask="0x20000"/>
          <bitfield name="TAMLVL2" caption="Tamper Level Select 2" mask="0x40000"/>
          <bitfield name="TAMLVL3" caption="Tamper Level Select 3" mask="0x80000"/>
          <bitfield name="DEBNC0" caption="Debouncer Enable 0" mask="0x1000000"/>
          <bitfield name="DEBNC1" caption="Debouncer Enable 1" mask="0x2000000"/>
          <bitfield name="DEBNC2" caption="Debouncer Enable 2" mask="0x4000000"/>
          <bitfield name="DEBNC3" caption="Debouncer Enable 3" mask="0x8000000"/>
        </register>
        <register modes="MODE0" name="TIMESTAMP" offset="0x64" rw="R" access="RSYNC" ocd-rw="" size="4" initval="0x00000000" caption="MODE0 Timestamp">
          <bitfield name="COUNT" caption="Count Timestamp Value" mask="0xFFFFFFFF"/>
        </register>
        <register modes="MODE1" name="TIMESTAMP" offset="0x64" rw="R" access="RSYNC" ocd-rw="" size="4" initval="0x00000000" caption="MODE1 Timestamp">
          <bitfield name="COUNT" caption="Count Timestamp Value" mask="0xFFFF"/>
        </register>
        <register modes="MODE2" name="TIMESTAMP" offset="0x64" rw="R" access="RSYNC" ocd-rw="" size="4" initval="0x00000000" caption="MODE2 Timestamp">
          <bitfield name="SECOND" caption="Second Timestamp Value" mask="0x3F"/>
          <bitfield name="MINUTE" caption="Minute Timestamp Value" mask="0xFC0"/>
          <bitfield name="HOUR" caption="Hour Timestamp Value" mask="0x1F000" values="RTC_MODE2_TIMESTAMP__HOUR"/>
          <bitfield name="DAY" caption="Day Timestamp Value" mask="0x3E0000"/>
          <bitfield name="MONTH" caption="Month Timestamp Value" mask="0x3C00000"/>
          <bitfield name="YEAR" caption="Year Timestamp Value" mask="0xFC000000"/>
        </register>
        <register name="TAMPID" offset="0x68" rw="RW" size="4" initval="0x00000000" caption="Tamper ID">
          <bitfield name="TAMPID0" caption="Tamper Input 0 Detected" mask="0x1"/>
          <bitfield name="TAMPID1" caption="Tamper Input 1 Detected" mask="0x2"/>
          <bitfield name="TAMPID2" caption="Tamper Input 2 Detected" mask="0x4"/>
          <bitfield name="TAMPID3" caption="Tamper Input 3 Detected" mask="0x8"/>
          <bitfield name="TAMPEVT" caption="Tamper Event Detected" mask="0x80000000"/>
        </register>
        <register name="BKUP" offset="0x80" rw="RW" size="4" count="1" initval="0x00000000" caption="Backup">
          <bitfield name="BKUP" caption="Backup" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <value-group name="RTC_MODE0_CTRLA__MODE">
        <value name="COUNT32" caption="Mode 0: 32-bit Counter" value="0x0"/>
        <value name="COUNT16" caption="Mode 1: 16-bit Counter" value="0x1"/>
        <value name="CLOCK" caption="Mode 2: Clock/Calendar" value="0x2"/>
      </value-group>
      <value-group name="RTC_MODE0_CTRLA__PRESCALER">
        <value name="OFF" caption="CLK_RTC_CNT = GCLK_RTC/1" value="0x0"/>
        <value name="DIV1" caption="CLK_RTC_CNT = GCLK_RTC/1" value="0x1"/>
        <value name="DIV2" caption="CLK_RTC_CNT = GCLK_RTC/2" value="0x2"/>
        <value name="DIV4" caption="CLK_RTC_CNT = GCLK_RTC/4" value="0x3"/>
        <value name="DIV8" caption="CLK_RTC_CNT = GCLK_RTC/8" value="0x4"/>
        <value name="DIV16" caption="CLK_RTC_CNT = GCLK_RTC/16" value="0x5"/>
        <value name="DIV32" caption="CLK_RTC_CNT = GCLK_RTC/32" value="0x6"/>
        <value name="DIV64" caption="CLK_RTC_CNT = GCLK_RTC/64" value="0x7"/>
        <value name="DIV128" caption="CLK_RTC_CNT = GCLK_RTC/128" value="0x8"/>
        <value name="DIV256" caption="CLK_RTC_CNT = GCLK_RTC/256" value="0x9"/>
        <value name="DIV512" caption="CLK_RTC_CNT = GCLK_RTC/512" value="0xA"/>
        <value name="DIV1024" caption="CLK_RTC_CNT = GCLK_RTC/1024" value="0xB"/>
      </value-group>
      <value-group name="RTC_MODE1_CTRLA__MODE">
        <value name="COUNT32" caption="Mode 0: 32-bit Counter" value="0"/>
        <value name="COUNT16" caption="Mode 1: 16-bit Counter" value="1"/>
        <value name="CLOCK" caption="Mode 2: Clock/Calendar" value="2"/>
      </value-group>
      <value-group name="RTC_MODE1_CTRLA__PRESCALER">
        <value name="OFF" caption="CLK_RTC_CNT = GCLK_RTC/1" value="0"/>
        <value name="DIV1" caption="CLK_RTC_CNT = GCLK_RTC/1" value="1"/>
        <value name="DIV2" caption="CLK_RTC_CNT = GCLK_RTC/2" value="2"/>
        <value name="DIV4" caption="CLK_RTC_CNT = GCLK_RTC/4" value="3"/>
        <value name="DIV8" caption="CLK_RTC_CNT = GCLK_RTC/8" value="4"/>
        <value name="DIV16" caption="CLK_RTC_CNT = GCLK_RTC/16" value="5"/>
        <value name="DIV32" caption="CLK_RTC_CNT = GCLK_RTC/32" value="6"/>
        <value name="DIV64" caption="CLK_RTC_CNT = GCLK_RTC/64" value="7"/>
        <value name="DIV128" caption="CLK_RTC_CNT = GCLK_RTC/128" value="8"/>
        <value name="DIV256" caption="CLK_RTC_CNT = GCLK_RTC/256" value="9"/>
        <value name="DIV512" caption="CLK_RTC_CNT = GCLK_RTC/512" value="0xA"/>
        <value name="DIV1024" caption="CLK_RTC_CNT = GCLK_RTC/1024" value="0xB"/>
      </value-group>
      <value-group name="RTC_MODE2_CTRLA__MODE">
        <value name="COUNT32" caption="Mode 0: 32-bit Counter" value="0"/>
        <value name="COUNT16" caption="Mode 1: 16-bit Counter" value="1"/>
        <value name="CLOCK" caption="Mode 2: Clock/Calendar" value="2"/>
      </value-group>
      <value-group name="RTC_MODE2_CTRLA__PRESCALER">
        <value name="OFF" caption="CLK_RTC_CNT = GCLK_RTC/1" value="0x0"/>
        <value name="DIV1" caption="CLK_RTC_CNT = GCLK_RTC/1" value="0x1"/>
        <value name="DIV2" caption="CLK_RTC_CNT = GCLK_RTC/2" value="0x2"/>
        <value name="DIV4" caption="CLK_RTC_CNT = GCLK_RTC/4" value="0x3"/>
        <value name="DIV8" caption="CLK_RTC_CNT = GCLK_RTC/8" value="0x4"/>
        <value name="DIV16" caption="CLK_RTC_CNT = GCLK_RTC/16" value="0x5"/>
        <value name="DIV32" caption="CLK_RTC_CNT = GCLK_RTC/32" value="0x6"/>
        <value name="DIV64" caption="CLK_RTC_CNT = GCLK_RTC/64" value="0x7"/>
        <value name="DIV128" caption="CLK_RTC_CNT = GCLK_RTC/128" value="0x8"/>
        <value name="DIV256" caption="CLK_RTC_CNT = GCLK_RTC/256" value="0x9"/>
        <value name="DIV512" caption="CLK_RTC_CNT = GCLK_RTC/512" value="0xA"/>
        <value name="DIV1024" caption="CLK_RTC_CNT = GCLK_RTC/1024" value="0xB"/>
      </value-group>
      <value-group name="RTC_MODE0_CTRLB__ACTF">
        <value name="DIV2" caption="CLK_RTC_OUT = CLK_RTC/2" value="0x0"/>
        <value name="DIV4" caption="CLK_RTC_OUT = CLK_RTC/4" value="0x1"/>
        <value name="DIV8" caption="CLK_RTC_OUT = CLK_RTC/8" value="0x2"/>
        <value name="DIV16" caption="CLK_RTC_OUT = CLK_RTC/16" value="0x3"/>
        <value name="DIV32" caption="CLK_RTC_OUT = CLK_RTC/32" value="0x4"/>
        <value name="DIV64" caption="CLK_RTC_OUT = CLK_RTC/64" value="0x5"/>
        <value name="DIV128" caption="CLK_RTC_OUT = CLK_RTC/128" value="0x6"/>
        <value name="DIV256" caption="CLK_RTC_OUT = CLK_RTC/256" value="0x7"/>
      </value-group>
      <value-group name="RTC_MODE0_CTRLB__DEBF">
        <value name="DIV2" caption="CLK_RTC_DEB = CLK_RTC/2" value="0x0"/>
        <value name="DIV4" caption="CLK_RTC_DEB = CLK_RTC/4" value="0x1"/>
        <value name="DIV8" caption="CLK_RTC_DEB = CLK_RTC/8" value="0x2"/>
        <value name="DIV16" caption="CLK_RTC_DEB = CLK_RTC/16" value="0x3"/>
        <value name="DIV32" caption="CLK_RTC_DEB = CLK_RTC/32" value="0x4"/>
        <value name="DIV64" caption="CLK_RTC_DEB = CLK_RTC/64" value="0x5"/>
        <value name="DIV128" caption="CLK_RTC_DEB = CLK_RTC/128" value="0x6"/>
        <value name="DIV256" caption="CLK_RTC_DEB = CLK_RTC/256" value="0x7"/>
      </value-group>
      <value-group name="RTC_MODE1_CTRLB__ACTF">
        <value name="DIV2" caption="CLK_RTC_OUT = CLK_RTC/2" value="0x0"/>
        <value name="DIV4" caption="CLK_RTC_OUT = CLK_RTC/4" value="0x1"/>
        <value name="DIV8" caption="CLK_RTC_OUT = CLK_RTC/8" value="0x2"/>
        <value name="DIV16" caption="CLK_RTC_OUT = CLK_RTC/16" value="0x3"/>
        <value name="DIV32" caption="CLK_RTC_OUT = CLK_RTC/32" value="0x4"/>
        <value name="DIV64" caption="CLK_RTC_OUT = CLK_RTC/64" value="0x5"/>
        <value name="DIV128" caption="CLK_RTC_OUT = CLK_RTC/128" value="0x6"/>
        <value name="DIV256" caption="CLK_RTC_OUT = CLK_RTC/256" value="0x7"/>
      </value-group>
      <value-group name="RTC_MODE1_CTRLB__DEBF">
        <value name="DIV2" caption="CLK_RTC_DEB = CLK_RTC/2" value="0x0"/>
        <value name="DIV4" caption="CLK_RTC_DEB = CLK_RTC/4" value="0x1"/>
        <value name="DIV8" caption="CLK_RTC_DEB = CLK_RTC/8" value="0x2"/>
        <value name="DIV16" caption="CLK_RTC_DEB = CLK_RTC/16" value="0x3"/>
        <value name="DIV32" caption="CLK_RTC_DEB = CLK_RTC/32" value="0x4"/>
        <value name="DIV64" caption="CLK_RTC_DEB = CLK_RTC/64" value="0x5"/>
        <value name="DIV128" caption="CLK_RTC_DEB = CLK_RTC/128" value="0x6"/>
        <value name="DIV256" caption="CLK_RTC_DEB = CLK_RTC/256" value="0x7"/>
      </value-group>
      <value-group name="RTC_MODE2_CTRLB__ACTF">
        <value name="DIV2" caption="CLK_RTC_OUT = CLK_RTC/2" value="0x0"/>
        <value name="DIV4" caption="CLK_RTC_OUT = CLK_RTC/4" value="0x1"/>
        <value name="DIV8" caption="CLK_RTC_OUT = CLK_RTC/8" value="0x2"/>
        <value name="DIV16" caption="CLK_RTC_OUT = CLK_RTC/16" value="0x3"/>
        <value name="DIV32" caption="CLK_RTC_OUT = CLK_RTC/32" value="0x4"/>
        <value name="DIV64" caption="CLK_RTC_OUT = CLK_RTC/64" value="0x5"/>
        <value name="DIV128" caption="CLK_RTC_OUT = CLK_RTC/128" value="0x6"/>
        <value name="DIV256" caption="CLK_RTC_OUT = CLK_RTC/256" value="0x7"/>
      </value-group>
      <value-group name="RTC_MODE2_CTRLB__DEBF">
        <value name="DIV2" caption="CLK_RTC_DEB = CLK_RTC/2" value="0x0"/>
        <value name="DIV4" caption="CLK_RTC_DEB = CLK_RTC/4" value="0x1"/>
        <value name="DIV8" caption="CLK_RTC_DEB = CLK_RTC/8" value="0x2"/>
        <value name="DIV16" caption="CLK_RTC_DEB = CLK_RTC/16" value="0x3"/>
        <value name="DIV32" caption="CLK_RTC_DEB = CLK_RTC/32" value="0x4"/>
        <value name="DIV64" caption="CLK_RTC_DEB = CLK_RTC/64" value="0x5"/>
        <value name="DIV128" caption="CLK_RTC_DEB = CLK_RTC/128" value="0x6"/>
        <value name="DIV256" caption="CLK_RTC_DEB = CLK_RTC/256" value="0x7"/>
      </value-group>
      <value-group name="RTC_MODE2_CLOCK__HOUR">
        <value name="AM" caption="AM when CLKREP in 12-hour" value="0x00"/>
        <value name="PM" caption="PM when CLKREP in 12-hour" value="0x10"/>
      </value-group>
      <value-group name="RTC_MODE2_ALARM_ALARM__HOUR">
        <value name="AM" caption="Morning hour" value="0x00"/>
        <value name="PM" caption="Afternoon hour" value="0x10"/>
      </value-group>
      <value-group name="RTC_MODE2_ALARM_MASK__SEL">
        <value name="OFF" caption="Alarm Disabled" value="0x0"/>
        <value name="SS" caption="Match seconds only" value="0x1"/>
        <value name="MMSS" caption="Match seconds and minutes only" value="0x2"/>
        <value name="HHMMSS" caption="Match seconds, minutes, and hours only" value="0x3"/>
        <value name="DDHHMMSS" caption="Match seconds, minutes, hours, and days only" value="0x4"/>
        <value name="MMDDHHMMSS" caption="Match seconds, minutes, hours, days, and months only" value="0x5"/>
        <value name="YYMMDDHHMMSS" caption="Match seconds, minutes, hours, days, months, and years" value="0x6"/>
      </value-group>
