zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
        <register name="PK_MEMOFFSET" offset="0x2020" rw="RW" size="4" atomic-op="set:PK_MEMOFFSET" initval="0x00000000" caption="Memory offset register.">
          <bitfield name="MEMOFFSET" caption="Memory offset for AHB Master" mask="0xFFFFFFFF"/>
        </register>
        <register name="PK_MICROCODEOFFSET" offset="0x2024" rw="RW" size="4" atomic-op="set:PK_MICROCODEOFFSET" initval="0x00000000" caption="MicroCode offset register.">
          <bitfield name="MICROCODEOFFSET" caption="MicroCode offset for AHB Master" mask="0xFFFFFFFF"/>
        </register>
        <register name="RNG_DATA_CONTROL" offset="0x4000" rw="RW" size="4" initval="0x00000000" caption="Control register">
          <bitfield name="ENABLE" caption="Enable the NDRNG." mask="0x1"/>
          <bitfield name="LFSREN" caption="Select between the NDRNG with asynchronous free running oscillators (when '0') and the Pseudo-Random generator with synchronous oscillators for simulation purpose (when '1')." mask="0x2"/>
          <bitfield name="TESTEN" caption="Select input for conditioning function and continuous tests: 0: Noise source (normal mode), 1: Test data register (test mode)." mask="0x4"/>
          <bitfield name="CONDBYPASS" caption="0: the conditioning function is used (normal mode), 1: the conditioning function is bypassed (to observe entropy source directly)." mask="0x8"/>
          <bitfield name="INTENREP" caption="Interrupt enable for Repetition Count Test failure." mask="0x10"/>
          <bitfield name="INTENPROP" caption="Interrupt enable for Adaptive Proportion Test failure (1024-sample window)." mask="0x20"/>
          <bitfield name="INTENFULL" caption="Interrupt enable for FIFO full." mask="0x80"/>
          <bitfield name="SOFTRST" caption="Software reset: 0: Normal mode, 1: The continuous test, the conditioning function and the FIFO are reset. This bit is not cleared automatically." mask="0x100"/>
          <bitfield name="INTENPRE" caption="Interrupt enable for AIS31 preliminary noise alarm." mask="0x200"/>
          <bitfield name="INTENALM" caption="Interrupt enable for AIS31 noise alarm." mask="0x400"/>
          <bitfield name="FORCEACTIVEROS" caption="Force oscillators to run when FIFO is full." mask="0x800"/>
          <bitfield name="HEALTHTESTBYPASS" caption="Bypass NIST tests such that the results of the start-up and online test do not affect the FSM state." mask="0x1000"/>
          <bitfield name="AIS31BYPASS" caption="Bypass AIS31 tests such that the results of the start-up and online tests do not affect the FSM state." mask="0x2000"/>
          <bitfield name="HEALTHTESTSEL" caption="Select input to health test module: 0: Before conditioning, 1: After conditioning." mask="0x4000"/>
          <bitfield name="AIS31TESTSEL" caption="Select input to the AIS31 test module: 0: Before conditioning, 1: After conditioning." mask="0x8000"/>
          <bitfield name="NB128BITBLOCKS" caption="Number of 128 bit blocks used in AES-CBCMAC post-processing. This value cannot be zero." mask="0xF0000"/>
          <bitfield name="FIFOWRITESTARTUP" caption="Enable write of the samples in the FIFO during start-up." mask="0x100000"/>
        </register>
        <register name="RNG_DATA_FIFOLEVEL" offset="0x4004" rw="RW" size="4" initval="0x00000000" caption="FIFO level register.">
          <bitfield name="FIFOLEVEL" caption="Number of 32 bits words of random available in the FIFO. Any write to this register clears the FullInt flag in the Status register." mask="0xFFFFFFFF"/>
        </register>
        <register name="RNG_DATA_FIFOTHRESHOLD" offset="0x4008" rw="RW" size="4" initval="0x00000000" caption="FIFO threshold register.">
          <bitfield name="FIFOTHRESHOLD" caption="FIFO level below which the module leaves the idle state to refill the FIFO, expressed in number of 128bit blocks." mask="0xFFFFFFFF"/>
        </register>
        <register name="RNG_DATA_FIFODEPTH" offset="0x400C" rw="R" size="4" initval="0x00000000" caption="FIFO depth register.">
          <bitfield name="FIFODEPTH" caption="Maximum number of 32 bits words that can be stored in the FIFO: 2**g_fifodepth." mask="0xFFFFFFFF"/>
        </register>
        <register name="RNG_DATA_KEY0" offset="0x4010" rw="RW" size="4" initval="0x00000000" caption="Key register (MSB).">
          <bitfield name="KEY0" caption="Key register (MSB)." mask="0xFFFFFFFF"/>
        </register>
        <register name="RNG_DATA_KEY1" offset="0x4014" rw="RW" size="4" initval="0x00000000" caption="Key register.">
          <bitfield name="KEY1" caption="Key register." mask="0xFFFFFFFF"/>
        </register>
        <register name="RNG_DATA_KEY2" offset="0x4018" rw="RW" size="4" initval="0x00000000" caption="Key register.">
          <bitfield name="KEY2" caption="Key register." mask="0xFFFFFFFF"/>
        </register>
        <register name="RNG_DATA_KEY3" offset="0x401C" rw="RW" size="4" initval="0x00000000" caption="Key register (LSB).">
          <bitfield name="KEY3" caption="Key register (LSB)." mask="0xFFFFFFFF"/>
        </register>
        <register name="RNG_DATA_TESTDATA" offset="0x4020" rw="W" size="4" initval="0x00000000" caption="Test data register.">
          <bitfield name="TESTDATA" caption="Test data register." mask="0xFFFFFFFF"/>
        </register>
        <register name="RNG_DATA_REPEATTHRESHOLD" offset="0x4024" rw="RW" size="4" initval="0x00000000" caption="Repetition Test Count Cut-Off value.">
          <bitfield name="REPEATTHRESHOLD" caption="Repetition Test Count Cut-Off value." mask="0xFFFFFFFF"/>
        </register>
        <register name="RNG_DATA_PROPTHRESHOLD" offset="0x4028" rw="RW" size="4" initval="0x00000000" caption="Adaptive Proportion Test (1024-sample window) Cut-Off value.">
          <bitfield name="PROPTHRESHOLD" caption="Adaptive Proportion Test (1024-sample window) Cut-Off value." mask="0xFFFFFFFF"/>
        </register>
        <register name="RNG_DATA_STATUS" offset="0x4030" rw="RW" size="4" initval="0x00000000" caption="Status register.">
          <bitfield name="TESTDATABUSY" caption="High when data written to TestData register is being processed. (see section 4.7)" mask="0x1"/>
          <bitfield name="STATE" caption="State of the control FSM: 000: Reset, 001: Startup, 010: Idle (Rings On), 011: Idle (Rings Off), 100: Fill FIFO, 101: Error, 110: Unused, 111: Unused." mask="0xE"/>
          <bitfield name="REPFAIL" caption="NIST-800-90B repetition Count Test interrupt status." mask="0x10"/>
          <bitfield name="PROPFAIL" caption="NIST-800-90B adaptive Proportion Test (1024-sample window) interrupt status." mask="0x20"/>
          <bitfield name="FULLINT" caption="FIFO full status." mask="0x80"/>
          <bitfield name="PREINT" caption="AIS31 preliminary noise alarm interrupt status." mask="0x100"/>
          <bitfield name="ALMINT" caption="AIS31 noise alarm interrupt status." mask="0x200"/>
          <bitfield name="STARTUPFAIL" caption="Start-up test failure." mask="0x400"/>
          <bitfield name="FIFOACCFAIL" caption="Set when a FIFO data read is performed while the NDRNG is disabled AND has its FIFO empty (FIFOLevel = 0)." mask="0x800"/>
        </register>
        <register name="RNG_DATA_INITWAITVAL" offset="0x4034" rw="RW" size="4" initval="0x0000FFFF" caption="Initial wait counter value.">
          <bitfield name="INITWAITVAL" caption="Number of clock cycles to wait before sampling data from the noise source." mask="0xFFFF"/>
        </register>
        <register name="RNG_DATA_DISABLEOSC0" offset="0x4038" rw="RW" size="4" initval="0x00000000" caption="Disable oscillator rings #0 to #31.">
          <bitfield name="DISABLEOSC0" caption="Disable oscillator rings #0 to #31." mask="0xFFFFFFFF"/>
        </register>
        <register name="RNG_DATA_DISABLEOSC1" offset="0x403C" rw="RW" size="4" initval="0x00000000" caption="Disable oscillator rings #32 to #63.">
          <bitfield name="DISABLEOSC1" caption="Disable oscillator rings #32 to #63." mask="0xFFFFFFFF"/>
        </register>
        <register name="RNG_DATA_SWOFFTMRVAL" offset="0x4040" rw="RW" size="4" initval="0x00000000" caption="Switch off timer value.">
          <bitfield name="SWOFFTMRVAL" caption="Number of clk cycles to wait before stopping the rings after the FIFO is full." mask="0xFFFF"/>
        </register>
        <register name="RNG_DATA_CLKDIV" offset="0x4044" rw="RW" size="4" initval="0x00000000" caption="Sample clock divider.">
          <bitfield name="CLKDIV" caption="Sample clock divider. The frequency at which the outputs of the rings are sampled is given by: Fs=Fpclk/(ClkDiv+1)." mask="0xFF"/>
        </register>
        <register name="RNG_DATA_AIS31CONF0" offset="0x4048" rw="RW" size="4" initval="0x00000000" caption="AIS31 configuration register 0.">
          <bitfield name="STARTUPTHRESHOLD" caption="Start-up test threshold." mask="0xFFFF"/>
          <bitfield name="ONLINETHRESHOLD" caption="Online threshold." mask="0xFFFF0000"/>
        </register>
        <register name="RNG_DATA_AIS31CONF1" offset="0x404C" rw="RW" size="4" initval="0x00000000" caption="AIS31 configuration register 1.">
          <bitfield name="ONLINEREPTHRESHOLD" caption="Online repeat threshold." mask="0xFFFF"/>
          <bitfield name="HEXPECTEDVALUE" caption="Expected history value." mask="0xFFFF0000"/>
        </register>
        <register name="RNG_DATA_AIS31CONF2" offset="0x4050" rw="RW" size="4" initval="0x00000000" caption="AIS31 configuration register 2.">
          <bitfield name="HMIN" caption="Minimum allowed history value." mask="0xFFFF"/>
          <bitfield name="HMAX" caption="Maximum allowed history value." mask="0xFFFF0000"/>
        </register>
        <register name="RNG_DATA_AIS31STATUS" offset="0x4054" rw="RW" size="4" initval="0x00000000" caption="AIS31 status register.">
          <bitfield name="NUMPRELIMALARMS" caption="Number of preliminary noise alarms since counter was last cleared." mask="0xFFFF"/>
          <bitfield name="PRELIMNOISEALARMRNG" caption="Last preliminary noise alarm occurred due to history value out of range." mask="0x10000"/>
          <bitfield name="PRELIMNOISEALARMREP" caption="Last preliminary noise alarm occurred due to consecutive high X**2." mask="0x20000"/>
        </register>
        <register name="RNG_DATA_HWCONFIG" offset="0x4058" rw="R" size="4" initval="0x00000000" caption="Hardware configuration register.">
          <bitfield name="NUMBOFRINGS" caption="Generic g_NumRings value." mask="0xFF"/>
          <bitfield name="AIS31" caption="Generic g_AIS31 value." mask="0x100"/>
          <bitfield name="AIS31FULL" caption="Generic g_AIS31Full value." mask="0x200"/>
        </register>
      </register-group>
      <register-group name="CRYPTO" caption="">
        <register name="CRYPTOCON" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Crypto control register.">
          <bitfield name="SWRST" caption="Software Reset" mask="0x01"/>
          <bitfield name="ENABLE" caption="Enable clock to CRYPTO" mask="0x02"/>
          <bitfield name="RUNSTDBY" caption="Enable clock in idle mode" mask="0x40"/>
        </register>
        <register-group name="SFR" name-in-module="SFR" offset="0x10000" size="0x405C" count="1"/>
      </register-group>
    </module>
    <module name="TC" id="U2249" version="3.0.0" caption="Basic Timer Counter">
      <register-group name="TC" caption="Basic Timer Counter">
        <mode name="COUNT8" qualifier="TC.CTRLA.MODE" value="1" caption="8-bit Counter Mode"/>
        <mode name="COUNT16" qualifier="TC.CTRLA.MODE" value="0" caption="16-bit Counter Mode"/>
        <mode name="COUNT32" qualifier="TC.CTRLA.MODE" value="2" caption="32-bit Counter Mode"/>
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Timer Counter Mode" mask="0xC" values="TC_CTRLA__MODE"/>
          <bitfield name="PRESCSYNC" caption="Prescaler and Counter Synchronization" mask="0x30" values="TC_CTRLA__PRESCSYNC"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="Clock On Demand" mask="0x80"/>
          <bitfield name="PRESCALER" caption="Prescaler" mask="0x700" values="TC_CTRLA__PRESCALER"/>
          <bitfield name="ALOCK" caption="Auto Lock" mask="0x800"/>
          <bitfield name="DMAOS" caption="DMA One Shot" mask="0x8000"/>
          <bitfield name="CAPTEN0" caption="Capture Channel 0 Enable" mask="0x10000"/>
          <bitfield name="CAPTEN1" caption="Capture Channel 1 Enable" mask="0x20000"/>
          <bitfield name="COPEN0" caption="Capture On Pin 0 Enable" mask="0x100000"/>
          <bitfield name="COPEN1" caption="Capture On Pin 1 Enable" mask="0x200000"/>
          <bitfield name="CAPTMODE0" caption="Capture Mode Channel 0" mask="0x3000000" values="TC_CTRLA__CAPTMODE0"/>
          <bitfield name="CAPTMODE1" caption="Capture mode Channel 1" mask="0x18000000" values="TC_CTRLA__CAPTMODE1"/>
        </register>
        <register name="CTRLBCLR" offset="0x4" rw="RW" access="RWSYNC" size="1" atomic-op="clear:CTRLBCLR" initval="0x00" caption="Control B Clear">
          <bitfield name="DIR" caption="Counter Direction" mask="0x1"/>
          <bitfield name="LUPD" caption="Lock Update" mask="0x2"/>
          <bitfield name="ONESHOT" caption="One-Shot on Counter" mask="0x4"/>
          <bitfield name="CMD" caption="Command" mask="0xE0" values="TC_CTRLBCLR__CMD"/>
        </register>
        <register name="CTRLBSET" offset="0x5" rw="RW" access="RWSYNC" size="1" atomic-op="set:CTRLBSET" initval="0x00" caption="Control B Set">
          <bitfield name="DIR" caption="Counter Direction" mask="0x1"/>
          <bitfield name="LUPD" caption="Lock Update" mask="0x2"/>
          <bitfield name="ONESHOT" caption="One-Shot on Counter" mask="0x4"/>
          <bitfield name="CMD" caption="Command" mask="0xE0" values="TC_CTRLBSET__CMD"/>
        </register>
