zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
        <register name="EVCTRL" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="Event Control">
          <bitfield name="EVACT0" caption="Timer/counter Input Event0 Action" mask="0x7" values="TCC_EVCTRL__EVACT0"/>
          <bitfield name="EVACT1" caption="Timer/counter Input Event1 Action" mask="0x38" values="TCC_EVCTRL__EVACT1"/>
          <bitfield name="CNTSEL" caption="Timer/counter Output Event Mode" mask="0xC0" values="TCC_EVCTRL__CNTSEL"/>
          <bitfield name="OVFEO" caption="Overflow/Underflow Output Event Enable" mask="0x100"/>
          <bitfield name="TRGEO" caption="Retrigger Output Event Enable" mask="0x200"/>
          <bitfield name="CNTEO" caption="Timer/counter Output Event Enable" mask="0x400"/>
          <bitfield name="TCINV0" caption="Inverted Event 0 Input Enable" mask="0x1000"/>
          <bitfield name="TCINV1" caption="Inverted Event 1 Input Enable" mask="0x2000"/>
          <bitfield name="TCEI0" caption="Timer/counter Event 0 Input Enable" mask="0x4000"/>
          <bitfield name="TCEI1" caption="Timer/counter Event 1 Input Enable" mask="0x8000"/>
          <bitfield name="MCEI0" caption="Match or Capture Channel 0 Event Input Enable" mask="0x10000"/>
          <bitfield name="MCEI1" caption="Match or Capture Channel 1 Event Input Enable" mask="0x20000"/>
          <bitfield name="MCEI2" caption="Match or Capture Channel 2 Event Input Enable" mask="0x40000"/>
          <bitfield name="MCEI3" caption="Match or Capture Channel 3 Event Input Enable" mask="0x80000"/>
          <bitfield name="MCEI4" caption="Match or Capture Channel 4 Event Input Enable" mask="0x100000"/>
          <bitfield name="MCEI5" caption="Match or Capture Channel 5 Event Input Enable" mask="0x200000"/>
          <bitfield name="MCEO0" caption="Match or Capture Channel 0 Event Output Enable" mask="0x1000000"/>
          <bitfield name="MCEO1" caption="Match or Capture Channel 1 Event Output Enable" mask="0x2000000"/>
          <bitfield name="MCEO2" caption="Match or Capture Channel 2 Event Output Enable" mask="0x4000000"/>
          <bitfield name="MCEO3" caption="Match or Capture Channel 3 Event Output Enable" mask="0x8000000"/>
          <bitfield name="MCEO4" caption="Match or Capture Channel 4 Event Output Enable" mask="0x10000000"/>
          <bitfield name="MCEO5" caption="Match or Capture Channel 5 Event Output Enable" mask="0x20000000"/>
        </register>
        <register name="INTENCLR" offset="0x24" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x1"/>
          <bitfield name="TRG" caption="Retrigger Interrupt Enable" mask="0x2"/>
          <bitfield name="CNT" caption="Counter Interrupt Enable" mask="0x4"/>
          <bitfield name="ERR" caption="Error Interrupt Enable" mask="0x8"/>
          <bitfield name="UFS" caption="Non-Recoverable Update Fault Interrupt Enable" mask="0x400"/>
          <bitfield name="DFS" caption="Non-Recoverable Debug Fault Interrupt Enable" mask="0x800"/>
          <bitfield name="FAULTA" caption="Recoverable Fault A Interrupt Enable" mask="0x1000"/>
          <bitfield name="FAULTB" caption="Recoverable Fault B Interrupt Enable" mask="0x2000"/>
          <bitfield name="FAULT0" caption="Non-Recoverable Fault 0 Interrupt Enable" mask="0x4000"/>
          <bitfield name="FAULT1" caption="Non-Recoverable Fault 1 Interrupt Enable" mask="0x8000"/>
          <bitfield name="MC0" caption="Match or Capture Channel 0 Interrupt Enable" mask="0x10000"/>
          <bitfield name="MC1" caption="Match or Capture Channel 1 Interrupt Enable" mask="0x20000"/>
          <bitfield name="MC2" caption="Match or Capture Channel 2 Interrupt Enable" mask="0x40000"/>
          <bitfield name="MC3" caption="Match or Capture Channel 3 Interrupt Enable" mask="0x80000"/>
          <bitfield name="MC4" caption="Match or Capture Channel 4 Interrupt Enable" mask="0x100000"/>
          <bitfield name="MC5" caption="Match or Capture Channel 5 Interrupt Enable" mask="0x200000"/>
        </register>
        <register name="INTENSET" offset="0x28" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x1"/>
          <bitfield name="TRG" caption="Retrigger Interrupt Enable" mask="0x2"/>
          <bitfield name="CNT" caption="Counter Interrupt Enable" mask="0x4"/>
          <bitfield name="ERR" caption="Error Interrupt Enable" mask="0x8"/>
          <bitfield name="UFS" caption="Non-Recoverable Update Fault Interrupt Enable" mask="0x400"/>
          <bitfield name="DFS" caption="Non-Recoverable Debug Fault Interrupt Enable" mask="0x800"/>
          <bitfield name="FAULTA" caption="Recoverable Fault A Interrupt Enable" mask="0x1000"/>
          <bitfield name="FAULTB" caption="Recoverable Fault B Interrupt Enable" mask="0x2000"/>
          <bitfield name="FAULT0" caption="Non-Recoverable Fault 0 Interrupt Enable" mask="0x4000"/>
          <bitfield name="FAULT1" caption="Non-Recoverable Fault 1 Interrupt Enable" mask="0x8000"/>
          <bitfield name="MC0" caption="Match or Capture Channel 0 Interrupt Enable" mask="0x10000"/>
          <bitfield name="MC1" caption="Match or Capture Channel 1 Interrupt Enable" mask="0x20000"/>
          <bitfield name="MC2" caption="Match or Capture Channel 2 Interrupt Enable" mask="0x40000"/>
          <bitfield name="MC3" caption="Match or Capture Channel 3 Interrupt Enable" mask="0x80000"/>
          <bitfield name="MC4" caption="Match or Capture Channel 4 Interrupt Enable" mask="0x100000"/>
          <bitfield name="MC5" caption="Match or Capture Channel 5 Interrupt Enable" mask="0x200000"/>
        </register>
        <register name="INTFLAG" offset="0x2C" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="OVF" caption="Overflow" mask="0x1"/>
          <bitfield name="TRG" caption="Retrigger" mask="0x2"/>
          <bitfield name="CNT" caption="Counter" mask="0x4"/>
          <bitfield name="ERR" caption="Error" mask="0x8"/>
          <bitfield name="UFS" caption="Non-Recoverable Update Fault" mask="0x400"/>
          <bitfield name="DFS" caption="Non-Recoverable Debug Fault" mask="0x800"/>
          <bitfield name="FAULTA" caption="Recoverable Fault A" mask="0x1000"/>
          <bitfield name="FAULTB" caption="Recoverable Fault B" mask="0x2000"/>
          <bitfield name="FAULT0" caption="Non-Recoverable Fault 0" mask="0x4000"/>
          <bitfield name="FAULT1" caption="Non-Recoverable Fault 1" mask="0x8000"/>
          <bitfield name="MC0" caption="Match or Capture 0" mask="0x10000"/>
          <bitfield name="MC1" caption="Match or Capture 1" mask="0x20000"/>
          <bitfield name="MC2" caption="Match or Capture 2" mask="0x40000"/>
          <bitfield name="MC3" caption="Match or Capture 3" mask="0x80000"/>
          <bitfield name="MC4" caption="Match or Capture 4" mask="0x100000"/>
          <bitfield name="MC5" caption="Match or Capture 5" mask="0x200000"/>
        </register>
