zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
      <value-group name="TCC_EVCTRL__CNTSEL">
        <value name="START" caption="An interrupt/event is generated when a new counter cycle starts" value="0"/>
        <value name="END" caption="An interrupt/event is generated when a counter cycle ends" value="1"/>
        <value name="BETWEEN" caption="An interrupt/event is generated when a counter cycle ends, except for the first and last cycles" value="2"/>
        <value name="BOUNDARY" caption="An interrupt/event is generated when a new counter cycle starts or a counter cycle ends" value="3"/>
      </value-group>
      <value-group name="TCC_EVCTRL__EVACT0">
        <value name="OFF" caption="Event action disabled" value="0"/>
        <value name="RETRIGGER" caption="Start, restart or re-trigger counter on event" value="1"/>
        <value name="COUNTEV" caption="Count on event" value="2"/>
        <value name="START" caption="Start counter on event" value="3"/>
        <value name="INC" caption="Increment counter on event" value="4"/>
        <value name="COUNT" caption="Count on active state of asynchronous event" value="5"/>
        <value name="STAMP" caption="Stamp capture" value="6"/>
        <value name="FAULT" caption="Non-recoverable fault" value="7"/>
      </value-group>
      <value-group name="TCC_EVCTRL__EVACT1">
        <value name="OFF" caption="Event action disabled" value="0"/>
        <value name="RETRIGGER" caption="Re-trigger counter on event" value="1"/>
        <value name="DIR" caption="Direction control" value="2"/>
        <value name="STOP" caption="Stop counter on event" value="3"/>
        <value name="DEC" caption="Decrement counter on event" value="4"/>
        <value name="PPW" caption="Period capture value in CC0 register, pulse width capture value in CC1 register" value="5"/>
        <value name="PWP" caption="Period capture value in CC1 register, pulse width capture value in CC0 register" value="6"/>
        <value name="FAULT" caption="Non-recoverable fault" value="7"/>
      </value-group>
      <value-group name="TCC_WAVE__RAMP">
        <value name="RAMP1" caption="RAMP1 operation" value="0"/>
        <value name="RAMP2A" caption="Alternative RAMP2 operation" value="1"/>
        <value name="RAMP2" caption="RAMP2 operation" value="2"/>
        <value name="RAMP2C" caption="Critical RAMP2 operation" value="3"/>
      </value-group>
      <value-group name="TCC_WAVE__WAVEGEN">
        <value name="NFRQ" caption="Normal frequency" value="0"/>
        <value name="MFRQ" caption="Match frequency" value="1"/>
        <value name="NPWM" caption="Normal PWM" value="2"/>
        <value name="DSCRITICAL" caption="Dual-slope critical" value="4"/>
        <value name="DSBOTTOM" caption="Dual-slope with interrupt/event condition when COUNT reaches ZERO" value="5"/>
        <value name="DSBOTH" caption="Dual-slope with interrupt/event condition when COUNT reaches ZERO or TOP" value="6"/>
        <value name="DSTOP" caption="Dual-slope with interrupt/event condition when COUNT reaches TOP" value="7"/>
      </value-group>
    </module>
    <module caption="USB" id="02813" name="USB" version="3">
      <register-group name="UEP" size="0x10">
        <register name="UEPx" offset="0x0" rw="RW" size="4" caption="USB Endpoint Control Registers">
          <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP1__EPHSHK"/>
          <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP1__EPSTALL"/>
          <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP1__EPTXEN"/>
          <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP1__EPRXEN"/>
          <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP1__EPCONDIS"/>
          <bitfield caption="Retry Disable bit" mask="0x00000040" name="RETRYDIS" values="U1EP__RETRYDIS"/>
          <bitfield caption="Low-Speed Direct Connection Enable bit" mask="0x00000080" name="LSPD" values="U1EP__LSPD"/>
        </register>
        <register name="UEPxCLR" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="">
		 </register>
        <register name="UEPxSET" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="">
		 </register>
        <register name="UEPxINV" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="">
		 </register>
      </register-group>
      <register-group name="USB">
        <register caption="USB OTG Interrupt Status Register" name="UOTGIR" offset="0x40" rw="RW" size="4">
          <bitfield caption="A-VBUS change indicator bit" mask="0x00000001" name="AVBUS_VLD" values="U1OTGIR__VBUSVDIF"/>
          <bitfield caption="B-Device VBUS change indicator bit" mask="0x00000004" name="BSESS_END" values="U1OTGIR__SESENDIF"/>
          <bitfield caption="Session Valid Change Indicator bit" mask="0x00000008" name="SESVDIF" values="U1OTGIR__SESVDIF"/>
          <bitfield caption="Bus Activity Indicator bit" mask="0x00000010" name="ACTVIF" values="U1OTGIR__ACTVIF"/>
          <bitfield caption="Line State Stable Indicator bit" mask="0x00000020" name="LSTATEIF" values="U1OTGIR__LSTATEIF"/>
          <bitfield caption="1 Millisecond Timer bit" mask="0x00000040" name="T1MSECIF" values="U1OTGIR__T1MSECIF"/>
          <bitfield caption="ID State Change Indicator bit" mask="0x00000080" name="IDIF" values="U1OTGIR__IDIF"/>
        </register>
        <register name="UOTGIRCLR" offset="0x44" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register name="UOTGIRSET" offset="0x48" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register name="UOTGIRINV" offset="0x4C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register caption="USB OTG Interrupt Enable Register" name="UOTGIE" offset="0x50" rw="RW" size="4">
          <bitfield caption="A- Vbus Valid Interrupt Enable bit" mask="0x00000001" name="AVBUS_VLD" values="U1OTGIE__VBUSVDIE"/>
          <bitfield caption="B-Session End Interrupt Enable bit" mask="0x00000004" name="BSESS_END" values="U1OTGIE__SESENDIE"/>
          <bitfield caption="Session Valid Interrupt Enable bit" mask="0x00000008" name="SESS_VLD" values="U1OTGIE__SESVDIE"/>
          <bitfield caption="Activity Interrupt Enable bit" mask="0x00000010" name="ACTIVITY" values="U1OTGIE__ACTVIE"/>
          <bitfield caption="Line State Interrupt Enable bit" mask="0x00000020" name="LSTATE" values="U1OTGIE__LSTATEIE"/>
          <bitfield caption="1 Millisecond Timer Interrupt Enable bit" mask="0x00000040" name="ONE_MSEC" values="U1OTGIE__T1MSECIE"/>
          <bitfield caption="ID Interrupt Enable bit" mask="0x00000080" name="IDIE" values="U1OTGIE__IDIE"/>
        </register>
        <register name="UOTGIECLR" offset="0x54" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register name="UOTGIESET" offset="0x58" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register name="UOTGIEINV" offset="0x5C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
