zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
        <register caption="USB OTG Status Register" name="UOTGSTAT" offset="0x60" rw="RW" size="4">
          <bitfield caption="A-VBUS Valid Indicator bit" mask="0x00000001" name="VBUSVD" values="U1OTGSTAT__VBUSVD"/>
          <bitfield caption="B-Session End Indicator bit" mask="0x00000004" name="SESEND" values="U1OTGSTAT__SESEND"/>
          <bitfield caption="Session Valid Indicator bit" mask="0x00000008" name="SESVD" values="U1OTGSTAT__SESVD"/>
          <bitfield caption="Line State Stable Indicator bit" mask="0x00000020" name="LSTATE" values="U1OTGSTAT__LSTATE"/>
          <bitfield caption="ID Pin State Indicator bit" mask="0x00000080" name="ID" values="U1OTGSTAT__ID"/>
        </register>
        <register caption="USB OTG Control Register" name="UOTGCON" offset="0x70" rw="RW" size="4">
          <bitfield caption="Vbus Discharge Enable bit" mask="0x00000001" name="VBUSDIS" values="U1OTGCON__VBUSDIS"/>
          <bitfield caption="Vbus Charge Enable bit" mask="0x00000002" name="VBUSCHG" values="U1OTGCON__VBUSCHG"/>
          <bitfield caption="OTG Functionality Enable bit" mask="0x00000004" name="OTGEN" values="U1OTGCON__OTGEN"/>
          <bitfield caption="Vbus Power-on bit" mask="0x00000008" name="VBUSON" values="U1OTGCON__VBUSON"/>
          <bitfield caption="D- Pull-Down Enable bit" mask="0x00000010" name="DMPULDWN" values="U1OTGCON__DMPULDWN"/>
          <bitfield caption="D+ Pull-Down Enable bit" mask="0x00000020" name="DPPULDWN" values="U1OTGCON__DPPULDWN"/>
          <bitfield caption="D- Pull-Up Enable bit" mask="0x00000040" name="DMPULUP" values="U1OTGCON__DMPULUP"/>
          <bitfield caption="D+ Pull-Up Enable bit" mask="0x00000080" name="DPPULUP" values="U1OTGCON__DPPULUP"/>
        </register>
        <register name="UOTGCONCLR" offset="0x74" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register name="UOTGCONSET" offset="0x78" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register name="UOTGCONINV" offset="0x7C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register caption="USB Power Control Register" name="UPWRC" offset="0x80" rw="RW" size="4">
          <bitfield caption="USB Operation Enable bit" mask="0x00000001" name="USBPWR" values="U1PWRC__USBPWR"/>
          <bitfield caption="USB Suspend Mode bit" mask="0x00000002" name="USUSPEND" values="U1PWRC__USUSPEND"/>
          <bitfield caption="USB Module Busy bit" mask="0x00000008" name="USBBUSY" values="U1PWRC__USBBUSY"/>
          <bitfield caption="USB Sleep Entry Guard bit" mask="0x00000010" name="USLPGRD" values="U1PWRC__USLPGRD"/>
          <bitfield caption="USB Activity Pending bit" mask="0x00000080" name="UACTPND" values="U1PWRC__UACTPND"/>
        </register>
        <register name="UPWRCCLR" offset="0x84" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register name="UPWRCSET" offset="0x88" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register name="UPWRCINV" offset="0x8C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register caption="USB Interrupt Register" name="UIR" offset="0x200" rw="RW" size="4">
          <bitfield caption="(Device mode) USB Reset Interrupt bit Device mode / (Host mode)USB Detach Interrupt bit Host mode" mask="0x00000001" name="URSTIF_DETACHIF" values="U1IR__URSTIF_DETACHIF"/>
          <bitfield caption="USB Error Condition Interrupt bit" mask="0x00000002" name="UERRIF" values="U1IR__UERRIF"/>
          <bitfield caption="SOF Token Interrupt bit" mask="0x00000004" name="SOFIF" values="U1IR__SOFIF"/>
          <bitfield caption="Token Processing Complete Interrupt bit" mask="0x00000008" name="TRNIF" values="U1IR__TRNIF"/>
          <bitfield caption="Idle Detect Interrupt bit" mask="0x00000010" name="IDLEIF" values="U1IR__IDLEIF"/>
          <bitfield caption="Resume Interrupt bit" mask="0x00000020" name="RESUMEIF" values="U1IR__RESUMEIF"/>
          <bitfield caption="Peripheral Attach Interrupt bit" mask="0x00000040" name="ATTACHIF" values="U1IR__ATTACHIF"/>
          <bitfield caption="STALL Handshake Interrupt bit" mask="0x00000080" name="STALLIF" values="U1IR__STALLIF"/>
        </register>
        <register name="UIRCLR" offset="0x204" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register caption="USB Interrupt Enable Register" name="UIE" offset="0x210" rw="RW" size="4">
          <bitfield caption="(Device mode) USB Reset Interrupt Enable bit Device mode / (Host mode)USB Detach Interrupt Enable bit Host Mode" mask="0x00000001" name="URSTIE_DETACHIE" values="U1IE__URSTIE_DETACHIE"/>
          <bitfield caption="USB Error Interrupt Enable bit" mask="0x00000002" name="UERRIE" values="U1IE__UERRIE"/>
          <bitfield caption="SOF Token Interrupt Enable bit" mask="0x00000004" name="SOFIE" values="U1IE__SOFIE"/>
          <bitfield caption="Token Processing Complete Interrupt Enable bit" mask="0x00000008" name="TRNIE" values="U1IE__TRNIE"/>
          <bitfield caption="Idle Detect Interrupt Enable bit" mask="0x00000010" name="IDLEIE" values="U1IE__IDLEIE"/>
          <bitfield caption="RESUME Interrupt Enable bit" mask="0x00000020" name="RESUMEIE" values="U1IE__RESUMEIE"/>
          <bitfield caption="ATTACH Interrupt Enable bit" mask="0x00000040" name="ATTACHIE" values="U1IE__ATTACHIE"/>
          <bitfield caption="STALL Handshake Interrupt Enable bit" mask="0x00000080" name="STALLIE" values="U1IE__STALLIE"/>
        </register>
        <register name="UIECLR" offset="0x214" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register name="UIESET" offset="0x218" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register name="UIEINV" offset="0x21C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
