zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
        <register caption="USB Error Interrupt Status Register" name="UEIR" offset="0x220" rw="RW" size="4">
          <bitfield caption="PID Check Failure Flag bit" mask="0x00000001" name="PIDEF" values="U1EIR__PIDEF"/>
          <bitfield caption="(Device mode)CRC5 Host Error Flag bit / (Host mode)EOF Error Flag bit" mask="0x00000002" name="CRC5EF_EOFEF" values="U1EIR__CRC5EF_EOFEF"/>
          <bitfield caption="CRC16 Failure Flag bit" mask="0x00000004" name="CRC16EF" values="U1EIR__CRC16EF"/>
          <bitfield caption="Data Field Size Error Flag bit" mask="0x00000008" name="DFN8EF" values="U1EIR__DFN8EF"/>
          <bitfield caption="Bus Turnaround Time-Out Error Flag bit" mask="0x00000010" name="BTOEF" values="U1EIR__BTOEF"/>
          <bitfield caption="DMA Error Flag bit" mask="0x00000020" name="DMAEF" values="U1EIR__DMAEF"/>
          <bitfield caption="Bus Matrix Error Flag bit" mask="0x00000040" name="BMXEF" values="U1EIR__BMXEF"/>
          <bitfield caption="Bit Stuff Error Flag bit" mask="0x00000080" name="BTSEF" values="U1EIR__BTSEF"/>
        </register>
        <register name="UEIRCLR" offset="0x224" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register caption="USB Error Interrupt Enable Register" name="UEIE" offset="0x230" rw="RW" size="4">
          <bitfield caption="PID Check Failure Interrupt Enable bit" mask="0x00000001" name="PIDEE" values="U1EIE__PIDEE"/>
          <bitfield caption="(Device mode) CRC5 Host Error Interrupt Enable bit / (Host mode) EOF Error Interrupt Enable bit" mask="0x00000002" name="CRC5EE_EOFEE" values="U1EIE__CRC5EE_EOFEE"/>
          <bitfield caption="CRC16 Failure Interrupt Enable bit" mask="0x00000004" name="CRC16EE" values="U1EIE__CRC16EE"/>
          <bitfield caption="Data Field Size Error Interrupt Enable bit" mask="0x00000008" name="DFN8EE" values="U1EIE__DFN8EE"/>
          <bitfield caption="Bus Turnaround Time-out Error Interrupt Enable bit" mask="0x00000010" name="BTOEE" values="U1EIE__BTOEE"/>
          <bitfield caption="DMA Error Interrupt Enable bit" mask="0x00000020" name="DMAEE" values="U1EIE__DMAEE"/>
          <bitfield caption="Bus Matrix Error Interrupt Enable bit" mask="0x00000040" name="BMXEE" values="U1EIE__BMXEE"/>
          <bitfield caption="Bit Stuff Error Interrupt Enable bit" mask="0x00000080" name="BTSEE" values="U1EIE__BTSEE"/>
        </register>
        <register name="UEIECLR" offset="0x234" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register name="UEIESET" offset="0x238" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register name="UEIEINV" offset="0x23C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register caption="USB Status Register" name="USTAT" offset="0x240" rw="R" size="4">
          <bitfield caption="Ping-Pong BD Pointer Indicator bit" mask="0x00000004" name="PPBI" values="U1STAT__PPBI"/>
          <bitfield caption="Last BD Direction Indicator bit" mask="0x00000008" name="DIR" values="U1STAT__DIR"/>
          <bitfield caption="Encoded Number of Last Endpoint Activity bits" mask="0x000000F0" name="ENDPT" values="U1STAT__ENDPT"/>
        </register>
        <register name="USTATCLR" offset="0x244" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register name="USTATSET" offset="0x248" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register name="USTATINV" offset="0x24C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register caption="USB Control Register" name="UCON" offset="0x250" rw="RW" size="4">
          <bitfield caption="(Device mode)USB Module Enable bit / (Host mode)" mask="0x00000001" name="USBEN_SOFEN" values="U1CON__USBEN_SOFEN"/>
          <bitfield caption="Ping-Pong Buffers Reset bit" mask="0x00000002" name="PPBRST" values="U1CON__PPBRST"/>
          <bitfield caption="RESUME Signaling Enable bit" mask="0x00000004" name="RESUME" values="U1CON__RESUME"/>
          <bitfield caption="Host Mode Enable bit" mask="0x00000008" name="HOSTEN" values="U1CON__HOSTEN"/>
          <bitfield caption="Module Reset bit" mask="0x00000010" name="USBRST" values="U1CON__USBRST"/>
          <bitfield caption="(Device mode) Packet Transfer Disable bit / (Host mode) Token Busy Indicator bit" mask="0x00000020" name="PKTDIS_TOKBUSY" values="U1CON__PKTDIS_TOKBUSY"/>
          <bitfield caption="Live Single-Ended Zero flag bit" mask="0x00000040" name="SE0" values="U1CON__SE0"/>
          <bitfield caption="Live Differential Receiver JSTATE flag bit" mask="0x00000080" name="JSTATE" values="U1CON__JSTATE"/>
        </register>
        <register name="UCONCLR" offset="0x254" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register name="UCONSET" offset="0x258" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register name="UCONINV" offset="0x25C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register caption="USB Address Register" name="UADDR" offset="0x260" rw="RW" size="4">
          <bitfield mask="0x0000007F" name="DEVADDR"/>
          <bitfield caption="Low Speed Enable Indicator bit" mask="0x00000080" name="LSPDEN" values="U1ADDR__LSPDEN"/>
        </register>
        <register name="UADDRCLR" offset="0x264" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register name="UADDRSET" offset="0x268" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register name="UADDRINV" offset="0x26C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register caption="USB BDT Page 1 Register" name="UBDTP1" offset="0x270" rw="RW" size="4">
          <bitfield mask="0x000000FE" name="BDTPTRL"/>
        </register>
        <register name="UBDTP1CLR" offset="0x274" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
