zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
        <register name="UBDTP1SET" offset="0x278" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register name="UBDTP1INV" offset="0x27C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register caption="USB Frame Number Low Register" name="UFRML" offset="0x280" rw="R" size="4">
          <bitfield mask="0x000000FF" name="FRML"/>
        </register>
        <register name="UFRMLCLR" offset="0x284" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register name="UFRMLSET" offset="0x288" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register name="UFRMLINV" offset="0x28C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register caption="USB Frame Number High Register" name="UFRMH" offset="0x290" rw="R" size="4">
          <bitfield mask="0x00000007" name="FRMH"/>
        </register>
        <register name="UFRMHCLR" offset="0x294" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register name="UFRMHSET" offset="0x298" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register name="UFRMHINV" offset="0x29C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register caption="USB Token Register" name="UTOK" offset="0x2a0" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="EP"/>
          <bitfield caption="Token Type Indicator bits" mask="0x000000F0" name="PID" values="U1TOK__PID"/>
        </register>
        <register name="UTOKCLR" offset="0x2a4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register name="UTOKSET" offset="0x2a8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register name="UTOKINV" offset="0x2aC" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register caption="USB SOF Threshold Register" name="USOF" offset="0x2b0" rw="RW" size="4">
          <bitfield caption="SOF Threshold Value bits" mask="0x000000FF" name="CNT" values="U1SOF__CNT"/>
        </register>
        <register name="USOFCLR" offset="0x2b4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register name="USOFSET" offset="0x2b8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register name="USOFINV" offset="0x2bC" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register caption="USB BDT PAGE 2 Register" name="UBDTP2" offset="0x2c0" rw="RW" size="4">
          <bitfield mask="0x000000FF" name="BDTPTRH"/>
        </register>
        <register name="UBDTP2CLR" offset="0x2c4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register name="UBDTP2SET" offset="0x2c8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register name="UBDTP2INV" offset="0x2cc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register caption="USB BDT PAGE 3 Register" name="UBDTP3" offset="0x2d0" rw="RW" size="4">
          <bitfield mask="0x000000FF" name="BDTPTRU"/>
        </register>
        <register name="UBDTP3CLR" offset="0x2d4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register name="UBDTP3SET" offset="0x2d8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register name="UBDTP3INV" offset="0x2dc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register caption="USB Configuration 1 Register" name="UCNFG1" offset="0x2e0" rw="RW" size="4">
          <bitfield caption="Automatic Suspend Enable bit" mask="0x00000001" name="AUTO_SUSP" values="U1CNFG1__UASUSPND"/>
          <bitfield caption="Low-Speed Device Enable bit" mask="0x00000008" name="LSDEV" values="U1CNFG1__LSDEV"/>
          <bitfield caption="Stop in Idle Mode bit" mask="0x00000010" name="PSIDL" values="U1CNFG1__USBSIDL"/>
          <bitfield caption="Freeze in Debug mode" mask="0x00000020" name="PFRZ" values="U1CNFG1__PFRZ"/>
          <bitfield caption="USB" mask="0x00000040" name="UOEMON" values="U1CNFG1__UOEMON"/>
          <bitfield caption="USB Eye-Pattern Test Enable bit" mask="0x00000080" name="UTEYE" values="U1CNFG1__UTEYE"/>
        </register>
        <register name="UCNFG1CLR" offset="0x2e4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register name="UCNFG1SET" offset="0x2e8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register name="UCNFG1INV" offset="0x2ec" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
		 </register>
        <register-group name="USB_UEP" name-in-module="UEP" offset="0x300" size="0x10" count="16"/>
      </register-group>
      <value-group caption="A-Device" name="U1OTGIR__VBUSVDIF">
        <value caption="Change on usb_a_vbus_vld input detected" name="CHANGE" value="0x1"/>
        <value caption="No change on usb_a_vbus_vld input detected" name="NO_CHANGE" value="0x0"/>
      </value-group>
      <value-group caption="B-Device" name="U1OTGIR__SESENDIF">
        <value caption="Change on usb_b_sess_end input detected" name="CHANGE" value="0x1"/>
        <value caption="No change on usb_b_sess_end input detected" name="NO_CHANGED" value="0x0"/>
      </value-group>
      <value-group caption="Session Valid Change Indicator bit" name="U1OTGIR__SESVDIF">
        <value caption="Change on usb_sess_vld input detected" name="CHANGE" value="0x1"/>
        <value caption="No change on usb_sess_vld input detected" name="NO_CHANGED" value="0x0"/>
      </value-group>
      <value-group caption="Bus Activity Indicator bit" name="U1OTGIR__ACTVIF">
        <value caption="Activity on the D+, D-, ID, or VBus lines has been detected" name="DETECT" value="0x1"/>
        <value caption="Active has not been detected" name="NO_DETECT" value="0x0"/>
      </value-group>
      <value-group caption="Line State Stable Indicator bit" name="U1OTGIR__LSTATEIF">
        <value caption="USB line state has been stable for 1ms" name="STABLE" value="0x1"/>
        <value caption="USB line state has not been stable for 1ms" name="NOT_STABLE" value="0x0"/>
      </value-group>
      <value-group caption="1 Millisecond Timer bit" name="U1OTGIR__T1MSECIF">
        <value caption="1ms timer has expired" name="EXPIRE" value="0x1"/>
        <value caption="1ms timer has not expired" name="NOT_EXPIRE" value="0x0"/>
      </value-group>
      <value-group caption="ID State Change Indicator bit" name="U1OTGIR__IDIF">
        <value caption="Change in ID state is detected" name="DETECT" value="0x1"/>
        <value caption="No change in ID state is detected" name="NO_DETECT" value="0x0"/>
      </value-group>
      <value-group caption="A- Vbus Valid Interrupt Enable bit" name="U1OTGIE__VBUSVDIE">
        <value caption="A-Vbus valid interrupt is enabled" name="ON" value="0x1"/>
        <value caption="A-Vbus valid interrupt is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="B-Session End Interrupt Enable bit" name="U1OTGIE__SESENDIE">
        <value caption="B-session end interrupt is enabled" name="ON" value="0x1"/>
        <value caption="B-session end interrupt is disabled" name="OFF" value="0x0"/>
      </value-group>
