zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
      <value-group caption="Session Valid Interrupt Enable bit" name="U1OTGIE__SESVDIE">
        <value caption="Session valid interrupt is enabled" name="ON" value="0x1"/>
        <value caption="Session valid interrupt is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Bus Activity Interrupt Enable bit" name="U1OTGIE__ACTVIE">
        <value caption="ACTIVITY interrupt is enabled" name="ON" value="0x1"/>
        <value caption="ACTIVITY interrupt is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Line State Interrupt Enable bit" name="U1OTGIE__LSTATEIE">
        <value caption="Line state interrupt is enabled" name="ON" value="0x1"/>
        <value caption="Line state interrupt is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="1 Millisecond Timer Interrupt Enable bit" name="U1OTGIE__T1MSECIE">
        <value caption="1 millisecond timer interrupt is enabled" name="ON" value="0x1"/>
        <value caption="1 millisecond timer interrupt is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="ID Interrupt Enable bit" name="U1OTGIE__IDIE">
        <value caption="ID interrupt is enabled" name="ON" value="0x1"/>
        <value caption="ID interrupt is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="A-Device Vbus Valid Indicator bit" name="U1OTGSTAT__VBUSVD">
        <value caption="Vbus voltage is above VA_VBUS_VLD on the A device" name="ABOVE" value="0x1"/>
        <value caption="Vbus voltage is below VA_VBUS_VLD on the A device" name="BELOW" value="0x0"/>
      </value-group>
      <value-group caption="B-Device Session End Indicator bit" name="U1OTGSTAT__SESEND">
        <value caption="Vbus voltage is below VB_SESS_END on the B device" name="BELOW" value="0x1"/>
        <value caption="Vbus voltage is above VB_SESS_END on the B device" name="ABOVE" value="0x0"/>
      </value-group>
      <value-group caption="Session Valid Indicator bit" name="U1OTGSTAT__SESVD">
        <value caption="Vbus voltage is above Session Valid on the A or B device" name="ABOVE" value="0x1"/>
        <value caption="Vbus voltage is below Session Valid on the A or B device" name="BELOW" value="0x0"/>
      </value-group>
      <value-group caption="Line State Stable Indicator bit" name="U1OTGSTAT__LSTATE">
        <value caption="USB line state (UCTRL[SE0 and JSTATE]) has been stable for the previous 1 ms" name="STABLE" value="0x1"/>
        <value caption="USB line state (UCTRL[SE0 and JSTATE]) has not been stable for the previous 1 ms" name="NOT_STABLE" value="0x0"/>
      </value-group>
      <value-group caption="ID Pin State Indicator bit" name="U1OTGSTAT__ID">
        <value caption="No cable is attached or a Type-B cable has been plugged into the USB receptacle" name="NOT_PLUG" value="0x1"/>
        <value caption="A Type-A cable has been plugged into the USB receptacle" name="PLUG" value="0x0"/>
      </value-group>
      <value-group caption="Vbus Discharge Enable bit" name="U1OTGCON__VBUSDIS">
        <value caption="Vbus line is discharged through a pull-down resistor" name="DISCHG" value="0x1"/>
        <value caption="Vbus line is not discharged through a resistor" name="NOT_DISCHG" value="0x0"/>
      </value-group>
      <value-group caption="Vbus Charge Enable bit" name="U1OTGCON__VBUSCHG">
        <value caption="Vbus line is charged through a pull-up resistor" name="CHG" value="0x1"/>
        <value caption="Vbus line is not charged through a resistor" name="NOT_CHG" value="0x0"/>
      </value-group>
      <value-group caption="OTG Functionality Enable bit" name="U1OTGCON__OTGEN">
        <value caption="DPPULUP" name="ON" value="0x1"/>
        <value caption="DPPULUP" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Vbus Power-on bit" name="U1OTGCON__VBUSON">
        <value caption="Vbus line is powered" name="ON" value="0x1"/>
        <value caption="Vbus line is not powered" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="D- Pull-Down Enable bit" name="U1OTGCON__DMPULDWN">
        <value caption="D- data line pull-down resistor is enabled" name="ON" value="0x1"/>
        <value caption="D- data line pull-down resistor is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="D+ Pull-Down Enable bit" name="U1OTGCON__DPPULDWN">
        <value caption="D+ data line pull-down resistor is enabled" name="ON" value="0x1"/>
        <value caption="D+ data line pull-down resistor is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="D- Pull-Up Enable bit" name="U1OTGCON__DMPULUP">
        <value caption="D- data line pull-up resistor is enabled" name="ON" value="0x1"/>
        <value caption="D- data line pull-up resistor is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="D+ Pull-Up Enable bit" name="U1OTGCON__DPPULUP">
        <value caption="D+ data line pull-up resistor is enabled" name="ON" value="0x1"/>
        <value caption="D+ data line pull-up resistor is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="USB Operation Enable bit" name="U1PWRC__USBPWR">
        <value caption="USB module is turned on" name="ON" value="0x1"/>
        <value caption="USB module is disabled (Outputs held inactive" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="USB Suspend Mode bit" name="U1PWRC__USUSPEND">
        <value caption="USB module is placed in Suspend mode (The 48 MHz USB clock will be gated off. The transceiver is placed in a low-power state.)" name="SUSPEND" value="0x1"/>
        <value caption="USB module operates normally" name="NORMAL" value="0x0"/>
      </value-group>
      <value-group caption="USB Module Busy bit" name="U1PWRC__USBBUSY">
        <value caption="USB module is active or disabled" name="ACTIVE_OR_DISALBE" value="0x1"/>
        <value caption="USB module is not active and is ready to be enabled" name="NOT_ACTIVE_AND_READY" value="0x0"/>
      </value-group>
