zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
      <value-group caption="USB Sleep Entry Guard bit" name="U1PWRC__USLPGRD">
        <value caption="Sleep entry is blocked if USB bus activity is detected or if a notification is pending" name="BLOCK_SLEEP" value="0x1"/>
        <value caption="USB module does not block Sleep entry" name="NO_BLOCK" value="0x0"/>
      </value-group>
      <value-group caption="USB Activity Pending bit" name="U1PWRC__UACTPND">
        <value caption="USB hardware has detected a change in link status" name="CHANGE" value="0x1"/>
        <value caption="USB Hardware in normal operation mode" name="NORMAL" value="0x0"/>
      </value-group>
      <value-group caption="(Device mode) USB Reset Interrupt bit Device mode / (Host mode)USB Detach Interrupt bit Host mode" name="U1IR__URSTIF_DETACHIF">
        <value caption="(Device mode)Valid USB Reset has occurred / (Host mode)Peripheral detachment was detected by the USB module" name="DETECT" value="0x1"/>
        <value caption="(Device mode)No USB Reset has occurred / (Host mode)Peripheral detachment was not detected" name="NOT_DETECT" value="0x0"/>
      </value-group>
      <value-group caption="USB Error Condition Interrupt bit" name="U1IR__UERRIF">
        <value caption="Unmasked error condition has occurred" name="ERROR" value="0x1"/>
        <value caption="Unmasked error condition has not occurred" name="NO_ERROR" value="0x0"/>
      </value-group>
      <value-group caption="SOF Token Interrupt bit" name="U1IR__SOFIF">
        <value caption="SOF token received by the peripheral or the SOF threshold reached by the host" name="SOF_RCVE" value="0x1"/>
        <value caption="SOF token was not received nor threshold reached" name="NO_SOF" value="0x0"/>
      </value-group>
      <value-group caption="Token Processing Complete Interrupt bit" name="U1IR__TRNIF">
        <value caption="Processing of current token is complete; a read of the UxSTAT register will provide endpoint information" name="READY" value="0x1"/>
        <value caption="Processing of current token not complete" name="NOT_READY" value="0x0"/>
      </value-group>
      <value-group caption="Idle Detect Interrupt bit" name="U1IR__IDLEIF">
        <value caption="Idle condition detected (constant Idle state of 3 ms or more)" name="IDLE" value="0x1"/>
        <value caption="No Idle condition detected" name="NOT_IDLE" value="0x0"/>
      </value-group>
      <value-group caption="Resume Interrupt bit" name="U1IR__RESUMEIF">
        <value caption="K-State is observed on the D+ or D- pin for 2.5 s" name="K_STATE" value="0x1"/>
        <value caption="K-State is not observed" name="NORMAL" value="0x0"/>
      </value-group>
      <value-group caption="Peripheral Attach Interrupt bit" name="U1IR__ATTACHIF">
        <value caption="Peripheral attachment was detected by the USB module" name="DETECT" value="0x1"/>
        <value caption="Peripheral attachment was not detected" name="NOT_DETECT" value="0x0"/>
      </value-group>
      <value-group caption="STALL Handshake Interrupt bit" name="U1IR__STALLIF">
        <value caption="A STALL handshake was sent by Peripheral or received by Host during the handshake phase of the transaction" name="HANDSHAKE" value="0x1"/>
        <value caption="STALL handshake has not been sent" name="NO_HANDSHAKE" value="0x0"/>
      </value-group>
      <value-group caption="(Device mode) USB Reset Interrupt Enable bit Device mode / (Host mode)USB Detach Interrupt Enable bit Host Mode" name="U1IE__URSTIE_DETACHIE">
        <value caption="(Device mode) URSTIF interrupt is enabled / (Host mode) DATTCHIF interrupt is enabled" name="ON" value="0x1"/>
        <value caption="(Device mode) URSTIF interrupt is disabled / (Host mode) DATTCHIF interrupt is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="USB Error Interrupt Enable bit" name="U1IE__UERRIE">
        <value caption="USB Error interrupt is enabled" name="ON" value="0x1"/>
        <value caption="USB Error interrupt is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="SOF Token Interrupt Enable bit" name="U1IE__SOFIE">
        <value caption="SOFIF interrupt is enabled" name="ON" value="0x1"/>
        <value caption="SOFIF interrupt is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Token Processing Complete Interrupt Enable bit" name="U1IE__TRNIE">
        <value caption="TRNIF interrupt is enabled" name="ON" value="0x1"/>
        <value caption="TRNIF interrupt is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Idle Detect Interrupt Enable bit" name="U1IE__IDLEIE">
        <value caption="Idle interrupt is enabled" name="ON" value="0x1"/>
        <value caption="Idle interrupt is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="RESUME Interrupt Enable bit" name="U1IE__RESUMEIE">
        <value caption="RESUME interrupt is enabled" name="ON" value="0x1"/>
        <value caption="RESUME interrupt is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="ATTACH Interrupt Enable bit" name="U1IE__ATTACHIE">
        <value caption="ATTACH interrupt is enabled" name="ON" value="0x1"/>
        <value caption="ATTACH interrupt is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="STALL Handshake Interrupt Enable bit" name="U1IE__STALLIE">
        <value caption="STALL interrupt is enabled" name="ON" value="0x1"/>
        <value caption="STALL interrupt is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="PID Check Failure Flag bit" name="U1EIR__PIDEF">
        <value caption="PID check failed" name="FAIL" value="0x1"/>
        <value caption="PID check passed" name="PASS" value="0x0"/>
      </value-group>
      <value-group caption="(Device mode)CRC5 Host Error Flag bit / (Host mode)EOF Error Flag bit" name="U1EIR__CRC5EF_EOFEF">
        <value caption="(Device mode)Token packet rejected due to CRC5 error / (Host mode)EOF error condition detected" name="ERROR" value="0x1"/>
        <value caption="(Device mode)Token packet accepted / (Host mode)No EOF error condition" name="NO_ERROR" value="0x0"/>
      </value-group>
