zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
      <value-group caption="CRC16 Failure Flag bit" name="U1EIR__CRC16EF">
        <value caption="Data packet rejected due to CRC16 error" name="ERROR" value="0x1"/>
        <value caption="Data packet accepted" name="NO_ERROR" value="0x0"/>
      </value-group>
      <value-group caption="Data Field Size Error Flag bit" name="U1EIR__DFN8EF">
        <value caption="Data field received is not an integral number of bytes" name="NOT_INTEGRAL" value="0x1"/>
        <value caption="Data field received is an integral number of bytes" name="INTEGRAL" value="0x0"/>
      </value-group>
      <value-group caption="Bus Turnaround Time-Out Error Flag bit" name="U1EIR__BTOEF">
        <value caption="Bus turnaround time-out has occurred" name="TIMEOUT" value="0x1"/>
        <value caption="No bus turnaround time-out" name="NO_TIMEOUT" value="0x0"/>
      </value-group>
      <value-group caption="DMA Error Flag bit" name="U1EIR__DMAEF">
        <value caption="USB DMA error condition detected" name="ERROR" value="0x1"/>
        <value caption="No DMA error" name="NO_ERROR" value="0x0"/>
      </value-group>
      <value-group caption="Bus Matrix Error Flag bit" name="U1EIR__BMXEF">
        <value caption="BVCI access initiated on BMX returned response error" name="ERROR" value="0x1"/>
        <value caption="No address error" name="NO_ERROR" value="0x0"/>
      </value-group>
      <value-group caption="Bit Stuff Error Flag bit" name="U1EIR__BTSEF">
        <value caption="Packet rejected due to bit stuff error" name="ERROR" value="0x1"/>
        <value caption="Packet accepted" name="NO_ERROR" value="0x0"/>
      </value-group>
      <value-group caption="PID Check Failure Interrupt Enable bit" name="U1EIE__PIDEE">
        <value caption="PIDEF interrupt is enabled" name="ON" value="0x1"/>
        <value caption="PIDEF interrupt is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="(Device mode) CRC5 Host Error Interrupt Enable bit / (Host mode) EOF Error Interrupt Enable bit" name="U1EIE__CRC5EE_EOFEE">
        <value caption="(Device mode)CRC5EF interrupt is enabled / (Host mode)EOF interrupt is enabled" name="ON" value="0x1"/>
        <value caption="(Device mode)CRC5EF interrupt is disabled / (Host mode)EOF interrupt is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="CRC16 Failure Interrupt Enable bit" name="U1EIE__CRC16EE">
        <value caption="CRC16EF interrupt is enabled" name="ON" value="0x1"/>
        <value caption="CRC16EF interrupt is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Data Field Size Error Interrupt Enable bit" name="U1EIE__DFN8EE">
        <value caption="DFN8EF interrupt is enabled" name="ON" value="0x1"/>
        <value caption="DFN8EF interrupt is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Bus Turnaround Time-out Error Interrupt Enable bit" name="U1EIE__BTOEE">
        <value caption="BTOEF interrupt is enabled" name="ON" value="0x1"/>
        <value caption="BTOEF interrupt is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="DMA Error Interrupt Enable bit" name="U1EIE__DMAEE">
        <value caption="DMAEF interrupt is enabled" name="ON" value="0x1"/>
        <value caption="DMAEF interrupt is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Bus Matrix Error Interrupt Enable bit" name="U1EIE__BMXEE">
        <value caption="BMXEF interrupt is enabled" name="ON" value="0x1"/>
        <value caption="BMXEF interrupt is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Bit Stuff Error Interrupt Enable bit" name="U1EIE__BTSEE">
        <value caption="BTSEF interrupt is enabled" name="ON" value="0x1"/>
        <value caption="BTSEF interrupt is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Ping-Pong BD Pointer Indicator bit" name="U1STAT__PPBI">
        <value caption="The last transaction was to the ODD BD bank" name="ODD" value="0x1"/>
        <value caption="The last transaction was to the EVEN BD bank" name="EVEN" value="0x0"/>
      </value-group>
      <value-group caption="Last BD Direction Indicator bit" name="U1STAT__DIR">
        <value caption="Last transaction was a transmit transfer (TX)" name="TX" value="0x1"/>
        <value caption="Last transaction was a receive transfer (RX)" name="RX" value="0x0"/>
      </value-group>
      <value-group caption="Encoded Number of Last Endpoint Activity bits" name="U1STAT__ENDPT">
        <value caption="Endpoint 15" name="EP_15" value="0xf"/>
        <value caption="Endpoint 14" name="EP_14" value="0xe"/>
        <value caption="Endpoint 1" name="EP_1" value="0x1"/>
        <value caption="Endpoint 0" name="EP_0" value="0x0"/>
      </value-group>
      <value-group caption="(Device mode)USB Module Enable bit / (Host mode)" name="U1CON__USBEN_SOFEN">
        <value caption="(Device mode)USB module and supporting circuitry is enabled / (Host mode)SOF token sent every 1 ms" name="ON" value="0x1"/>
        <value caption="(Device mode)USB module and supporting circuitry is disabled / (Host mode)SOF token disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Ping-Pong Buffers Reset bit" name="U1CON__PPBRST">
        <value caption="Reset all Even/Odd buffer pointers to the EVEN BD banks" name="RESET" value="0x1"/>
        <value caption="Even/Odd buffer pointers not being Reset" name="NO_RESET" value="0x0"/>
      </value-group>
      <value-group caption="RESUME Signaling Enable bit" name="U1CON__RESUME">
        <value caption="RESUME signaling is activated" name="ON" value="0x1"/>
        <value caption="RESUME signaling is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Host Mode Enable bit" name="U1CON__HOSTEN">
        <value caption="USB host capability is enabled" name="ON" value="0x1"/>
        <value caption="USB host capability is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Module Reset bit" name="U1CON__USBRST">
        <value caption="USB reset is generated" name="RESET_GENERATED" value="0x1"/>
        <value caption="USB reset is terminated" name="RESET_TERMINATED" value="0x0"/>
      </value-group>
