zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
        <register name="SUBSYS_STATUS_REG1" offset="0x24" rw="R" size="4" access-size="4" initval="0x00000000" caption="SUBSYS_STATUS_REG1">
          <bitfield name="pllc_ready_cnt_expire_raw" caption="pllc_ready_cnt_expire_raw" mask="0x100"/>
          <bitfield name="pll_lock_fifo_empty" caption="XTAL_ready" mask="0x80"/>
          <bitfield name="clk_mux_sel" caption="clk_mux_sel0" mask="0x60"/>
          <bitfield name="clk_lp_ready" caption="clk_lp_ready" mask="0x10"/>
          <bitfield name="PLL_locked" caption="PLL_locked" mask="0x8"/>
          <bitfield name="XTAL_ready" caption="XTAL_ready" mask="0x4"/>
          <bitfield name="pll_lock_out" caption="pll_lock_out" mask="0x2"/>
          <bitfield name="xtal_ready_out" caption="xtal_ready_out" mask="0x1"/>
        </register>
        <register name="SUBSYS_STATUS_REG2" offset="0x28" rw="R" size="4" access-size="4" initval="0x00000000" caption="SUBSYS_STATUS_REG2">
          <bitfield name="PART_NUM" caption="PART_NUM" mask="0xFF00"/>
          <bitfield name="VERSION_NUM" caption="VERSION_NUM" mask="0xFF"/>
        </register>
      </register-group>
    </module>
    <module name="ARB" id="04269" version="1.0" caption="Radio Arbiter">
      <register-group name="ARB" caption="">
        <register name="ARB_BT_CTRL" offset="0x0" rw="RW" size="4" access-size="4" initval="0x0000000A" caption="">
          <bitfield name="MAX_ABORT_TIME_BT" caption="BT max abort time" mask="0xFF"/>
          <bitfield name="ALLOW_OPT_RX_BT" caption="BT allow optimistic rx" mask="0x100"/>
          <bitfield name="ALLOW_OPT_TX_BT" caption="BT allow optimistic tx" mask="0x200"/>
        </register>
        <register name="ARB_ZB_CTRL" offset="0x4" rw="RW" size="4" access-size="4" initval="0x0000000A" caption="">
          <bitfield name="MAX_ABORT_TIME_ZB" caption="ZB max abort time" mask="0xFF"/>
          <bitfield name="ALLOW_OPT_RX_ZB" caption="ZB allow optimistic rx" mask="0x100"/>
          <bitfield name="ALLOW_OPT_TX_ZB" caption="ZB allow optimistic tx" mask="0x200"/>
        </register>
        <register name="ARB_EVENT_CTRL" offset="0x8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="START_TIME_ALLOWANCE" caption="minimum change needed in the start time to be considered as an arbitration event." mask="0xF"/>
          <bitfield name="USE_END_TIME_AS_EVENT" caption="" mask="0x10"/>
          <bitfield name="USE_START_TIME_AS_EVENT" caption="" mask="0x20"/>
          <bitfield name="USE_PRIO_AS_EVENT" caption="" mask="0x40"/>
          <bitfield name="DELAYED_OK_TASKS_DONT_WAIT" caption="" mask="0x80"/>
          <bitfield name="RESOLVE_EQUAL_PRIO" caption="" mask="0x300"/>
          <bitfield name="ABORT_IN_STATIC_MODE" caption="" mask="0x400"/>
        </register>
        <register name="ARB_CORE_CTRL" offset="0xC" rw="RW" size="4" access-size="4" initval="0x00000140" caption="">
          <bitfield name="RADIO_ARB_MODE" caption="" mask="0x3"/>
          <bitfield name="TESTBUS_SELECT" caption="" mask="0xC"/>
          <bitfield name="CFG_CDC_ADJ_VAL" caption="" mask="0xF0"/>
          <bitfield name="AD_ARB_SOFT_RESET" caption="" mask="0x100"/>
          <bitfield name="ARB_TESTBUS_BYTE_SELECT" caption="" mask="0x600"/>
          <bitfield name="RESERVED_1" caption="" mask="0xF800"/>
          <bitfield name="RAD_ARB_TIMEOUT" caption="" mask="0xFFFF0000"/>
        </register>
        <register name="ARB_CORE_STATUS" offset="0x10" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="ARB_CORE_STATE" caption="" mask="0x7"/>
          <bitfield name="NEXT_RADIO_OWNER" caption="" mask="0x18"/>
          <bitfield name="CUR_RADIO_OWNER" caption="" mask="0x60"/>
          <bitfield name="CUR_REQ_PRI" caption="" mask="0x780"/>
        </register>
        <register name="ARB_INT_STATUS" offset="0x14" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="BT_ABORT_HIZB" caption="" mask="0x1"/>
          <bitfield name="ZB_ABORT_HIBT" caption="" mask="0x2"/>
          <bitfield name="BT_RADIO_TO_ABRT" caption="" mask="0x4"/>
          <bitfield name="ZB_RADIO_TO_ABRT" caption="" mask="0x8"/>
          <bitfield name="BT_TIMESENSE_REQ_LOSS" caption="" mask="0x10"/>
          <bitfield name="ZB_TIMESENSE_REQ_LOSS" caption="" mask="0x20"/>
          <bitfield name="COLLISION_PREDICTED" caption="" mask="0x40"/>
          <bitfield name="ARB_IDLE" caption="" mask="0x80"/>
        </register>
        <register name="ARB_INT_MASK" offset="0x18" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="BT_ABORT_HIZB_MSK" caption="" mask="0x1"/>
          <bitfield name="ZB_ABORT_HIBT_MSK" caption="" mask="0x2"/>
          <bitfield name="BT_RADIO_TO_ABRT_MSK" caption="" mask="0x4"/>
          <bitfield name="ZB_RADIO_TO_ABRT_MSK" caption="" mask="0x8"/>
          <bitfield name="BT_TIMESENSE_REQ_LOSS_MSK" caption="" mask="0x10"/>
          <bitfield name="ZB_TIMESENSE_REQ_LOSS_MSK" caption="" mask="0x20"/>
          <bitfield name="COLLISION_PREDICTED_MSK" caption="" mask="0x40"/>
          <bitfield name="ARB_IDLE_MSK" caption="" mask="0x80"/>
        </register>
      </register-group>
    </module>
    <module name="CoreDebug" id="SYSTEM_IP" version="1.0.0" caption="Core Debug Register">
      <register-group name="CoreDebug" caption="Core Debug Register">
        <register name="DHCSR" offset="0x0" rw="RW" size="4" access-size="4" caption="Debug Halting Control and Status Register">
          <bitfield name="C_DEBUGEN" caption="" mask="0x1"/>
          <bitfield name="C_HALT" caption="" mask="0x2"/>
          <bitfield name="C_STEP" caption="" mask="0x4"/>
          <bitfield name="C_MASKINTS" caption="" mask="0x8"/>
          <bitfield name="C_SNAPSTALL" caption="" mask="0x20"/>
          <bitfield name="S_REGRDY" caption="" mask="0x10000"/>
          <bitfield name="S_HALT" caption="" mask="0x20000"/>
          <bitfield name="S_SLEEP" caption="" mask="0x40000"/>
          <bitfield name="S_LOCKUP" caption="" mask="0x80000"/>
          <bitfield name="S_RETIRE_ST" caption="" mask="0x1000000"/>
          <bitfield name="S_RESET_ST" caption="" mask="0x2000000"/>
        </register>
