zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
        <register name="ICSR" offset="0xD04" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Interrupt Control and State Register">
          <bitfield name="VECTACTIVE" caption="Active exception number" mask="0x1FF"/>
          <bitfield name="RETTOBASE" caption="No preempted active exceptions to execute" mask="0x800"/>
          <bitfield name="VECTPENDING" caption="Exception number of the highest priority pending enabled exception" mask="0x3F000"/>
          <bitfield name="ISRPENDING" caption="Interrupt pending flag" mask="0x400000"/>
          <bitfield name="ISRPREEMPT" caption="Debug only" mask="0x800000"/>
          <bitfield name="PENDSTCLR" caption="SysTick clear-pending bit" mask="0x2000000" values="ICSR__PENDSTCLR"/>
          <bitfield name="PENDSTSET" caption="SysTick set-pending bit" mask="0x4000000" values="ICSR__PENDSTSET"/>
          <bitfield name="PENDSVCLR" caption="PendSV clear-pending bit" mask="0x8000000" values="ICSR__PENDSVCLR"/>
          <bitfield name="PENDSVSET" caption="PendSV set-pending bit" mask="0x10000000" values="ICSR__PENDSVSET"/>
          <bitfield name="NMIPENDSET" caption="NMI set-pending bit" mask="0x80000000" values="ICSR__NMIPENDSET"/>
        </register>
        <register name="VTOR" offset="0xD08" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Vector Table Offset Register">
          <bitfield name="TBLOFF" caption="Vector table base offset" mask="0xFFFFFF80"/>
        </register>
        <register name="AIRCR" offset="0xD0C" rw="RW" size="4" access-size="4" initval="0xFA050000" caption="Application Interrupt and Reset Control Register">
          <bitfield name="VECTRESET" caption="Must write 0" mask="0x1"/>
          <bitfield name="VECTCLRACTIVE" caption="Must write 0" mask="0x2"/>
          <bitfield name="SYSRESETREQ" caption="System Reset Request" mask="0x4" values="AIRCR__SYSRESETREQ"/>
          <bitfield name="PRIGROUP" caption="Interrupt priority grouping" mask="0x700"/>
          <bitfield name="ENDIANNESS" caption="Data endianness, 0=little, 1=big" mask="0x8000" values="AIRCR__ENDIANNESS"/>
          <bitfield name="VECTKEY" caption="Register key" mask="0xFFFF0000"/>
        </register>
        <register name="SCR" offset="0xD10" rw="RW" size="4" access-size="4" initval="0x00000000" caption="System Control Register">
          <bitfield name="SLEEPONEXIT" caption="Sleep-on-exit on handler return" mask="0x2" values="SCR__SLEEPONEXIT"/>
          <bitfield name="SLEEPDEEP" caption="Deep Sleep used as low power mode" mask="0x4" values="SCR__SLEEPDEEP"/>
          <bitfield name="SEVONPEND" caption="Send Event on Pending bit" mask="0x10" values="SCR__SEVONPEND"/>
        </register>
        <register name="CCR" offset="0xD14" rw="RW" size="4" access-size="4" initval="0x00000200" caption="Configuration and Control Register">
          <bitfield name="NONBASETHRDENA" caption="Indicates how processor enters Thread mode" mask="0x1"/>
          <bitfield name="USERSETMPEND" caption="Enables unprivileged software access to STIR register" mask="0x2"/>
          <bitfield name="UNALIGN_TRP" caption="Enables unaligned access traps" mask="0x8" values="CCR__UNALIGN_TRP"/>
          <bitfield name="DIV_0_TRP" caption="Enables divide by 0 trap" mask="0x10"/>
          <bitfield name="BFHFNMIGN" caption="Ignore LDM/STM BusFault for -1/-2 priority handlers" mask="0x100"/>
          <bitfield name="STKALIGN" caption="Indicates stack alignment on exception entry" mask="0x200" values="CCR__STKALIGN"/>
        </register>
        <register name="SHPR1" offset="0xD18" rw="RW" size="4" access-size="4" caption="System Handler Priority Register 1">
          <bitfield name="PRI_4" caption="Priority of system handler 4, MemManage" mask="0xFF"/>
          <bitfield name="PRI_5" caption="Priority of system handler 5, BusFault" mask="0xFF00"/>
          <bitfield name="PRI_6" caption="Priority of system handler 6, UsageFault" mask="0xFF0000"/>
        </register>
        <register name="SHPR2" offset="0xD1C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="System Handler Priority Register 2">
          <bitfield name="PRI_11" caption="Priority of system handler 11, SVCall" mask="0xFF000000"/>
        </register>
        <register name="SHPR3" offset="0xD20" rw="RW" size="4" access-size="4" initval="0x00000000" caption="System Handler Priority Register 3">
          <bitfield name="PRI_14" caption="Priority of system handler 14, PendSV" mask="0xFF0000"/>
          <bitfield name="PRI_15" caption="Priority of system handler 15, SysTick exception" mask="0xFF000000"/>
        </register>
        <register name="SHCSR" offset="0xD24" rw="RW" size="4" access-size="4" caption="System Handler Control and State Register">
          <bitfield name="MEMFAULTACT" caption="MemManage exception active bit" mask="0x1"/>
          <bitfield name="BUSFAULTACT" caption="BusFault exception active bit" mask="0x2"/>
          <bitfield name="USGFAULTACT" caption="UsageFault exception active bit" mask="0x8"/>
          <bitfield name="SVCALLACT" caption="SVCall active bit" mask="0x80"/>
          <bitfield name="MONITORACT" caption="DebugMonitor exception active bit" mask="0x100"/>
          <bitfield name="PENDSVACT" caption="PendSV exception active bit" mask="0x400"/>
          <bitfield name="SYSTICKACT" caption="SysTick exception active bit" mask="0x800"/>
          <bitfield name="USGFAULTPENDED" caption="UsageFault exception pending bit" mask="0x1000"/>
          <bitfield name="MEMFAULTPENDED" caption="MemManage exception pending bit" mask="0x2000"/>
          <bitfield name="BUSFAULTPENDED" caption="BusFault exception pending bit" mask="0x4000"/>
          <bitfield name="SVCALLPENDED" caption="SVCall pending bit" mask="0x8000"/>
          <bitfield name="MEMFAULTENA" caption="MemManage enable bit" mask="0x10000"/>
          <bitfield name="BUSFAULTENA" caption="BusFault enable bit" mask="0x20000"/>
          <bitfield name="USGFAULTENA" caption="UsageFault enable bit" mask="0x40000"/>
        </register>
