zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/atdf/PIC32CX2051BZ66048.atdf
    <module name="ZIGBEE" id="04998" name2="zb_mac_v3" version="A" caption="ZigBee MAC DOS">
      <register-group name="ZIGBEE" caption="Zero Radio Registers"/>
    </module>
  </modules>
  <pinouts>
    <pinout name="QFN48" caption="QFN48">
      <pin position="1" pad="VPMU_VDD"/>
      <pin position="2" pad="PA0"/>
      <pin position="3" pad="PA1"/>
      <pin position="4" pad="PA2"/>
      <pin position="5" pad="PA5"/>
      <pin position="6" pad="VDD"/>
      <pin position="7" pad="PA6"/>
      <pin position="8" pad="PA7"/>
      <pin position="9" pad="PA8"/>
      <pin position="10" pad="PA9"/>
      <pin position="11" pad="PA10"/>
      <pin position="12" pad="PB12"/>
      <pin position="13" pad="PB13"/>
      <pin position="14" pad="PB9"/>
      <pin position="15" pad="PB8"/>
      <pin position="16" pad="PA4"/>
      <pin position="17" pad="PA13"/>
      <pin position="18" pad="PA14"/>
      <pin position="19" pad="PB11"/>
      <pin position="20" pad="PB10"/>
      <pin position="21" pad="CLDO_IN"/>
      <pin position="22" pad="XO_N"/>
      <pin position="23" pad="XO_P"/>
      <pin position="24" pad="VDD_RF"/>
      <pin position="25" pad="CLDO_OUT"/>
      <pin position="26" pad="RFLDO_OUT"/>
      <pin position="27" pad="CLDO_BUCK"/>
      <pin position="28" pad="BUCK_PA"/>
      <pin position="29" pad="RFIO"/>
      <pin position="30" pad="NC"/>
      <pin position="31" pad="PB6"/>
      <pin position="32" pad="PA3"/>
      <pin position="33" pad="PB2"/>
      <pin position="34" pad="PB4"/>
      <pin position="35" pad="PB3"/>
      <pin position="36" pad="AVDD"/>
      <pin position="37" pad="PB7"/>
      <pin position="38" pad="VDD"/>
      <pin position="39" pad="PB0"/>
      <pin position="40" pad="PB1"/>
      <pin position="41" pad="SOC_LDO_VDD_IN"/>
      <pin position="42" pad="PB5"/>
      <pin position="43" pad="MCLR"/>
      <pin position="44" pad="PA11"/>
      <pin position="45" pad="PA12"/>
      <pin position="46" pad="PMU_MLDO"/>
      <pin position="47" pad="VPMU_VDD"/>
      <pin position="48" pad="PMU_BK"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
